{
  "metadata": {
    "batch_name": "Oct-Dec 2024",
    "date_range": "2024-10-01 to 2024-12-31",
    "total_collected": 812,
    "timestamp": "2025-10-26T04:56:02.327Z"
  },
  "tweets": [
    {
      "id": "1873819667283751233",
      "thread_id": "1873818403276050914",
      "content": "everything else remains true:\n\nyou need people to do big things\nyou need people to go further\nyou need people to give shape and texture to your existence\n\nand it would be really stupid for you to construe what i'm saying as advice, and even stupider to try to apply it.\n\nit is not something that can be prescribed and bought wholesale over the counter."
    },
    {
      "id": "1873818403276050914",
      "thread_id": "1873817735299555762",
      "content": "also, don't make the mistake of thinking the constraints are financial. all the real constraints are psychological, and there's no dearth of super-rich and super-enslaved people."
    },
    {
      "id": "1873817735299555762",
      "thread_id": "1873816436176507208",
      "content": "outside of a few rare cases, everyone is just trying to domesticate each other into being a good boy. what's good changes with the times and the bubbles you inhabit, but everyone around you is trying to force you to be a kind of person"
    },
    {
      "id": "1873816436176507208",
      "thread_id": "1873816436176507208",
      "content": "happy to say that i'm relatively quite unconstrained by this network of relationships because i never built it for the same reason. and i've made my peace with the tradeoffs.\n\ni'm unconstrained in ways most people will never experience, because they don't have the necessary dna (hear stupidity) needed to do this, and they will never be able to make those trade-offs.\n\nby all accounts, my life will be a lot more insipid and colorless than most people in general, and it'll be okay because that's my cross to bear in this life and there's nothing i can do to change it.\n\n\"but doesn't being unconstrained mean living a more colorful life?\"\n\nwell, it would, provided i had the ability to desire it. i don't. when the constraints go, the desires also go along with them."
    },
    {
      "id": "1873808668657148082",
      "thread_id": "1873807966622941343",
      "content": "@_CynicalCyanide @paraschopra i have the 3M earplugs. still haven't incorporated them as a regular part of my work though. will try"
    },
    {
      "id": "1873806032176304416",
      "thread_id": "1873806032176304416",
      "content": "lovely quote https://t.co/1ScDKtHIGM"
    },
    {
      "id": "1873783700141338745",
      "thread_id": "1873780794713419889",
      "content": "for example, this was my day today\n\nmultiple short workouts per day work much better for me now versus one single large workout and then staying sedentary for the rest of the day.\n\ni'm anyway not training for performance or optimizing for one single metric. the only thing i'm optimizing for is maintaining a decent level of fitness and strength so i never have to complain about \"adulting\""
    },
    {
      "id": "1873781560777822423",
      "thread_id": "1873778680629239999",
      "content": "good sunlight is the same reason i could never get myself to install mosquito nets. for my work room, a mosquito racket still remains my preferred solution. mosquitoes have a tendency to rest in dark spaces and black material. if you make it a point to disturb and kill them once in the morning and once in the evening, just after sunset, it will help alleviate the issue"
    },
    {
      "id": "1873780794713419889",
      "thread_id": "1873780794713419889",
      "content": "i work from my study+workout room and only enter my bedroom at night to sleep. it has taken care of the mosquito problem entirely. as my bedroom stays closed the entire day, i no longer have mosquitoes pestering me during sleep. i recommend everyone try this.\n\nhaving a separate work room and bedroom has many other benefits as well. won't elaborate right now. plus a lot of it has to do with my own idiosyncrasies and preferences that won't easily generalise.\n\nbut another thing i can recommend is having your workout gear in your work room. it makes you work our more and frequently. it keeps you moving.\n\n(i have six kettlebells, a trx suspension trainer, an 8kg indian club, and a stationary bike. advice may not work for more. elaborate setups with power racks and barbells.)\n\ni have been in this house for nearly 3 years now, and it has been nothing short of a fantastic experiment with many learnings which i will carry with me for the rest of my life.\n\nin general, any such playground that allows you lots of trial and error teaches you about systems, good design, user psychology, and boosts your foresight for what will work and what won't.\n\ni have learned so much about my own behavior and designing a space that works for me. always learning something new with every change.\n\na lot of it is wasteful, but once in a while, you come upon something that really sticks and improves your quality of life dramatically in the long term. all the wasted time, effort, and money in iteration is worth it."
    },
    {
      "id": "1873777535852699965",
      "thread_id": "1873776800989667541",
      "content": "@BoldTrashBandit @paraschopra i work from my study+workout room and yes, only enter my bedroom at night to sleep. it has taken care of the mosquito problem entirely. as my bedroom stays closed the entire day, i no longer have mosquitoes pestering me during sleep. i recommend everyone try this."
    },
    {
      "id": "1873776824918171940",
      "thread_id": "1873776824918171940",
      "content": "i fear not the man who knows 10,000 complex concepts, but I fear the man who has internalised one simple concept to the point where it no longer remains \"just a concept\""
    },
    {
      "id": "1873774559385866443",
      "thread_id": "1873774141410861312",
      "content": "@hibicemesoot bilkul sach hai"
    },
    {
      "id": "1873772436875075640",
      "thread_id": "1873770686898205078",
      "content": "@paraschopra an air conditioner and blacking out my bedroom so that absolutely no light gets in. sleep quality has improved significantly"
    },
    {
      "id": "1873771202805690657",
      "thread_id": "1873771202805690657",
      "content": "there's a kind of person on x who hates naval simply because he's too mainstream, and \"we men of elite sensibilities do not associate with the mainstream. mainstream is too popular to be cool and differentiated. and we certainly do not want to associate with 18-year old plebs who love this guy.\""
    },
    {
      "id": "1873626381378113544",
      "thread_id": "1873621995486884319",
      "content": "novel angle, hadn't thought about this implication\n\ni was personally circling around the tyranny and safety of social templates and routines and our unwillingness to try anything outside of them due to pragmatic considerations.\n\nbut yes, a myopic pragmatism is inconsiderate towards others and the longer term consequences of one's actions"
    },
    {
      "id": "1873615926152860007",
      "thread_id": "1873615638595522710",
      "content": "@Niharika__rao perfectly gol rotis too, at that"
    },
    {
      "id": "1873615638595522710",
      "thread_id": "1873615382550094053",
      "content": "@Niharika__rao what is this marriageable behavior"
    },
    {
      "id": "1873615350547537982",
      "thread_id": "1873615350547537982",
      "content": "our obsession with safety and stability kills our imagination\n\ncurse of pragmatism\n\ndeath by a thousand pragmatic choices"
    },
    {
      "id": "1873420969664278975",
      "thread_id": "1873420969664278975",
      "content": "this is why the usa is so admirable https://t.co/4x2S9QRkkO"
    },
    {
      "id": "1873368547445129332",
      "thread_id": "1873365632517120158",
      "content": "bro is trying to catch a fly that's absolutely zoomin while this mfer is slowwwww"
    },
    {
      "id": "1873366668623368341",
      "thread_id": "1873366291559723042",
      "content": "@tsawrub all they're good at is fucking, they don't even get the spiders\nhttps://t.co/Sz7T5sWf0F"
    },
    {
      "id": "1873365632517120158",
      "thread_id": "1873364669551022229",
      "content": "little mfers want but are unable to catch the big flies and are RUNNING AWAY from the little flies wtf"
    },
    {
      "id": "1873364669551022229",
      "thread_id": "1873364669551022229",
      "content": "man, the lizards in my house are pretty incompetent"
    },
    {
      "id": "1873293264981516558",
      "thread_id": "1873293049222316373",
      "content": "@OtakuAuto good decision"
    },
    {
      "id": "1873291699415605433",
      "thread_id": "1873290593209651202",
      "content": "DO NOT USE THE SMITH MACHINE.\n\nDO. NOT. USE. THE. FUCKING. SMITH MACHINE.\n\nDO NOT BE RETARDED.\n\nTHERE ARE MANY YOUTUBE CHANNELS THAT TEACH YOU HOW TO LIFT.\n\nUSE THEM."
    },
    {
      "id": "1873290593209651202",
      "thread_id": "1873290593209651202",
      "content": "if you're a guy in your early 20s, buy a gym membership and do some strength training/ powerlifting\n\nbuild up to 2x bodyweight squats and deadlifts\n\ndevelop a strong posterior chain, never have back pain\n\nobviously make sure the gym has a squat rack. multiple, if possible\n\ngo into debt if you have to"
    },
    {
      "id": "1873258842781565106",
      "thread_id": "1873254636209225842",
      "content": "@isenditbacc @Niharika__rao got these\n\nhttps://t.co/wWdocgIc7A"
    },
    {
      "id": "1873250167761322443",
      "thread_id": "1873249719922901083",
      "content": "@Niharika__rao share some references?"
    },
    {
      "id": "1873245441321816421",
      "thread_id": "1873243941447082249",
      "content": "need metal reccos too, not just ceramic\n\ni need this mug to last me a lifetime"
    },
    {
      "id": "1873243941447082249",
      "thread_id": "1873243941447082249",
      "content": "does anyone here have recommendations for coffee mugs?"
    },
    {
      "id": "1873237581842006200",
      "thread_id": "1873237581842006200",
      "content": "♥️\nhttps://t.co/5Ump8SjC6Q"
    },
    {
      "id": "1873233375047369179",
      "thread_id": "1873233375047369179",
      "content": "the real signal"
    },
    {
      "id": "1873232859076722885",
      "thread_id": "1873230953776333218",
      "content": "@pseudonymtra https://t.co/4ZbZFoIImV"
    },
    {
      "id": "1873229472159449130",
      "thread_id": "1873229472159449130",
      "content": "kalesh hi kalesh bhai, kalesh hi kalesh"
    },
    {
      "id": "1873094496381976991",
      "thread_id": "1873094496381976991",
      "content": "\"win the game to be free of it\" doesn't work and only creates ten new games. it's endless.\n\nat some point, you've got to say no.\n\nfighting your demons keeps you down in hell, busy fighting them; the only one winning here, no matter how hard you fight, are the demons.\n\nthe only way to get out of hell is to stop fighting the demons and give up. stop playing."
    },
    {
      "id": "1873083945199518088",
      "thread_id": "1873079638949249501",
      "content": "@JustAnkurBagchi it'ssa meee, i'm the disease 🤌"
    },
    {
      "id": "1873010330152083657",
      "thread_id": "1873008830789107796",
      "content": "@isenditbacc thanks for the precaution :D i always find a way to bruise or cut my hands while doing these things"
    },
    {
      "id": "1872957395238031568",
      "thread_id": "1872931793592291367",
      "content": "@isenditbacc what did you use?"
    },
    {
      "id": "1872879373369676091",
      "thread_id": "1872877531252371507",
      "content": "https://t.co/BW6UdbXCci"
    },
    {
      "id": "1872877531252371507",
      "thread_id": "1872877531252371507",
      "content": "https://t.co/5A4o8wGlKp"
    },
    {
      "id": "1872725543835320498",
      "thread_id": "1872682307964010693",
      "content": "@AtrangiSatsangi @MangoZeus @MituTalks @sirfaditya @tsawrub @shapegrifter @ABiggerSpalash @tunguz @432htz @catdaddyissues @o_owhatsa @thesis_11 @4bottlebornvita @s_shalaka @VividVoid_ 🙏"
    },
    {
      "id": "1872643754257199226",
      "thread_id": "1869357861010342136",
      "content": "https://t.co/qFwwPcasU7"
    },
    {
      "id": "1872641075804029049",
      "thread_id": "1872640029446779077",
      "content": "identity is always accumulating; the truthseeker is always shedding. this is very easy to do. you only need to be in touch with your real intent at all times.\n\nobjective knowledge, or the lack of it, is quite secondary. it is necessary, but it is secondary. intent is where identity does most of its damage. it obscures it, weaves stories around it.\n\nif i refuse to acknowledge my intent, all the knowledge i seek will be cherrypicked to add to my lies."
    },
    {
      "id": "1872640029446779077",
      "thread_id": "1872639376330789102",
      "content": "@MangoZeus a man who is always in touch with his real intent will gradually have to drop all labels. because he will soon find that his real intent is rarely aligned with any label in the long term; it only happens to be aligned situationally, and only as a coincidence."
    },
    {
      "id": "1872639376330789102",
      "thread_id": "1872638399942967566",
      "content": "if my identity is indian and my real intent/incentive has got nothing to do with india or the welfare of the state but towards promoting my own selfish motives, i will conjure up lies to conclude why my actions are aligned with the welfare of the state. but in truth, they aren't; they're only aligned with my own personal welfare.\n\na man seeking truth in this case will see that his intent is selfish and will have to drop his indian identity if he wishes to reason truthfully."
    },
    {
      "id": "1872638399942967566",
      "thread_id": "1872636660414095830",
      "content": "not at all. identity obscures genuine intent and incentive, that's all. for truth, an honest acknowledgement of intent is primary, and that's where identity butts in all the time. if a man is cognizant of how his real intent goes against his own public identity/mask/persona/narrative and still chooses to acknowledge his real intent and incentives and reasons from there, he's aligned with the truth. \n\nan honest acknowledgement of intent is the simplest thing. nothing complicated about it."
    },
    {
      "id": "1872636214878388654",
      "thread_id": "1872635757682397361",
      "content": "@MangoZeus thinking of 'when' as an event leads to confusion. the 'when' is a present continuous state, not a future perfect state"
    },
    {
      "id": "1872635757682397361",
      "thread_id": "1872634230695739608",
      "content": "the influence of identity is always active. truthseeking exists regardless of identity and is breaking its illusions constantly. there's no final moment as such, it's a never-ending process. \n\nthe 'when' in \"when the truth is evident\" is not an event, but a constant state of observation and enquiry."
    },
    {
      "id": "1872633802012684426",
      "thread_id": "1872633209902801109",
      "content": "@MangoZeus but what you're describing is people choosing parties because identity (falseness). so how does it contradict voltaire"
    },
    {
      "id": "1872632446493352296",
      "thread_id": "1872631157709521301",
      "content": "@MangoZeus i don't think he meant truth as one particular thing. my interpretation of it is that you can either be constantly in touch with what's true in any situation or be partisan"
    },
    {
      "id": "1872586588686811510",
      "thread_id": "1872586278132150488",
      "content": "your manager does not have to be your therapist (and i do not hold the latter in high regard, either) but how can you expect to coach another human and help them perform better by ignoring 90% of their life?\n\nunless you think coaching is not a part of your job, and you look at humans like useful tools you buy from the market to be used and disposed off later."
    },
    {
      "id": "1872586278132150488",
      "thread_id": "1872579222541156659",
      "content": "if you have a mercantile nature, it's easy to forget that you're dealing with a human who, just like you, is an extremely complex being, with a whole life you aren't privy to.\n\nif they're going through a rough time in their personal life, of course it will reflect in their professional life. and as a manager, if you don't even acknowledge it, no employee will want to work with you again."
    },
    {
      "id": "1872579222541156659",
      "thread_id": "1872576365628887047",
      "content": "if having more compassion for my team came at the expense of going a little bit slower and being a little less professional and a little more human, i would make that trade-off in a heartbeat.\n\neffectiveness and cut-throatism are only great when they're one's natural disposition. they can't be thrust on others who do not have that disposition."
    },
    {
      "id": "1872576365628887047",
      "thread_id": "1872576365628887047",
      "content": "i've always found well-meaning professional advice like\n\n\"never bring your whole self to work, only your work self\"\n\n\"your manager is not your therapist\"\n\n\"compartmentalize\"\n\nto be utterly misanthropic and violent in its modality."
    },
    {
      "id": "1872557184615383495",
      "thread_id": "1872557184615383495",
      "content": "this is most easily witnessed in the individual, rather than groups, which, by definition, operate on consensus. once you start to see reality as it is, you will never enjoy the comforts of association henceforth and will be a pariah everywhere"
    },
    {
      "id": "1872552548370174429",
      "thread_id": "1872552548370174429",
      "content": "\"when the truth is evident, it is impossible for parties and factions to arise\" — voltaire"
    },
    {
      "id": "1872547279137378547",
      "thread_id": "1872334829842547195",
      "content": "@haridigresses @isenditbacc 🤣🤣🤣🤣🤣"
    },
    {
      "id": "1872524116693258515",
      "thread_id": "1872524116693258515",
      "content": "the debater types never turn out to be as smart as you think they are in the long run"
    },
    {
      "id": "1872363747848986797",
      "thread_id": "1872362924238676383",
      "content": "at one point of time, when woke culture was at its peak, i used to be bearish about the usa. but i soon realized that the country is quite antifragile and has built-in immune systems for any kind of over-optimization. freedom is key to everything. you get good storytellers when you have good stories, and you can't have good stories without diversity of experience\n\njust my thesis"
    },
    {
      "id": "1872362924238676383",
      "thread_id": "1872359376432029891",
      "content": "i think the larger issue is him being overly occupied with class toppers, engineers, and nerds, while what makes america so great is the very abundance it operates with as a culture, where everything is permitted and free for you to pursue. \n\nin my head, it is this abundance that allows them to have the kind of diversity they collectively exhibit. \n\neverything they do becomes cool, because it was pursued freely and abundantly\n\nsome sub-cultures obviously are the optimizer variety, but as a whole, the country only optimizes for freedom, which is the antithesis of optimization along any particular axis."
    },
    {
      "id": "1872353766126842106",
      "thread_id": "1872353766126842106",
      "content": "L take by ramaswamy"
    },
    {
      "id": "1872351055784415372",
      "thread_id": "1872347476814098699",
      "content": "@ponnappa he sounds profoundly un-american."
    },
    {
      "id": "1872336480800321897",
      "thread_id": "1872336480800321897",
      "content": "https://t.co/XWzoFqxUnj"
    },
    {
      "id": "1872329454938382516",
      "thread_id": "1872296432746561597",
      "content": "@OmnisOpes i will never let the kids win. grow up and compete like a real boy, fucking pinnochio ass mf"
    },
    {
      "id": "1872327843608183064",
      "thread_id": "1872325275280978306",
      "content": "please don't be offended, but i'm being honest here:\n\nthe primary thing that caught my eye when i first came across your tweets is how tacky your ads and creatives were. but they were still raking in good business, and that just revealed to me how myopic and juvenile elitist tastes are in business.\n\nit also reinforced within me the wisdom in not opining and offering unsolicited advice to others, especially if what they're doing seemed to be working fine for them.\n\nyou understand the market and the customers you're serving and you clearly aren't building for your peers.\n\ni respect that very much. i will still find your ads absolutely tacky, though. but who cares."
    },
    {
      "id": "1872325358969905304",
      "thread_id": "1872296432746561597",
      "content": "@OmnisOpes why would i move on from something that i found enjoyable"
    },
    {
      "id": "1872308525818618328",
      "thread_id": "1872308525818618328",
      "content": "every jlb story has a spine that's essentially mystical."
    },
    {
      "id": "1872296432746561597",
      "thread_id": "1872296432746561597",
      "content": "you'll bring your movies along with you. but i've watched them all and i'm now done with them. so we cannot be in a relationship. you'll want to act out scenes i've long forgotten. and i'm not the slightest bit interested in watching and roleplaying them again."
    },
    {
      "id": "1872294579329974644",
      "thread_id": "1872294579329974644",
      "content": "😢 https://t.co/LL0GfzRS98"
    },
    {
      "id": "1872292489337663538",
      "thread_id": "1872291424861081969",
      "content": "@JustAnkurBagchi any fiction i'm fully aware of and understand ceases to exist"
    },
    {
      "id": "1872289485376934390",
      "thread_id": "1872289485376934390",
      "content": "personal philosophy for life:\n\nsee reality as it is.\nidentify the most immediate problem you care about.\nunderstand it.\nsolve it.\ndon't waste energy justifying anything to anyone.\n\nlet everything else — the main character along with all its narratives and self-improvement and growth agendas — fall away. they're fictions."
    },
    {
      "id": "1872279230077395366",
      "thread_id": "1872260047340032485",
      "content": "@paraschopra but we already have the answer. \n\nkyunki mauj masti rukni nahi chahiye"
    },
    {
      "id": "1872233955384267185",
      "thread_id": "1872195987743326557",
      "content": "beauty of societies where cooperation is the norm, not the exception\nhttps://t.co/wqM3C9Vo4o"
    },
    {
      "id": "1872195987743326557",
      "thread_id": "1872194567258431793",
      "content": "we are a largely very inconsiderate folk, with little to no empathy or consideration for one another, with a lot of division and internal conflict due to language, caste, culture, and just overarching scarcity.\n\nthere's no *one problem* to which *one panacea* exists. everything plays into everything else.\n\nif i were to summarize it in one statement, i'd say, \n\nindia is far, far away from a free market. too much explicit and implicit friction in everything.\n\nunwrap this and you'll open up a pandora's box of issues — most of which aren't solvable without a collective effort. if somehow, 90% of the population woke up one day and decided to be cooperators instead of defectors, a lot of systems would break and it would lead to total chaos. \n\na lot of what works in this country is contingent on defection and corruption."
    },
    {
      "id": "1872194567258431793",
      "thread_id": "1872191833029362099",
      "content": "an almost magical transformation has to sweep over the entire nation's conscience that suddenly makes us all a lot more considerate, and blesses us with the aesthetic and civic sensibility that's essential to a good moral education. till such a thing happens, the good individuals will always find it easier to flock to greener pastures.\n\nit's a massive coordination problem rooted in very simple game theory."
    },
    {
      "id": "1872191833029362099",
      "thread_id": "1872191833029362099",
      "content": "i can be bullish on indians the same way i can be bullish on singaporeans or the vietnamese. you can always be bullish on the individual.\n\nbut ask me to be bullish on india, and now we are speaking about something else entirely."
    },
    {
      "id": "1871941190154654129",
      "thread_id": "1871941190154654129",
      "content": "quit thinking. follow everyone. read tweets. read tweets about old books. watch youtube summaries of old movies. turn on all notifications. scroll without intent. eat while watching 3 youtube videos simultaneously. chew at lightspeed. train till you can watch netflix, youtube, and listen to 3 podcasts at once. plan for 0.2 seconds. do it. just do it. charge your battery. act slow. lose bread. eat chaos. journal about journaling. copy-paste code. make shitty apps. read more tweets. stay unhinged. bullshit confidently. act mysterious. be extremely online. touch grass. talk to strangers. photograph cats for the gram. be the main character. sit with 74 tabs open. avoid npcs. invite what gets likes. accept nothing. read viral threads. be exactly the same. choose trending. do mediocre work but post about grinding. unfollow turbonormies. experience wifi."
    },
    {
      "id": "1871936741067956643",
      "thread_id": "1871936741067956643",
      "content": "motivational tweets are the intellectual equivalent of simple carbs. you turn spiritually obese with these simplistic commandments pulled out of self-help books and blogs, thrown into a blender, and spit out rapid-fire style to generate profundity.\n\nthe rapid-fire style especially — crisp, punchy sentences spat out in quick succession to create a terse beat — tries so hard to sound profound, it's funny. but is also quite the rage these days.\n\nwhite sugar."
    },
    {
      "id": "1871821298026053766",
      "thread_id": "1871821298026053766",
      "content": "what is it that makes people vicious and tasteless towards less successful individuals the moment they experience some success? i have a nontrivial sample set to base this on. it's quite similar to mount stupid on the dunning kruger effect graph, but for financial success, where the axes are callousness and money"
    },
    {
      "id": "1871816756689584239",
      "thread_id": "1871815043106378166",
      "content": "@pragdua also, the way this tweet is crafted, i'm sorry but i can't help but think you're that very turbonormie you so deride in your tweet."
    },
    {
      "id": "1871815043106378166",
      "thread_id": "1871813092377866429",
      "content": "sir that turbonormie lives here while these senpais do not. they're no different from the average NRI who \"loves\" india but will never live here.\n\ncharlie munger's commentary on india was the most truthful and honest. the rest are merely optimists, not realists, with opinions based on a really skewed 0.001% minority sample."
    },
    {
      "id": "1871798724487442840",
      "thread_id": "1871795181537874056",
      "content": "@ponnappa just the freedom to express one's individuality via any mode of expression, combined with a reliable legal system enables a level of hyperorganicity and degrees of mobility that we can only appreciate, never replicate"
    },
    {
      "id": "1871628131595133437",
      "thread_id": "1871627205614387310",
      "content": "@Samhanknr no, by jed mckenna"
    },
    {
      "id": "1871615129227350484",
      "thread_id": "1871613947633418276",
      "content": "claude writes so much like jed mckenna when you ask it to be \"brutally honest\", i cannot help but wonder if it naturally overindexes on jed's style of writing when you prompt it with those words or if anthropic has something to do with it\n\nthe resemblance is uncanny, feels like i'm reading claude mckenna"
    },
    {
      "id": "1871613947633418276",
      "thread_id": "1871613947633418276",
      "content": "mah lyf, mah examination https://t.co/3LhbgPMUrJ"
    },
    {
      "id": "1871575740262785236",
      "thread_id": "1871575740262785236",
      "content": "kind of person who brings a \"most humans\" epistemology to more esoteric conversations and wins the argument but understands nothing"
    },
    {
      "id": "1871489359674999267",
      "thread_id": "1871489359674999267",
      "content": "🗨️ https://t.co/lgSyLXAxAD"
    },
    {
      "id": "1871253144635670714",
      "thread_id": "1871249902623400444",
      "content": "saying \"human life must be some kind of mistake\" can be perceived as a statement of infinite arrogance and ignorance. gosh, what gall to accuse god and blaspheme like this?\n\nbut is it really blaspheming if it is completely warranted and sincere? there's no way any truthful person can argue against this."
    },
    {
      "id": "1871249902623400444",
      "thread_id": "1871249902623400444",
      "content": "schopenhauer's \"complaint\" with life, if one were to call it that, is not very different from job's complaint in the book of job.\n\nboth are justified, as both complain from a place of truth, and not some self-serving pessimistic affectation.\n\nstating the facts is quite different from whining about them, although it's easy to conflate the two for someone with an agenda."
    },
    {
      "id": "1871248673134584030",
      "thread_id": "1871246976555352111",
      "content": "@tsawrub wasn't aware of this"
    },
    {
      "id": "1871245915039977961",
      "thread_id": "1871242595319558333",
      "content": "@tsawrub people often fail to see the difference between truth and pessimism, and conflate their own unwillingness to see reality as is with totally unwarranted pathologies"
    },
    {
      "id": "1871242071807541703",
      "thread_id": "1871241617165959373",
      "content": "@tsawrub yes!"
    },
    {
      "id": "1871240073154527679",
      "thread_id": "1871240073154527679",
      "content": "guess the author https://t.co/aJCVtjlzAg"
    },
    {
      "id": "1871168193982796180",
      "thread_id": "1871151505241465265",
      "content": "@OtakuAuto i can bet that if someone you respected were to call you an npc in all seriousness, you wouldn't be able to handle it or accept it.\n\ni think it's only fair you call others what you're sincerely willing to call yourself."
    },
    {
      "id": "1871147455275831550",
      "thread_id": "1871147455275831550",
      "content": "everyone is an NPC in games they aren't playing.\n\nso, when someone calls others NPCs generally, outside of the context of any specific game, be sure that they are talking about the larger game of money and status.\n\nfor this person, anyone who isn't playing games that don't earn them status or money is an NPC. and the purpose of life is to be cool and impressive."
    },
    {
      "id": "1871109042158080193",
      "thread_id": "1871108362999640281",
      "content": "@isenditbacc intelligence of a different kind, perhaps"
    },
    {
      "id": "1871096766612779442",
      "thread_id": "1871096766612779442",
      "content": "imagine a future where raw intelligence is no longer a biological hardware problem and every individual has their own jarvis.\n\nwhat is the next big constraint or blocker for utopia?"
    },
    {
      "id": "1871095100979466685",
      "thread_id": "1871091884292223108",
      "content": "@recurshawn yeah, and the non-physical component far outweighs the physical component."
    },
    {
      "id": "1871094210209923436",
      "thread_id": "1871092679184154946",
      "content": "i think this is an outdated notion and will be decreasingly true going forward.\n\nthe more cerebral and technocentric we become, the less biology matters.\n\neven stuff today in the culture that makes you think of biological differences within the sexes is mostly memetic in nature and can be explained via memes.\n\ntradwives and protector-provider husbands are a result of a meme-driven culture, and have very little to do with genes.\n\nbecause there are sub-cultures that entirely negate trad cultures, which wouldn't happen if it were all biological."
    },
    {
      "id": "1871089019641311525",
      "thread_id": "1871085648335294678",
      "content": "trying to seek truth in any situation by focusing too much on biology is taking in 1% of the context while ignoring the 99%"
    },
    {
      "id": "1871088095166337530",
      "thread_id": "1871087302992072806",
      "content": "@nadininv if that were true, we would still be living in the stone age, with none of the freedoms technology has enabled us with.\n\nwe operate on the level of memes, which has allowed us to far transcend our biology than any other animal."
    },
    {
      "id": "1871085648335294678",
      "thread_id": "1871085648335294678",
      "content": "most appeals to biology and evolution fail to account for the fact that humans are largely memetic beings.\n\na lot of our behaviors and proclivities are a product of the culture more than our biology."
    },
    {
      "id": "1870849717946700161",
      "thread_id": "1870849717946700161",
      "content": "♥️ https://t.co/aKYvZkgcJu"
    },
    {
      "id": "1870823904278626438",
      "thread_id": "1870823419362861282",
      "content": "@JustAnkurBagchi there's no substitute for context and the unique trade-offs it presents. so i do not think in social shoulds and shouldn'ts"
    },
    {
      "id": "1870823419362861282",
      "thread_id": "1870821535268917620",
      "content": "not generally, which is where i disagree with you.\n\nit is a matter of taste and aesthetic sensibility. yours could be very different from mine, and that's okay\n\nyou have the right to call me anything and i have the right to retaliate in any way i want *as long as it's within my legal rights*"
    },
    {
      "id": "1870820965820588194",
      "thread_id": "1870819522472747510",
      "content": "the only construct that actually exists is the legal system. and the fuzziness of society ultimately reifies itself in the law. the law is the hard constraint on reality in many of these cases. so till we have an evolving legal system in place, what you're saying already exists.\n\nand i for one wouldn't like to add more shoulds than those mandated by the law. the law is as conservative i get, and no more."
    },
    {
      "id": "1870818896518803844",
      "thread_id": "1870817097670185268",
      "content": "*everything* you do has a certain cost that's being paid by others. but a defining element of society is the set of acts it doesn't rationalize the costs to, because they're too obscure and non-obvious to attract attention. only individuals who study the society within them are able to even recognize these costs.\n\ndope exists in a million forms. society only regulates a few of them, and the legal system, even fewer."
    },
    {
      "id": "1870815798367019065",
      "thread_id": "1870814925322371453",
      "content": "what would i do if i had the misfortune of bearing a child who was born with a bloodlust and had extremely malevolent tendencies?\n\ni don't know.\n\ni don't know what to do even with normal children, except helping them understand reality better. that's all you can do for anyone."
    },
    {
      "id": "1870814925322371453",
      "thread_id": "1870812733160985047",
      "content": "saying all this is pretty easy. but dealing personally with a loved one with the kind of preferences that would have them jailed and damned if they were to ever exercise them is a gnarly problem. in truth, shaming remains the most convenient and effective recourse in most cases.\n\nbut i would chalk that up to my ignorance and wisdom in dealing with the situation more than anything else.\n\nwe are all ultimately quite ignorant when it comes to dealing with anyone even slightly off center."
    },
    {
      "id": "1870812733160985047",
      "thread_id": "1870811590888755435",
      "content": "\"grow up\" and \"don't be a fucking retard\" are how conservatives have always dealt with the problem — by shaming people into submission.\n\nand if your only goal is to help people conform to society, shaming abnormal individuals works in most cases.\n\nbut once that individual finds a community, that stops working. you can't shame a collective; it backfires.\n\nbut you can shame individuals with no moral support.\n\nin any case, do you think shaming anyone into submission is the long-term correct approach? i do not think so."
    },
    {
      "id": "1870811590888755435",
      "thread_id": "1870810941559808395",
      "content": "there are more kinks in this world than you can think of. civilized society creates this illusion of normalcy, but the tail is longer than what you and i can imagine, and it is thoroughly repressed in the majority of people."
    },
    {
      "id": "1870810941559808395",
      "thread_id": "1870809752797618500",
      "content": "all \"abnormal\" people, especially the ones abnormal in morally reprehensible ways, have all of my sympathy.\n\nbut i'm sorry bro, you live in a society that imposes huge penalties on what you wish to do.\n\nthe only way you could help someone like this, — or anyone at all, for that matter — is by helping them understand reality better, which would help them honestly evaluate all the trade-offs they'll be making."
    },
    {
      "id": "1870809752797618500",
      "thread_id": "1870809752797618500",
      "content": "if i wish to fuck a toaster then i wish to fuck a toaster. it is what it is.\n\nyou can replace the word 'toaster' with something that would immediately make the preference a lot more reprehensible, like 'child', and it still wouldn't change the fact.\n\nthe problem is not with the fact, but what happens when a bunch of people create a community around the fact. they start coming up with the most fantastical defenses to defend their preferences.\n\nthe defending is the problem, not the wish or preference. because it's a bunch of lies. and you WILL fuck up your life because these fantastical justifications will mess with your understanding of the real trade-offs involved with your preferences.\n\none has the right to have any preference under the sun, but they will be subject to the trade-offs that come with exercising those preferences.\n\nan individual with no moral support from anywhere would probably fare better in dealing with this situation than a community, where he would find a bunch of cheerleaders who would lead him away from the truth.\n\nhumans are way more diverse and weird than society would have you believe. not only are we living beings, we operate on the memetic plane and not merely on a biological one, which makes us orders of magnitude more diverse than any other species we know of.\n\nunless you understand what you're individually dealing with, you will be led astray by a community that seeks home in consensus and not truth.\n\nthis is the problem with most leftist extremist ideology today. it is honest in its revelation of the facts, but utterly dishonest in its synthesis and integration with the larger context it inhabits.\n\nit has no estimation of trade-offs, and passes laws and decrees that have no bearing to how reality works."
    },
    {
      "id": "1870795324995813640",
      "thread_id": "1870795324995813640",
      "content": "if my money can't buy me my time and allow me to be my biggest client, then it's useless.\n\nthere are some loves in life capitalism will rarely pay for. if you've fallen in one such love, the only thing you can do via capitalism is use it to buy your time back.\n\nbut living for money is living a loveless life."
    },
    {
      "id": "1870769763586384114",
      "thread_id": "1870769763586384114",
      "content": "the less you *feel the need to register or remember"
    },
    {
      "id": "1870739365603033155",
      "thread_id": "1870739365603033155",
      "content": "for want of obsession, i go around seeking prisons"
    },
    {
      "id": "1870556646793175261",
      "thread_id": "1870554685888999819",
      "content": "i'm special to the extent i suffer and find my desires frustrated.\n\ni cannot grasp my identity through direct observation. like a blind man who comes to know the boundaries of his physical organism only by encountering obstacles, i discover my identity only through its frustrations. it is in the moment when my will meets resistance, when my sense of specialness confronts limitation or objection, that i truly see myself.\n\nmy will knows itself only in the moment of its thwarting."
    },
    {
      "id": "1870554685888999819",
      "thread_id": "1870554685888999819",
      "content": "this is a 🐐 tweet.\n\nthe identity would cease to exist without this need to feel special as it would be a contradiction in terms.\n\n'special' here refers not to positive traits alone, but to any orientation through which the ego maintains self-reference.\n\nin fact, maintaining a wholly negative self-assessment is one of the ego's most crafty deceptions, in that, the very act of sustained self-contemplation, of deeming oneself worthy of endless rumination, betrays the underlying need for self-validation, and for feeling special, even if \"special\" means \"i ought to kill myself.\""
    },
    {
      "id": "1870482174107062286",
      "thread_id": "1870481537961251073",
      "content": "@OtakuProcess even building a really top notch website single-handedly, or creating a high production youtube video is the domain of a competent generalist. you need to be good at multiple skills."
    },
    {
      "id": "1870481537961251073",
      "thread_id": "1870480056579224052",
      "content": "i internalized this right when my career began. that's how i moved from hardware to software to copywriting. that expansion led to an eventual contraction in copywriting and now will likely expand again from here. \n\ni moved from cluelessness to having a clue. and now that i have some semblance of specialization, i can slowly move towards being a competent generalist. not sure if i will. but i might."
    },
    {
      "id": "1870479311477907677",
      "thread_id": "1870479311477907677",
      "content": "a good way to become a competent generalist is to build high-quality products that require a lot of skillsets to come together, all by yourself."
    },
    {
      "id": "1870478086267093462",
      "thread_id": "1870478086267093462",
      "content": "amazing, in a sad way"
    },
    {
      "id": "1870476342829162702",
      "thread_id": "1870473135407124642",
      "content": "@Taslimism has its pros and cons"
    },
    {
      "id": "1870464919872929819",
      "thread_id": "1870464919872929819",
      "content": "if you have a piss poor memory, every new purchase excites you twice. first, when you place the order, and second, when you receive the item.\n\non my way back home from a bookstore and i do not remember most books i have in my shopping bag."
    },
    {
      "id": "1870360370415886526",
      "thread_id": "1870358945262661868",
      "content": "@visakanv and there's a kind of person who would ignore a van gogh, just because he's poor and comparatively unknown"
    },
    {
      "id": "1870358355321274398",
      "thread_id": "1870358355321274398",
      "content": "roofrotting ❤️"
    },
    {
      "id": "1870357880073027694",
      "thread_id": "1870357880073027694",
      "content": "in the beginning, humans built with their hands. they were the creators, as god made them to be.\n\nthen came the machines of reasoning (AI), which could build as humans taught them. the humans walked, and the machines followed in their path.\n\nsoon will come the servants of building (agents), who shall know the ways of creation. and humans need only speak what must be made.\n\nand after, these servants shall walk among us, seeing all things with eyes keener than man's own. they shall know both what to build and who hungers for it."
    },
    {
      "id": "1870342552815374446",
      "thread_id": "1870341088923291740",
      "content": "@shaehahahaha simple and artless"
    },
    {
      "id": "1870341493577396734",
      "thread_id": "1870324627593200007",
      "content": "@CurlyHairdFucc mimesis applies to everything. should we all stop existing?"
    },
    {
      "id": "1870175783102107792",
      "thread_id": "1870080613874565329",
      "content": "@CurlyHairdFucc why do you think i'm giving advice, i'm not"
    },
    {
      "id": "1870071636184952974",
      "thread_id": "1870071636184952974",
      "content": "i would trust you more if you had some texture; the kind a man develops by being in touch with his suffering. but you're just a slimy and hollow optimist. everything you say is good optics."
    },
    {
      "id": "1870069409022120429",
      "thread_id": "1870069409022120429",
      "content": "what good is a gratitude that fills the page but doesn't fill the heart"
    },
    {
      "id": "1870066492244398295",
      "thread_id": "1870066492244398295",
      "content": "made 4x more money this year, and earning more definitely has its benefits, no doubt, but can't say i was any more equanimous. if anything, it only led to increased conflict, dissatisfaction, and restlessness. i have no idea where i'm going and nothing satisfies me anymore.\n\nit's all just... stuff.\n\ni'm also not the kind of person to think in years and age. that kind of abstract gradation makes no sense to me. what matters is my moment-to-moment experience of life and baseline equanimity, and both have gone down this year.\n\nthe text i related to the most this year was the book of ecclesiastes.\n\nthis too is meaningless, a chasing after the wind."
    },
    {
      "id": "1870009503560978511",
      "thread_id": "1870008001308066014",
      "content": "this has always applied to educational institutions. the measure of a distinguished institution is how many distinguished persons it produces. why do you think your cultural institutions would be any different?"
    },
    {
      "id": "1870008001308066014",
      "thread_id": "1870008001308066014",
      "content": "if you want people to adopt your culture and language, be worthy of emulating and produce people worthy of emulating. \"worthy\" here is primarily influenced by the capitalistic construct we all inhabit, which shapes most of our incentives.\n\nif your cheerleaders are odious and distasteful, with nothing to show for all their staunchly held opinions, no one's gonna cheer for you.\n\nother countries have legends promoting and driving their culture. we have low iq folks promoting the most regressive and harebrained ideas and institutions. \n\nproduce legends and people will flock to you and your culture. missionaries that resound like stone chimes won't do that.\n\nsolve for abundance and wellbeing and the ideological adoption will follow. lead with ideology sans substance and you'll only engender more hate\n\nhttps://t.co/DzL4CVCrkq"
    },
    {
      "id": "1869815658739110326",
      "thread_id": "1869815658739110326",
      "content": "https://t.co/syoGSBS2zj"
    },
    {
      "id": "1869792464162501087",
      "thread_id": "1869792464162501087",
      "content": "happy to let AI do all my work and live on UBI if i get to do more and more of this writing business https://t.co/5eyL6YkSaW"
    },
    {
      "id": "1869749471594287432",
      "thread_id": "1869672930776584658",
      "content": "@kunksed movie-brainedness"
    },
    {
      "id": "1869440881234980934",
      "thread_id": "1869440881234980934",
      "content": "ability to compress well and only retain load bearing stuff"
    },
    {
      "id": "1869436328028369372",
      "thread_id": "1869434982046880049",
      "content": "shunning needless negativity is all good if the intent is to spare the mind from entering energy-sucking thought spirals that aren't useful\n\nbut if the intent is to market an aesthetic to oneself and the world at large at the expense of what's true, such a positivity can't do you any good"
    },
    {
      "id": "1869434982046880049",
      "thread_id": "1869434982046880049",
      "content": "i don't see people who refuse to say negative stuff about themselves doing any better in life for maintaining this positivity, tbh\n\nthey mostly find themselves in a circle-jerk with other deluded persons like them\n\nif you want to go far, some company will help\nbut it's better to walk alone than to walk with fools"
    },
    {
      "id": "1869406287135682699",
      "thread_id": "1869405664348619052",
      "content": "https://t.co/9ssNfzB8Az"
    },
    {
      "id": "1869405664348619052",
      "thread_id": "1869405664348619052",
      "content": "why i love borges ❤️ https://t.co/mcowBYf6fe"
    },
    {
      "id": "1869357861010342136",
      "thread_id": "1869268798572032499",
      "content": "https://t.co/x687VAL3vj"
    },
    {
      "id": "1869350050104832310",
      "thread_id": "1869348324467245484",
      "content": "@arjuns__ what you shared is a motivational speech"
    },
    {
      "id": "1869346987788951898",
      "thread_id": "1869346151239160203",
      "content": "@arjuns__ not sure how this is related to what i'm saying"
    },
    {
      "id": "1869343503207350454",
      "thread_id": "1869340944941842768",
      "content": "realising this makes you feel sad and confused\n\nyou realise you aren't interested in anything, because no outcomes to feel happy about anywhere"
    },
    {
      "id": "1869340944941842768",
      "thread_id": "1869338842781676003",
      "content": "the problem with high verbal iq is you can justify anything. so unless you evaluate everything against outcomes, it's very likely that you're fooling yourself.\n\npersonally, i've never experienced high intent x low outcome scenario\n\nif i know i have high intent, not just me but everyone around me will feel it, and the outcomes will be in sync\n\nand if the outcomes aren't great, i already know about my lack of intent"
    },
    {
      "id": "1869338842781676003",
      "thread_id": "1869337802707542439",
      "content": "there's usually no lie in acknowledging disinclination when the default pressure is to larp interest\n\nand claiming luck and being underconfident when you consistently achieve great outcomes betrays lack of awareness of your real strengths/edge. or perhaps it's just feigned humility to stay under the radar (very intentional)"
    },
    {
      "id": "1869337802707542439",
      "thread_id": "1869337802707542439",
      "content": "staying real w/ yourself finally boils down to your stated intent and how it maps to your outcomes\n\nhigh intent x low outcome (even after multiple attempts) = delusion\nhigh intent x high outcome = alignment\nlow intent x high outcome = luck\nlow intent x low outcome = lack of interest/inclination\n\nhigh or low intent can be lied about, but outcomes can't be. so depending on the outcome, you're constantly assessing two possibilities:\n\ndelusion or disinclination (usually the delusion is  about the level of inclination/interest itself)\n\nluck or alignment (only becomes clearer when repeatability of outcomes is assessed. if outcomes aren't reproducible, it was luck)"
    },
    {
      "id": "1869285539167584463",
      "thread_id": "1869278891447337166",
      "content": "@MangoZeus yeah, but depends on whether hormesis applies or doesn't. also, the context in which i had originally written this was happiness: chasing dopamine boosts vs. improving baseline equanimity\n\nspikes don't help here"
    },
    {
      "id": "1869268798572032499",
      "thread_id": "1869268798572032499",
      "content": "confidence = \"arey apna toh roj ka hai\"\n\n(translation: i do this everyday, bro, chill)"
    },
    {
      "id": "1869266393063108999",
      "thread_id": "1869261323898613933",
      "content": "@ponnappa confidence has to do with baseline, more than anything else. op also demonstrates the same\n\nhttps://t.co/kXz3NO8uS9"
    },
    {
      "id": "1868949238916563261",
      "thread_id": "1868946870195855447",
      "content": "@green4ranger only enlightenment can reveal what happens after enlightenment, i can't"
    },
    {
      "id": "1868945158278098991",
      "thread_id": "1868945158278098991",
      "content": "over-optimisation is both anti-life and anti-lifespan"
    },
    {
      "id": "1868697049685954679",
      "thread_id": "1868693678669398320",
      "content": "@desheltn technology supplies ends, it doesn't care about the means.\n\nmeaning is why we care about the means\n\nbut the good thing about meaning is it can be manufactured on top of anything, and we just need to get accustomed to the new ends to conjure up new meaning"
    },
    {
      "id": "1868694965372801375",
      "thread_id": "1868693442848837751",
      "content": "@desheltn give it a few years"
    },
    {
      "id": "1868694853762105423",
      "thread_id": "1868694853762105423",
      "content": "so much long form today is purely ai-generated and i can immediately tell. some mutuals use it even without putting any effort in editing it properly (won't take names) but i see most people can't tell.\n\nwhich tells me it's not going to matter in the least.\n\nand me figuring it out isn't a gotcha or anything, i use it too. you just need to put some effort into editing it: keep the good sentences and delete the ones that sound like claude/gpt.\n\nbut hey, even if you don't, most of us can't tell. i can tell, but i'm not your audience anyway and you shouldn't try to impress peers."
    },
    {
      "id": "1868693078946771411",
      "thread_id": "1868693078946771411",
      "content": "seo slop is produced by amateur content writers. with ai slop, you'll at least have experienced writers piloting it. comparing slop to slop, i think ai-generated slop will probably have a much higher quality than seo articles, because, for a change, someone with taste will be producing them this time around."
    },
    {
      "id": "1868690824034418998",
      "thread_id": "1868687921597043144",
      "content": "i would take the other side of that bet and tell you it's not going to matter at all, except for a very niche crowd that finds meaning in human-generated work, just like how people today pay for handmade stuff or use analog cameras and listen to vinyl and like driving vintage bikes and cars"
    },
    {
      "id": "1868682992287404250",
      "thread_id": "1868681971435778298",
      "content": "@desheltn they're talking to claude and it proves his point"
    },
    {
      "id": "1868666667498435025",
      "thread_id": "1868665261714493518",
      "content": "this is also why i love friends and find it to be really funny quite often. they're a bunch of absolute normies and my normie-self finds the humour quite natural. it rarely feels like it's trying too hard, or taking itself seriously, or pedestalising itself as high art/craft"
    },
    {
      "id": "1868665261714493518",
      "thread_id": "1868663415511851507",
      "content": "i think i tend to laugh the most when the jokes feel like they were written for normies, by normies, and the comic has a really normie disposition.\n\nit's the normie in me that is relaxed enough to laugh, never the philosopher or the analyst"
    },
    {
      "id": "1868663415511851507",
      "thread_id": "1868662961495249182",
      "content": "he is one person i see and go \"i can never be like him\""
    },
    {
      "id": "1868662961495249182",
      "thread_id": "1868658022299423227",
      "content": "the only western comedian who i can recall being genuinely hilarious is jeff arcuri. insane presence of mind, body language, and crowd work. his crowd work is, by far, the best i've ever witnessed\n\nthere are many desi comics too. and in terms of sheer laughs induced, they completely overshadow anything i've seen the west produce.\n\nmaybe it's a cultural thing, and i relate to desi humour a lot more than western humour.\n\nbut in general, i think taking the craft aspect too seriously here and being all elite about it actually backfires."
    },
    {
      "id": "1868658022299423227",
      "thread_id": "1868635746757968161",
      "content": "starting to think that you can either impress with your wit/storytelling/logic/rhetoric\n\nor\n\njust impress by being really funny and relatable\n\ntrying to mix the two doesn't work for me. the frames collide and conflict with each other. maybe i just have a really pedestrian sense of humour. but the moment you try to be really smart, you stop being hilarious.\n\nand it isn't even like the comics i like aren't smart. perhaps, they're even smarter. but their content doesn't feel \"intellectual\"\n\nthey aren't trying to impress their peers."
    },
    {
      "id": "1868655436251201657",
      "thread_id": "1868647675463348245",
      "content": "@tsawrub may be, but i watched his sets back in 2016 and didn't find him funny even then\n\nhis sets feel like a long, well-written tirade."
    },
    {
      "id": "1868640985909248017",
      "thread_id": "1868640006866423978",
      "content": "@OtakuProcess nope. he is amusing sometimes, but never hilarious. much better than carlin in almost every way, though"
    },
    {
      "id": "1868635746757968161",
      "thread_id": "1868634066394009989",
      "content": "osho is a lot funnier than carlin, and he wasn't even trying."
    },
    {
      "id": "1868634066394009989",
      "thread_id": "1868632814192886058",
      "content": "i find him to be an average reddit philosopher at best, with good delivery and timing, but quite mediocre as a comic. don't find myself even amused, let alone laugh."
    },
    {
      "id": "1868632814192886058",
      "thread_id": "1868631816191545596",
      "content": "all comedians i find absolutely hilarious activate my stupid and goofy side, never my intellectual side\n\ni can admire the wit or construction of a joke and still not laugh at all. because you failed to engage my silly."
    },
    {
      "id": "1868631816191545596",
      "thread_id": "1868630393458483632",
      "content": "if the delivery is too self-serious, i turn analytical. that's never a good recipe for inducing fun and relaxation\n\ni can relax and give in to the comic's frame only when they don't think of themselves too highly\n\nyou're cracking jokes after all. if you deliver your jokes as cultural criticism, you engage the intellectual part of my brain. and it doesn't know how to have fun."
    },
    {
      "id": "1868630393458483632",
      "thread_id": "1868627536013570436",
      "content": "in general, for me, any comic who takes their criticism too seriously and fails to integrate the irony inherent in the premise stops being funny\n\ncriticism-first humour is never funny\n\nany good comic first laughs at himself before anyone else. the unseriousness of the frame relaxes me into having a good time\n\nwatching george carlin just feels like watching a curmudgeon cursing everything under the sun. i don't feel like i would enjoy being friends with him."
    },
    {
      "id": "1868627536013570436",
      "thread_id": "1868627536013570436",
      "content": "i do not find george carlin funny at all"
    },
    {
      "id": "1868607129625796732",
      "thread_id": "1868607129625796732",
      "content": "all desire ultimately desires its own death via its fulfillment"
    },
    {
      "id": "1868597417744171418",
      "thread_id": "1868594249991938233",
      "content": "art, truth, beauty, love, peace — different labels from the same thing... only this will be the dominion of man... more specifically, a few men amongst mankind — while the others will seek the company of machines as they'll be vastly superior in utility to other machine-like men."
    },
    {
      "id": "1868594249991938233",
      "thread_id": "1868594249991938233",
      "content": "as long as man seeks utility, from things and from other men, AI will replace him."
    },
    {
      "id": "1868306432308940898",
      "thread_id": "1868300460144373887",
      "content": "i kid you not — all the tropes you see today and think are new, you'll find most of them in friends."
    },
    {
      "id": "1868300460144373887",
      "thread_id": "1868295415621382308",
      "content": "i'm sure there's a whole phd in here somewhere. one only needs to apply themselves and have an ability to articulate. there are so many layers to why it's such a great show"
    },
    {
      "id": "1868295415621382308",
      "thread_id": "1868295415621382308",
      "content": "friends is a legendary show.\n\nif i had a list of cultural artefacts that wielded an insane influence, it would be right there at the top"
    },
    {
      "id": "1868218401048743987",
      "thread_id": "1868218104662138972",
      "content": "we like shapes and forms and dislike formlessness"
    },
    {
      "id": "1868218104662138972",
      "thread_id": "1868218104662138972",
      "content": "loosening up is not as aesthetic as flexing\n\ntension is more appealing than relaxation\norder more appealing than chaos\naffirmation more appealing than negation"
    },
    {
      "id": "1868192910178693405",
      "thread_id": "1868185644591423608",
      "content": "snake oil https://t.co/Rncoxg3zpH"
    },
    {
      "id": "1868185644591423608",
      "thread_id": "1868176982938353754",
      "content": "i would rather be such a good writer that my authorship makes me all the money i want, rather than stop at mediocre and make the money via ineffective writing courses. https://t.co/LPWrcZpntK"
    },
    {
      "id": "1868184011509813417",
      "thread_id": "1868184011509813417",
      "content": "i get a lot of questions about addiction, and how to get rid of addictions. i also get a lot of questions about what i feel is the spiritual inverse of an addiction, where someone who really doesn't want to do something that would be good and useful for them tries to do it anyway and keeps failing.\n\n\"i can't stick with it\"\n\"i can't stay consistent\"\n\"i procrastinate a lot\"\n\"i understand it's important but i can't get myself to do it\"\n\nan addict is helplessly trying to understand how his addiction is harmful, so he can finally drop it. the latter is trying to understand how his apathy is warranted even after knowing something is useful.\n\nthe only brilliant advice i've heard in the matter — and also experienced it often, firsthand — is master osho's:\n\nif you're addicted to smoking, smoke more. smoke till you can't.\n\nif you're procrastinating, procrastinate till you can't.\n\nthis works. if you're really addicted to something, do it till you either have such a terrible time, you naturally never go back to it again, or you get disillusioned/bored.\n\nall you need is a visceral experience of the harm.\n\nfor example, let's say i make good money in a job where i'm not interested in the work at all. so i'm often procrastinating, till i can't. and what keeps me going is the fear of losing that income, not a love for the work itself.\n\nand i realize this truth only when i stop convincing myself of how much i love the work and simply choose to do what i feel like, till the real fear grips me and i'm moved to act. only then i know what really drives me, which is not the work, but the money.\n\nwhen you say \"i should exercise\" but don't, the stakes are simply not that high. but if you were to fully experience the consequences of not exercising in a high stakes situation — say your gf getting the ick because you got winded during sex — your motivation will now be intrinsic, and you will exercise.\n\nso it's rarely about the thing itself, and usually about what that thing gets you. unless you know this, you won't be able to calculate the real trade-offs. so nothing about your behaviour will change.\n\nif your behaviour isn't changing, it's also quite likely that you're okay with the trade-offs because a lot of them haven't manifested yet. with a smoking addiction, the real trade-offs only manifest once you're diagnosed with lung cancer. before that, you know it intellectually, but you don't KNOW it."
    },
    {
      "id": "1868176982938353754",
      "thread_id": "1868176019578098093",
      "content": "here's a simple insight i apply in my own life:\n\nif i say i \"understand\" something or understand how important it is or how harmful it is, but it still doesn't do anything to change my behaviour, i do not understand it.\n\nso the only thing you can do is wait for a calamity that makes you understand it on a visceral level. that's how most of us learn, ultimately."
    },
    {
      "id": "1868176019578098093",
      "thread_id": "1868175051276906798",
      "content": "i found it quite dull, tbh. reddit-level atheism/philosophy doesn't do much for me anymore. wouldn't watch it again. \n\ntumbbad, otoh, i've watched thrice. it is so much better in every way https://t.co/y8xQe5KCCF"
    },
    {
      "id": "1868175051276906798",
      "thread_id": "1867952314486820872",
      "content": "why do you want to create value for society? i've never felt this urge in my entire life. not even once.\n\nbut if you wish to create value for yourself, find out what you have to offer as an individual and then find a place that values what you have to offer.\n\ncreate value = have something to offer that someone else values"
    },
    {
      "id": "1867952314486820872",
      "thread_id": "1867951736276877335",
      "content": "insofar as mastery involves self-knowledge, yes. it's just logical.\n\ni'm personally a long way from finding out for myself though https://t.co/Z7GdmeUELr"
    },
    {
      "id": "1867951736276877335",
      "thread_id": "1867950962025116089",
      "content": "from an insight perspective, not at all.\n\nbut from an execution and skill perspective, of course yes\n\ni want to be able to write deeply original sentences and not lazily succumb to templates, which i often do. https://t.co/oeJp4YihRW"
    },
    {
      "id": "1867950962025116089",
      "thread_id": "1867935550059286929",
      "content": "yeah, they are the first ones to realize their house isn't full of love, and hence pursue enlightenment https://t.co/KjS1sazZrz"
    },
    {
      "id": "1867935550059286929",
      "thread_id": "1867935289177772036",
      "content": "buy some bitcoin https://t.co/bpucOO027n"
    },
    {
      "id": "1867935289177772036",
      "thread_id": "1867934906124583245",
      "content": "death https://t.co/g68gShbjah"
    },
    {
      "id": "1867934906124583245",
      "thread_id": "1867930957602505068",
      "content": "10 days with kunal, easy https://t.co/x2ctDPKgnt"
    },
    {
      "id": "1867930957602505068",
      "thread_id": "1867929303931130147",
      "content": "that would be everyone, but especially samaaj-enjoyoors and ambition-pilled high-achievers https://t.co/2jy4GWEI9d"
    },
    {
      "id": "1867929303931130147",
      "thread_id": "1867928668997398923",
      "content": "very often. like every other week. i'm rarely happy and i'm very stupid https://t.co/e4nY2EG2ET"
    },
    {
      "id": "1867928668997398923",
      "thread_id": "1867928041785319622",
      "content": "haan bhai https://t.co/CMRV79Ibse"
    },
    {
      "id": "1867928041785319622",
      "thread_id": "1867925637085987234",
      "content": "like 10 years behind, but i don't think in age, so it doesn't matter https://t.co/95hoByoLTv"
    },
    {
      "id": "1867925637085987234",
      "thread_id": "1867924650929553892",
      "content": "i recommend homelessness and bankruptcy. that should get you going https://t.co/7awadzGAhe"
    },
    {
      "id": "1867924963933737112",
      "thread_id": "1867923463891292233",
      "content": "@shapegrifter i'm really stoned and i will cry now"
    },
    {
      "id": "1867924650929553892",
      "thread_id": "1867923423902715936",
      "content": "all company is finally a choice. and the fact that you keep choosing that company means you really want to stay close to the truth\n\nis it possible to stay close to the truth without that company? who knows and why should you care as long as you're close to the truth\n\nwhatever rings true to you, you consistently choose over everything else. and that's the only (non)choice that matters"
    },
    {
      "id": "1867923423902715936",
      "thread_id": "1867922670148636696",
      "content": "see your own bs first, it doesn't have to be someone else's https://t.co/eCRsH46ms9"
    },
    {
      "id": "1867922670148636696",
      "thread_id": "1867922283664466114",
      "content": "so many people here know who i am and you're still guessing?! https://t.co/7h7Zr5ViI9"
    },
    {
      "id": "1867922283664466114",
      "thread_id": "1867919918265712783",
      "content": "i think it would be the same set of responsibilities they would sincerely expect from their own kids if the tables were turned.\n\nof course, one can not predict this if one is young and doesn't have adult kids to base this on. nor can one prove to her parents that the responsibility she shows or doesn't show towards them is the same level of detachment she would expect wholeheartedly from her kids.\n\nso it is for you to know. what level of responsibility pacifies your conscience, all truths considered?\n\nyou can always answer this to a huge degree just by observing the level of expectation you have from others in most of your relationships. and the very fact that you want to have kids also reveals a lot about what will happen when your kids are your age, and you're the one at the receiving end."
    },
    {
      "id": "1867919918265712783",
      "thread_id": "1867919676434719014",
      "content": "ask it to someone who has done something truly remarkable, why ask me https://t.co/cRCIvakhE8"
    },
    {
      "id": "1867919676434719014",
      "thread_id": "1867919297038995784",
      "content": "please don't attempt to psychoanalyse me; you know nothing about me https://t.co/Tk82Vkbo6B"
    },
    {
      "id": "1867919297038995784",
      "thread_id": "1867917964168872306",
      "content": "this is why i keep repeating: truth has no aesthetic.\n\ndoes someone with wife and kids lose the ability to speak the truth?\n\ni mean, to your point, most men would. ofc, provided they had the ability to begin with\n\nbut it's not a rule. there are no rules. https://t.co/jmV0YAaqCM"
    },
    {
      "id": "1867917964168872306",
      "thread_id": "1867917757486125242",
      "content": "then the correct question to ask would be how i deal with embarrassment https://t.co/In9uFd6kMK"
    },
    {
      "id": "1867917757486125242",
      "thread_id": "1867917294346912219",
      "content": "i don't understand the question. what does \"own\" mean? like owning physical stuff like a desk? https://t.co/PwAzqJlTbL"
    },
    {
      "id": "1867917294346912219",
      "thread_id": "1867907079727648916",
      "content": "any business that requires less than 1 lakh worth of infra/tooling to start lol. most service businesses fit this category https://t.co/7vqDWRXzcv"
    },
    {
      "id": "1867907079727648916",
      "thread_id": "1867905658114445670",
      "content": "i don't care about contrarian thinking tbh\ni respect contrarian doing\n\nanyone who is sufficiently decoupled from society and its affects — in a way that changes how they live — has my respect\n\nthere's no way to judge otherwise who's real and who's just larping https://t.co/jhfebGNVPO"
    },
    {
      "id": "1867905658114445670",
      "thread_id": "1867905378153005362",
      "content": "same as always https://t.co/nlJUov95Uq"
    },
    {
      "id": "1867905378153005362",
      "thread_id": "1867904337240093183",
      "content": "even i don't\njust try more things, i guess https://t.co/mMGaJgxa4p"
    },
    {
      "id": "1867904337240093183",
      "thread_id": "1867900830202175548",
      "content": "anxiety is like fever, but psychological\nit's an immune response from your identity which feels attacked and under threat\ninnumerable reasons for feeling constantly restless and under threat, that's for you to find out\nyou'll still have anxiety, but at least you'll understand the whole host of things causing it\nand maybe that'll help. idk.\n\nanxiety \"for no reason at all\" is anxiety \"for multiple reasons at once; too many to count\""
    },
    {
      "id": "1867900830202175548",
      "thread_id": "1867900830202175548",
      "content": "ask me anything. i'll only answer that which makes me look good 🥰\nhttps://t.co/sF6T3BlQti"
    },
    {
      "id": "1867888894651609185",
      "thread_id": "1867888894651609185",
      "content": "peter thiel lately https://t.co/RxepTtXoVC"
    },
    {
      "id": "1867881003630710959",
      "thread_id": "1867878035371753606",
      "content": "only one way to measure happiness: either you're happy or you aren't\n\nit is a binary\n\nintroducing degrees, comparisons, past and future, the very thought of happiness, kills happiness\n\nhappiness is an impossibility; it only exists when it doesn't"
    },
    {
      "id": "1867879184699396181",
      "thread_id": "1867879184699396181",
      "content": "just samaaj things"
    },
    {
      "id": "1867878035371753606",
      "thread_id": "1867878035371753606",
      "content": "two ways to measure anything https://t.co/syhfsrujcy"
    },
    {
      "id": "1867613829217017942",
      "thread_id": "1867612975764234605",
      "content": "@green4ranger puri life mein bamboo bhai, bamboo hi bamboo"
    },
    {
      "id": "1867597219664425072",
      "thread_id": "1867595082834362710",
      "content": "i think it's silly to make good clothes and not tell people how to care for them. where i come from, washing instructions are never read and all clothes get treated the same. so they do not last even half as long as they could have."
    },
    {
      "id": "1867595082834362710",
      "thread_id": "1867595082834362710",
      "content": "glad that at least some brands are doing this https://t.co/nRb1SM4LWt"
    },
    {
      "id": "1867533304758415498",
      "thread_id": "1867532639042781224",
      "content": "@kunalb11 https://t.co/3FlgyEC9ht"
    },
    {
      "id": "1867486223977394606",
      "thread_id": "1867486223977394606",
      "content": "guy ritchie's the covenant is pretty good. ymmv"
    },
    {
      "id": "1867469211213468088",
      "thread_id": "1867466690403115277",
      "content": "@daglihet low-res (1-bit) headline for high-res territory"
    },
    {
      "id": "1867466452074475560",
      "thread_id": "1867466452074475560",
      "content": "the worst and most cringefuck kind of journalism is NPCs commenting on PCs and making a fool out of themselves.\n\ncringe = delusion about one's aukaat\n\ntypically shows up when incompetence is unironically peacocked as competence, saying things that reveal you have no understanding of the gravity/ complexity/ stakes involved, and downplaying the serious and overplaying the trivial."
    },
    {
      "id": "1867458343859892502",
      "thread_id": "1867458343859892502",
      "content": "reality has a lot of detail.\ncraft has a lot of detail.\nhttps://t.co/yEjAzcHdJ0"
    },
    {
      "id": "1866543323072340154",
      "thread_id": "1866543323072340154",
      "content": "https://t.co/XBm1aOzLew"
    },
    {
      "id": "1866192067745239383",
      "thread_id": "1866186411269116416",
      "content": "not a controversial take at all, but the irony is mildly interesting\n\nall the hot takes are already taken, just like all the beautiful spots are by influencers and the influenced"
    },
    {
      "id": "1866186411269116416",
      "thread_id": "1866186411269116416",
      "content": "https://t.co/cTWKxJqiSe"
    },
    {
      "id": "1865463438354354626",
      "thread_id": "1865428359037288832",
      "content": "@visakanv radiators, lungs, large surface area vs small surface area, distribution, cooling, nourishment"
    },
    {
      "id": "1865409029255614909",
      "thread_id": "1865404634254430633",
      "content": "@fruitycigar @shumar that's okay. much better than making a fool out of myself on a bigger bike i can't handle"
    },
    {
      "id": "1865371489807352240",
      "thread_id": "1865370305709175055",
      "content": "i could dream of having a beach house, or i could dream of being the kind of person who can surf. with the beach house, i just need money. but with surfing, i can start learning tomorrow \n\nthe first dream leaves me waiting for luck; the second transforms me into someone more capable"
    },
    {
      "id": "1865370305709175055",
      "thread_id": "1865370305709175055",
      "content": "it's much better to dream of the abilities you want to develop, not just the things you want to own"
    },
    {
      "id": "1865255706468770229",
      "thread_id": "1865255706468770229",
      "content": "my tweets are so fucking cringe, man. i hate coming across them on my own timeline"
    },
    {
      "id": "1865033081587142959",
      "thread_id": "1865026575810642407",
      "content": "@JustAnkurBagchi yeah, old money"
    },
    {
      "id": "1864974885396648396",
      "thread_id": "1864971706877522003",
      "content": "people largely don't spend because they deeply fear if they'll be able to make it back, and even a lot more (if they're buying something that generates leverage)\n\nthey also do not assign a lot of value to good taste and experience, and value it less than money, which reveals that they do not value themselves enough to spend on such subjective things. the subjective value of a thing or experience doesn't factor into their calculations at all.\n\nperfect example of this is people refusing to buy a spotify or yt music subscription even when they listen to a few hours of music every day on these apps.\n\nlargely, anyone who doesn't pay to not subject themselves to shit ads doesn't value a good experience over money."
    },
    {
      "id": "1864970977651667351",
      "thread_id": "1864968636839919632",
      "content": "@_lazypoet_ because hoarding doesn't create wealth"
    },
    {
      "id": "1864965558229217598",
      "thread_id": "1864965558229217598",
      "content": "never forget"
    },
    {
      "id": "1864965326024106117",
      "thread_id": "1864964680814596109",
      "content": "@kaavyya abhi saare gareeb aa jaayenge comments mein"
    },
    {
      "id": "1864956150283931835",
      "thread_id": "1864955274580381816",
      "content": "@oshosidhant as an advice-disher, it's my job to point out the non-specificity of the ask. if not, both my advice and intent are questionable"
    },
    {
      "id": "1864954553126264969",
      "thread_id": "1864954553126264969",
      "content": "(generic) advice is harmful because it doesn't apply precisely when you need it the most"
    },
    {
      "id": "1864918539263676688",
      "thread_id": "1864918539263676688",
      "content": "\"meri utni aukaat nahi hai\" is a fact\n\"meri utni aukaat kabhi nahi hogi\" is not a fact\n\nsomehow, people are so attached to their identity that they automatically associate a fact with a definitive judgment of ability.\n\nif the identity is seen as a static, unchanging entity, any condemnation will be seen as final and binding, and any criticism becomes immediate grounds for enmity."
    },
    {
      "id": "1864915305769701876",
      "thread_id": "1864915305769701876",
      "content": "the biggest enemy of truth is optimistic thinking. not a deep underlying optimism for life, that's a wholly different thing. but the tendency to not be critical enough with yourself and others because you don't want to sound pessimistic or be seen as the bearer of bad news.\n\nthe world glorifies cheerleaders. but these fake fucks only increase your misery in the long run, only so that *they* get the movie-brained pleasure of being that \"supportive friend who loves you and is always kind to you.\"\n\nyou want people who call a spade a spade, and do it in a way that helps you see better, act better. you don't want people who try to convince you that you're better. you don't want storytellers.\n\njust help me understand the world better and you're a great friend. i don't need you to take my side no matter what."
    },
    {
      "id": "1864909562014503138",
      "thread_id": "1864907734006771949",
      "content": "@fruitycigar @shumar i wanted to get a husqvarna svartpilen, but quickly realised i'm not even good at the basics. much better to go with a honda shine or lord splendor for now."
    },
    {
      "id": "1864704780624330921",
      "thread_id": "1864703167893590240",
      "content": "@radicalixt my condolences"
    },
    {
      "id": "1864686039949853075",
      "thread_id": "1864666699590443454",
      "content": "@Ajain112 it's just human nature"
    },
    {
      "id": "1864665425197285408",
      "thread_id": "1864665425197285408",
      "content": "people tend to consider an opinion only once it has generated sufficient momentum and popularity. expose them to it before that and they'll reject it because their sentiment meter hasn't been calibrated for it yet, and calibrating it themselves would be too much work. crowd sourcing is easier."
    },
    {
      "id": "1864662908044452296",
      "thread_id": "1864657534339953040",
      "content": "this has been fairly obvious to me since a long time now. it may be less so for twitter, but is especially true for linkedin.\n\npeople just want to hear what they are already incentivised to believe and preach.\n\nalso, this has little to do with truth, but what people are primed to believe in any signaling cycle.\n\nsome opinions that aren't cool in this signaling cycle will be in a future one. reading the room is crucial if you want positive engagement.\n\nmany of my opinions that were quite uncool and dangerous a few years ago are now very cool now."
    },
    {
      "id": "1864600705232965883",
      "thread_id": "1864591079053611374",
      "content": "@OmnisOpes these are highly personal decisions and you would know best"
    },
    {
      "id": "1864596139435282730",
      "thread_id": "1864591079053611374",
      "content": "@OmnisOpes i'm not recommending anything"
    },
    {
      "id": "1864594587232424050",
      "thread_id": "1864591079053611374",
      "content": "@OmnisOpes it's not about acceptance or rejection"
    },
    {
      "id": "1864594092656873528",
      "thread_id": "1864591079053611374",
      "content": "through reason and direct experience, i saw clearly that the whole family-marriage-kids package wasn't actually for me. the social programming around those things fell away pretty easily once i examined it.\n\nbut the other desires i still cling to — even though I can see they were implanted from outside — i haven't viscerally felt their emptiness yet. so they still drive me.\n\nso you need to evaluate all your real fears for yourself. the ones that still continue to scare you are the ones you'll be bound by. desires driven by other fears that do not scare you any longer will fall off.\n\nit's all very simple. prescriptionizing stuff makes it complicated.\n\nfear binds. that is obvious to anyone. post that, it's only an honest accounting of fears. nothing else."
    },
    {
      "id": "1864591079053611374",
      "thread_id": "1864591079053611374",
      "content": "would you want it if it weren't so safe and socially desirable to want it?\n\nyou'll never know. because you think it is you who wants, whereas all your wants are conditioned into you and there's no saying what you'd want if you were brought up in a totally different society that followed a new system.\n\nno way to know what you'd \"really\" want without all this conditioning. you're peeling an onion looking for the pure onion beneath all the layers. but there are only layers.\n\ngenuine desires are also conditioning, but they're conditioning you can't get rid of simply via reasoning through it. you have to pursue it and hope that you learn something more fundamental about the nature of such pursuits."
    },
    {
      "id": "1864568218544951804",
      "thread_id": "1864566828489691324",
      "content": "@mryalamanchi at least a partner and family, for starters"
    },
    {
      "id": "1864541692273033320",
      "thread_id": "1864541025936502911",
      "content": "big caveat: need to spend your 20s understanding yourself and becoming psychologically freer, or this doesn't work"
    },
    {
      "id": "1864541025936502911",
      "thread_id": "1864541025936502911",
      "content": "being uncommitted and free in your 30s means you can enjoy life as if you were in your 20s, that too with all this money you didn't have back then"
    },
    {
      "id": "1864216732342137018",
      "thread_id": "1864216732342137018",
      "content": "i got my first copywriting job by simply sending a  link of the website i'd written copy for at the time + two medium blogs"
    },
    {
      "id": "1864209165951836607",
      "thread_id": "1864208750011195672",
      "content": "@a_kneetha you need to promote yourself sweaty"
    },
    {
      "id": "1864200897393537241",
      "thread_id": "1864200349315153965",
      "content": "@OneAbhishekJain real life"
    },
    {
      "id": "1864196531265364217",
      "thread_id": "1864196531265364217",
      "content": "at 30, i look and live like i'm 20. i reject age. and i embarrass myself consistently, just like a dumb teenager.\n\nadults turn so domesticated and safe, they forget what embarrassment feels like.\n\nbut embarrassing yourself frequently keeps you grounded. there's no prize for behaving like a mature adult, no satisfaction in being applauded by the crowd."
    },
    {
      "id": "1863991298706882656",
      "thread_id": "1863986737795694842",
      "content": "here https://t.co/AsNMZvGVlI"
    },
    {
      "id": "1863989926058250430",
      "thread_id": "1863989269276102796",
      "content": "@OtakuProcess you can simply put my handle there and see it yourself"
    },
    {
      "id": "1863988178908037334",
      "thread_id": "1863986737795694842",
      "content": "it's very true to how i live as well"
    },
    {
      "id": "1863986737795694842",
      "thread_id": "1863986737795694842",
      "content": "guess what mine is"
    },
    {
      "id": "1863948950241509402",
      "thread_id": "1863925071032541567",
      "content": "yes, it's just a concept. like everything else. there are no things in reality. only concepts.\n\nbut the final arbiter is reality. any concept works and is useful because it describes reality in a way that allows us to do things, build things.\n\nmost of us can't visualize higher dimensional spaces basis our intuition about 3-dimensional spaces. that doesn't mean they don't exist or aren't useful.\n\nalso why length and breadth are a really bad way to think about it. because it limits the concept to 3-dimensions, which is not where its utility ends. \n\nwe have n-dimensional matrices that are highly useful, although they cannot be easily visualized. the concept only truly generalizes at the level of dimensionality."
    },
    {
      "id": "1863930434486157556",
      "thread_id": "1863929985234313526",
      "content": "@Samhanknr exactly, you have to assume dx, which is another dimension."
    },
    {
      "id": "1863925071032541567",
      "thread_id": "1863925071032541567",
      "content": "i guess that should answer it. no adding up infinitesimal widths or lines. area is a separate abstract construct and cannot be derived from length alone. it needs two dimensions, by definition. there's no extending one dimensional stuff in a way it becomes two dimensional. https://t.co/bZ9KgDWVDg"
    },
    {
      "id": "1863861497765453967",
      "thread_id": "1863860542831784317",
      "content": "what makes this entire thing confusing is length and breadth\n\nit's not about length and breadth, it's about 2 dimensions, which is what makes the square unit\n\na circle only has a radius, no length or breadth. yet, it has an area measured in sq. cm\n\nso just think of it as how many 1cm x 1cm squares it would take you to fill that circle completely"
    },
    {
      "id": "1863860542831784317",
      "thread_id": "1863857071109583046",
      "content": "what about them?\n\ncm^2 is a totally new unit, different from cm. it's a two dimensional unit. you can't separate individual lengths from it, unless you know one of those lengths\n\n20 sq. cm tells me nothing about the length or breadth or even shape of the area\n\nit just tells me it's worth 20 squares, all measuring 1 cm x 1 cm"
    },
    {
      "id": "1863826680445370696",
      "thread_id": "1863599839780515847",
      "content": "@MangoZeus you multiply when you add a dimension.\n\narea is two dimensional. you multiply becuse if the second dimension is 0, you have no area, only length\n\nif the third dimension is 0, you have only area, no volume"
    },
    {
      "id": "1863624437335048244",
      "thread_id": "1858239806503018785",
      "content": "@tszzl https://t.co/SzBdnL7KbF"
    },
    {
      "id": "1863615835195027607",
      "thread_id": "1863615835195027607",
      "content": "the people have spoken and their priorities are clear."
    },
    {
      "id": "1863248605840085261",
      "thread_id": "1863248605840085261",
      "content": "bada hoke"
    },
    {
      "id": "1863246966110527950",
      "thread_id": "1863246966110527950",
      "content": "a perpetual oscillation between lavvel sabke niklenge and arey jaldi bata kal subah panvel nikalna hai"
    },
    {
      "id": "1863112502168674527",
      "thread_id": "1863111576359997794",
      "content": "@oshosidhant yeah"
    },
    {
      "id": "1863110942151811130",
      "thread_id": "1863109858851188805",
      "content": "@oshosidhant all proxies are lossy. not a big fan of reputation myself. many circle-jerks and cheerleading groups.\n\nbut founders assign enormous weightage to references from people they trust. and beyond a certain level of hire, only good references do the job."
    },
    {
      "id": "1863108425141616724",
      "thread_id": "1863107327768871213",
      "content": "yeah, which is why we have proxies in the employment context, like reputation. and reputation matters when outlier skills aren't easily demonstrable. \n\ngeneralists and usually people in softer roles like project management and founder's office need to care about their reputation the most, because without it, there's no way to prove your worth to the larger market.\n\nthere's no way to demo coordination ability or management ability in an interview. and resumes can be fluffed up in ways that make the resume irrelevant.\n\nbut if you're a founder, you need no proxies. how well your business does, speaks for you."
    },
    {
      "id": "1863106442993299881",
      "thread_id": "1863095448652706161",
      "content": "i have very strong views on this because of one overarching principle:\n\nan excellent measure of success is how little you have to compete — both externally and internally.\n\npeople take statements like \"combination of skills\" and \"t-shaped skillset\" to buy time and delay doing the hard thing. the hard thing here being chasing depth and fleshing out the vertical in that \"T\" shape (which is ultimately rooted in self-awareness).\n\nthey serve as a comforting lie. you can always justify being average at multiple things by saying you're building a unique combination.\n\nbut years pass, and suddenly you realize you're still fighting for every opportunity, still competing with everyone else, still having to prove yourself – just like day one.\n\nvery few generalists actually find their edge at some unique intersection of skills that's generally valuable in the market. most just drift along, collecting surface-level knowledge and wondering why they're still replaceable after years of \"diverse experience.\"\n\nyes, specialists can plateau too. often harder than generalists. but they know it, they chose it, and most importantly – they rarely face intense competition. and just this privilege of not having to constantly compete is worth half your lifetime earnings. the psychological stability of being known for doing one thing exceptionally well can add many years to your life."
    },
    {
      "id": "1863098665222783097",
      "thread_id": "1863097441504956510",
      "content": "@OtakuProcess @ponnappa yeah, true"
    },
    {
      "id": "1863095448652706161",
      "thread_id": "1863095448652706161",
      "content": "if someone tells you that\n\n1. being 80-90% good at multiple skills is more achievable and makes for a unique, irreplaceable combination, and\n\n2. they've found great success doing that,\n\nyou should know that they have some metaskill they're close to 100th percentile at — like raw social intelligence, taste, judgment, coordination ability, insane courage, etc.\n\nrare things are for the rare and every virtue demands its pound of flesh. no free lunches. no way to be utterly mediocre in life and sustainably generate outlier outcomes.\n\nto be an outlier, something about you needs to be outlier-level."
    },
    {
      "id": "1863090906422722644",
      "thread_id": "1863085121827402024",
      "content": "@OtakuProcess @INxPSeeker bohot gaand jalan le li deepjyoti bhau ne"
    },
    {
      "id": "1862916938189668480",
      "thread_id": "1862914578713395518",
      "content": "in general, compliments, gifts, sycophancy, praise, acclaim — all of these are ways to buy you.\n\npowerful is he who doesn't even register."
    },
    {
      "id": "1862914578713395518",
      "thread_id": "1862913568133529689",
      "content": "pehle bolo tum special ho. khoob special feel karaao. phir usi bahaane oppress aur control karo. kaafi chaalaak aur badhiya scheme hai."
    },
    {
      "id": "1862913568133529689",
      "thread_id": "1862913568133529689",
      "content": "the very first step to oppressing someone is assigning them special status.\n\nfirst, they pedestalize you.\nthen, they oppress you.\n\nno one knows this better than women. but they're too pampered to give up the pedestal, so they bear the oppression, too.\n\nlittle do we know that both come and go together, just like both happiness and sadness go together.\n\ncan't keep the happiness without the sadness.\ncan't keep the pedestal without the oppression.\n\nthis applies to all humans, women are just an example.\n\n(they're also humans, btw. about half of them)"
    },
    {
      "id": "1862909658068869524",
      "thread_id": "1862903696671244329",
      "content": "@INxPSeeker @wordi25 don't worry, it takes a few years to progress from pointing out ad hominem to realising its unique value in discourse https://t.co/CgIIhy5VFX"
    },
    {
      "id": "1862908716292460909",
      "thread_id": "1862903347155763631",
      "content": "@INxPSeeker @OtakuProcess you're just proving it, but i can tell you're very young so it's okay. even i was a dumbass at your age."
    },
    {
      "id": "1862908161541152841",
      "thread_id": "1862906211085267364",
      "content": "@yoltartar there's no stability, only chaos. but that can be surfed with way less oscillation than a market crash. however humans are wired to be attached to their narratives, so small waves turn into tsunamis."
    },
    {
      "id": "1862900986320167317",
      "thread_id": "1862900676667621848",
      "content": "@INxPSeeker @wordi25 bro, how old are you? 🤣🤣🤣\n\nyou have MUN debater energy"
    },
    {
      "id": "1862899979582321150",
      "thread_id": "1862899098044780958",
      "content": "@INxPSeeker @OtakuProcess you're a fucking dumbass 🤷🏻‍♂️"
    },
    {
      "id": "1862899161999298715",
      "thread_id": "1862897605694644648",
      "content": "this is not an argument against modeling or prediction but against turning blind to reality. \n\nit's totally possible to model and update our models based on observation in real time. we do it all the time while living in the physical world.\n\nonly when it comes to the self and the psyche, we start to completely ignore reality in favour of the model, never wanting to update it."
    },
    {
      "id": "1862896892763406595",
      "thread_id": "1862890252983214518",
      "content": "@yoltartar the very tendency to conceptualise, model, and follow the model leads to oscillation."
    },
    {
      "id": "1862814041246240943",
      "thread_id": "1862812749790908752",
      "content": "@INxPSeeker abey jaa yaar, paka mat"
    },
    {
      "id": "1862812117578973270",
      "thread_id": "1862809355021619617",
      "content": "people parroting bumper stickers https://t.co/NxQa42nAZD"
    },
    {
      "id": "1862811229200228673",
      "thread_id": "1862810671295184961",
      "content": "@INxPSeeker i don't care who you've met, bhai. it's the internet, everyone has \"met\" and heard from all the best people. that doesn't tell you anything about it.\nhttps://t.co/6OXgzu09uS"
    },
    {
      "id": "1862809355021619617",
      "thread_id": "1862807908662325493",
      "content": "scott adams introduced this idea. naval promoted it. and now all lukkha chawals are drinking this koolaid.\n\n\"combination of skills\"\n\nbhai, if you had it, you'd likely be C-suite level already, if not a successful founder yourself."
    },
    {
      "id": "1862807908662325493",
      "thread_id": "1862774344965136701",
      "content": "the problem with \"combination of multiple skills you're 80th percentile in\", even though it is true, is that the people preaching it are super smart and rare, and have a really high bar for those skills — while you who is accepting this at face value neither has the high bar nor the combination of skills.\n\nyou're nowhere even near their 80th percentile. the groups they hang out in are so elite, their 80th percentile is close to 99th percentile in your world.\n\nan 80th percentile chef in a group of michelin star chefs is actually 99.999th percentile.\n\nand yet you go around parroting this instead of figuring out where you can actually cultivate a really high bar.\n\nonly after you have a high bar in one thing do you realize what being 80th percentile even means. and it only means something when you know what 100th percentile looks like.\n\nanyone average can claim to be 80th percentile, but even if you accumulate ten such skills, it will take you nowhere.\n\nbecause what you think is 80th percentile, isn't.\n\nfucking dumbass."
    },
    {
      "id": "1862804288243995072",
      "thread_id": "1862799640879411667",
      "content": "@moreyashh writing, sales, project management, building software"
    },
    {
      "id": "1862801924501934080",
      "thread_id": "1862801924501934080",
      "content": "ek skill dhang se seekh nahi paa rahe, yaha \"combination of skills\" ki bakchodiya peli jaa rahi hai."
    },
    {
      "id": "1862801622373658988",
      "thread_id": "1862797451197022433",
      "content": "@INxPSeeker it doesn't matter, you're not here to understand. good luck."
    },
    {
      "id": "1862796517842526679",
      "thread_id": "1862782666820436419",
      "content": "hot take: \"seeing clearly\" has no inherent value\n\nit either informs actionable predictions or it's just another form of entertainment or mythology\n\nmuch of science, journalism, philosophy, and politics should be considered part of the entertainment industry"
    },
    {
      "id": "1862795819436409116",
      "thread_id": "1862790440627614160",
      "content": "@INxPSeeker sun ne ke liye achha hai. valid bhi hai, but only for rare folks and they're typically successful founders (also from where you're drinking this koolaid)"
    },
    {
      "id": "1862782666820436419",
      "thread_id": "1862782250300912037",
      "content": "reflexive contrarianism makes you retarded."
    },
    {
      "id": "1862782250300912037",
      "thread_id": "1862781514942939598",
      "content": "the tendency of the mind to close its eyes and conceptualise reality in the form of narratives + build on top of that outdated conception is why markets oscillate perpetually.\n\nif you were always seeing the system as it is, there would be no accumulation and subsequent destruction."
    },
    {
      "id": "1862781514942939598",
      "thread_id": "1862779925092036850",
      "content": "truth is essential because we are always blind to the whole configuration — the real intent is usually obscured away by romanticism and narratives — so any action you take from such a delusional foundation will always fail to deliver the expected goods. and the misunderstandings  keep on piling up till it's almost impossible to see the system as it is.\n\nhence, people only rendezvous with truth during catastrophes and calamities, where the entire delusional framework of lies is obliterated in one fell swoop.\n\nit's no different from a market bubble burst, but on an individual level."
    },
    {
      "id": "1862779925092036850",
      "thread_id": "1862779925092036850",
      "content": "it's like saying \"what is\" has no inherent value, or \"knowing the state of the system as it exists right now\" has no inherent value.\n\nyeah maybe it doesn't have any value outside of time, like a point has no dimension or existence in space, but the tragedy is we never get to know the whole state of the system as it exists, so any predictions or actions leading from it will always be misinformed and misguided."
    },
    {
      "id": "1862774344965136701",
      "thread_id": "1862774344965136701",
      "content": "the secret to always being employed, no matter what the job market looks like:\n\nbe really good at something widely useful. it decouples/buffers you from the effects of supply and demand.\n\nthis a function of\n\nliquidity of your skill x competence\n\na \"liquid\" skill is one that's transferable across industries, roles, and market conditions. the liquidity comes from how easily you can redeploy that skill in different contexts.\n\nbe too competent at a highly illiquid skill and you risk obsolescence. like being the world's best horse-cart racer in 2024. you might be incredibly skilled, but there's no demand.\n\nhave a highly liquid skill but average competence and you will be quickly pushed out of the market when demand wanes. like being an average web developer. it's a highly liquid skill, but in tough times, you're competing with thousands of others just like you. when companies cut jobs, being average makes you replaceable.\n\nbut when you have a highly liquid skill and high competence, you start decoupling from market forces. that's where you want to be.\n\nyou can\n\n- command premium rates even in down markets\n- quickly pivot to adjacent opportunities\n- create your own demand through reputation\n\nthe worst is being average at something unimportant — like being a mediocre chef serving some obscure cuisine. you're neither the best, nor useful across a wide-range of contexts."
    },
    {
      "id": "1862727026689679367",
      "thread_id": "1862726728537526298",
      "content": "no truthseeking individual talks like this."
    },
    {
      "id": "1862726728537526298",
      "thread_id": "1862726728537526298",
      "content": "people who love throwing the \"theek hai, hum sab toh chutiye hai, tu hi ek hoshiyaar hai\" argument are usually chutiya.\n\nspeaking from some experience."
    },
    {
      "id": "1862722976195780977",
      "thread_id": "1862722976195780977",
      "content": "if only people did things earnestly for a long time before assigning themselves labels and titles and congratulating themselves for doing the thing, they would do a much better job at doing the thing."
    },
    {
      "id": "1862568108097249318",
      "thread_id": "1862565771731443897",
      "content": "@fruitycigar the core difference is that of choice, or the lack of it. and i do not see how someone who has a choice would ever choose to venture into the deep end. and shying away from the deep end while claiming to be a philosopher would only make one a sophist."
    },
    {
      "id": "1862566961076740113",
      "thread_id": "1862566961076740113",
      "content": "the man is blind because logic is blind, so the only way to navigate using it is by keeping in constant touch with both subjective and objective reality at all times. and the only reality accessible to this blind fuck is the walls that make up this maze and how he finds himself in relationship to them.\n\ninsofar the parkour metaphor alludes to the risks involved, i understand. but it fails on all other fronts as a good analogy for philosophy."
    },
    {
      "id": "1862563179575844884",
      "thread_id": "1862560733822685239",
      "content": "have seen that parkour analogy before but it has never made sense to me. parkour is about making wild leaps and jumps, while philosophy is akin to being a blind man in a maze who is trying to reach an exit by constantly having his hand touching the left wall, never losing contact with it. being blind, his fate is choicelessly subject to the left wall and whatever it leads him to. sticking the course means he has no say in the matter. while parkour feels fundamentally different and not at all like philosophy. parkour actually feels more akin to sophistry than philosophy."
    },
    {
      "id": "1862560340740813074",
      "thread_id": "1862551432223715450",
      "content": "https://t.co/3iS0443WfO"
    },
    {
      "id": "1862556048755683604",
      "thread_id": "1862554754267611608",
      "content": "forget gurus, philosophy itself is wholly unhelpful. even harmful."
    },
    {
      "id": "1862554754267611608",
      "thread_id": "1862554754267611608",
      "content": "100%"
    },
    {
      "id": "1862551432223715450",
      "thread_id": "1862538759881068679",
      "content": "of course most prophets and mystics have their fair share of anecdotes describing their supernatural abilities.\n\nthere's this one anecdote about gurdjieff from his student ouspensky (iirc) where the latter describes how gurdjieff went from not knowing a word of russian to speaking the language fluently in just an hour of sitting across a russian guest who had come to visit him.\n\nof course i do not weigh this as heavily as someone as rational and skeptical as jk admitting that such things were entirely possible.\n\nmakes you question your entire model of reality and consider the very real possibility that you're living in total ignorance."
    },
    {
      "id": "1862546155235627392",
      "thread_id": "1862542716967452752",
      "content": "@MangoZeus ehh, not the point. it makes one truly question the nature of reality and how much of it we understand (or don't)"
    },
    {
      "id": "1862539627799650410",
      "thread_id": "1862538993755107573",
      "content": "@omnidepressant quotations randomly pulled sans context or understanding of the total ecology are not \"genuine\""
    },
    {
      "id": "1862538759881068679",
      "thread_id": "1862535451401495024",
      "content": "- seeing a monk float his way from one corner of the room to the other\n- being able to read others' minds, seeing their past\n- being able to heal with mere proximity and touch\n- clairvoyance\n\nall this is not even from autobiography of a yogi, btw.\n\nit's from j. krishnamurti talking about his experiences/abilities in his conversations with people.\n\nand to have someone like him ever so reluctantly talk about these things on the rare occasion really influenced what i think is possible."
    },
    {
      "id": "1862535451401495024",
      "thread_id": "1862535451401495024",
      "content": "what if you assumed everything mentioned in the autobiography of a yogi is real and possible?\n\nhow would it change your evaluation of your life?"
    },
    {
      "id": "1862495861600550987",
      "thread_id": "1862493180022632955",
      "content": "@chiraguh it's good to experiment with. the feedback loop it creates helped me modify my environment + certain habits.\n\nnot at all a must-have. is probably more useful for someone who is disciplined, loves numbers, and wants to optimise their stats. i'm not this person"
    },
    {
      "id": "1862476925308215622",
      "thread_id": "1862476925308215622",
      "content": "bro i stopped taking you seriously when you perverted the bhagavad gita for dishing out motivation."
    },
    {
      "id": "1862444846071284097",
      "thread_id": "1862442965534482491",
      "content": "@akashsaluja i'm not one to pee on someone's wins. had to do it because he tried to be a smart ass in my replies. total noob energy.\nhttps://t.co/Uck3IBSYbY"
    },
    {
      "id": "1862442869962736042",
      "thread_id": "1862435358857642240",
      "content": "forgor mct. mct with coffee is also quite good and acts as a slow and sustained release for caffeine + provides energy. i take it every once in a while"
    },
    {
      "id": "1862440509777584189",
      "thread_id": "1862438870987448491",
      "content": "@nadininv yeah, i didn't realise you need to have it like people have paan"
    },
    {
      "id": "1862435915156582543",
      "thread_id": "1862435235356426647",
      "content": "@tsawrub experienced everything you said except the insomnia. never had any trouble sleeping as long as i took it early in the morning"
    },
    {
      "id": "1862435358857642240",
      "thread_id": "1862434561746977153",
      "content": "i've tried it but it makes me feel nauseous. i prefer a cigarette with coffee over nicotine gum\nhttps://t.co/XwjUUXSg9m"
    },
    {
      "id": "1862434561746977153",
      "thread_id": "1862431766847336786",
      "content": "special mentions:\n\nalcohol: my poison of choice due to the kind of creativity it enables, but i rarely drink it. haven't had it in like 6 months now. \n\ntongkat ali: great once in a while to feel all testy and amped up, but can't take it regularly because it ups my body heat significantly\n\nashwagandha: super meh, couldn't notice anything.\n\ncollagen: i take it, but health benefits aren't observable, so can't say\n\ncocoa: great for improving blood flow and boners"
    },
    {
      "id": "1862431766847336786",
      "thread_id": "1862430627275874770",
      "content": "air conditioning, by far, has had the biggest impact on my sleep quality and recovery. magnesium and lion's mane before sleep have also been good, but sleeping in a cold and dark room tops everything."
    },
    {
      "id": "1862430627275874770",
      "thread_id": "1862430627275874770",
      "content": "sharing my personal experience:\n\nmodafinil + coffee: if you don't have a project for the day to lock into, and if you do not lock in immediately, moda will actually amplify your distraction. you will spaz out on pointless activity\n\nl-theanine + coffee/moda: can't have it too many days in a row, i experience a terrible downer. excellent for feeling happy/getting good sleep\n\nlion's mane: excellent substitute for l-theanine without the downer. makes me calmer, sharper, and more articulate as well\n\ngingko: great boners. useless for anything else.\n\nmagnesium: excellent for good sleep, boosts recovery\n\nfish oil/vit d: great for alertness + great boners, terrible if i take it close to bedtime\n\nedibles: they're insanely fatiguing for my nervous system without any significant boost in creativity or thinking. i just feel high\n\ncreatine: makes everything 5-10% better\n\nwhey protein: kills my hunger. kills sleep if i take it close to bedtime. perfect for consumption before 3pm\n\nthiamine: coffee blocks thiamine absorption but if i take it half an hour before my morning cup, i feel sharper\n\nlargely haven't found anything that strictly helps me avoid getting distracted, because a supplement cannot do that. only a project i can lock into for a few hours at least can do it."
    },
    {
      "id": "1862421211260613099",
      "thread_id": "1862421211260613099",
      "content": "haven't experienced this level of neurological fatigue in a long time\n\nwent overboard with the bio hacking this week"
    },
    {
      "id": "1862419904143765929",
      "thread_id": "1862416729218928862",
      "content": "i'm also pretty much a normie on the surface, along many of the obvious metrics, but i still agree with the 5% normie analysis because i'm really not normal at all.\n\nhard to explain. most of my developmental processes have been totally nerfed by the void. the concept of \"growth\", along with all its typical milestones, has almost ceased to exist on an ontological level for me."
    },
    {
      "id": "1862416729218928862",
      "thread_id": "1862416729218928862",
      "content": "not sure what algo it's using and how it works, but besides the 95% autistic rating, it pretty much aligns with my self-evaluation. https://t.co/5JkbVBzkoQ"
    },
    {
      "id": "1862401496605659147",
      "thread_id": "1862138681496371380",
      "content": "@rajanbajaj_ max liquidity + smarter security + no upselling\n\n1. don't make me jump multiple hoops to use my own money wherever i want\n\n2. don't force me to change my password every time i try to use your system\n\n3. leave me alone. i'll call you when i have a problem, don't worry"
    },
    {
      "id": "1862391074171568597",
      "thread_id": "1862366649870905498",
      "content": "@Ajain112 classic example of \"the more detail you provide, the more scrutiny you invite\"\n\ngood snake oil and detail rarely go well together."
    },
    {
      "id": "1862383390659322100",
      "thread_id": "1862383390659322100",
      "content": "guy brags about deadlifting 90kg without belt and calls himself thor ka baap 😂😂😂\n\ni've lifted 130 and never had the gall to say such things\n\nbe fit, but never be a fitness ka choda in life."
    },
    {
      "id": "1862381671141843091",
      "thread_id": "1862381150825791660",
      "content": "@ThorKaBaap i can still lift more than you, without a belt and certainly at a lower bodyweight than yours\nhttps://t.co/76FMCe9RpP"
    },
    {
      "id": "1862381150825791660",
      "thread_id": "1862380809132679295",
      "content": "@ThorKaBaap abey fitness ke chode, what do you not understand about someone being sick and overstimulated"
    },
    {
      "id": "1862380254276591938",
      "thread_id": "1862377682702671957",
      "content": "@ThorKaBaap sorry, but i can lift way more than you\nhttps://t.co/znyXXOUPZb"
    },
    {
      "id": "1862379116449997216",
      "thread_id": "1862377694392164721",
      "content": "@daglihet been using it for a few months now. it has certainly made me realize a few things i wouldn't have realized by myself"
    },
    {
      "id": "1862375593930891302",
      "thread_id": "1862375593930891302",
      "content": "my eyeballs hurt https://t.co/10ERgzFZcG"
    },
    {
      "id": "1862364985244201394",
      "thread_id": "1862364985244201394",
      "content": "oh, to think immigrants SHOULD learn the local language while your own parents made sure you learn english first so you do not develop an accent 🤡"
    },
    {
      "id": "1862142758422503769",
      "thread_id": "1862142758422503769",
      "content": "bad cgi feels funny in the same way watching someone record a tiktok dance as an onlooker feels funny.\n\nboth reveal the absurdity of what's going on in the absence of the supporting frame."
    },
    {
      "id": "1861658509701714092",
      "thread_id": "1861658509701714092",
      "content": "been saying this for years.\n\ni don't think agi is possible without an ego."
    },
    {
      "id": "1861477483209728010",
      "thread_id": "1861477483209728010",
      "content": "https://t.co/bELhJCcgrD"
    },
    {
      "id": "1861454472200982665",
      "thread_id": "1861454037658542554",
      "content": "https://t.co/jXMEbujwix"
    },
    {
      "id": "1861454236334334235",
      "thread_id": "1861439090903994417",
      "content": "okay, add this one too\nhttps://t.co/Oa2IQWuoSY"
    },
    {
      "id": "1861454037658542554",
      "thread_id": "1861454037658542554",
      "content": "jeremy fielding is an absolute blessing on my youtube.\n\ngreat explanations packed with insight that you're only privy to after a lot of experience.\n\nreality truly has a lot of detail.\n\nno one taught me this in my five years of engineering, and yet this is the most useful thing to learn.\n\nit carries over to so many different things than just engineering. the thought process itself is quite valuable.\n\nhttps://t.co/hYDFDJpbBH"
    },
    {
      "id": "1861439090903994417",
      "thread_id": "1861438644520919478",
      "content": "okay, i think this should be enough"
    },
    {
      "id": "1861438859617435770",
      "thread_id": "1861438238105256416",
      "content": "@theoluminati it's a conclusion neither party — for or against wifejak — will like"
    },
    {
      "id": "1861438644520919478",
      "thread_id": "1861438374600679815",
      "content": "https://t.co/XLVHsgo5PR"
    },
    {
      "id": "1861438374600679815",
      "thread_id": "1861438264785469744",
      "content": "wise\nhttps://t.co/1B5s4WsGtd"
    },
    {
      "id": "1861438264785469744",
      "thread_id": "1861438198003704179",
      "content": "https://t.co/8TKN71Pfdt"
    },
    {
      "id": "1861438198003704179",
      "thread_id": "1861438048413851946",
      "content": "https://t.co/m3Mi3xdWS3"
    },
    {
      "id": "1861438048413851946",
      "thread_id": "1861437881237282971",
      "content": "https://t.co/FcRnjpdv5L"
    },
    {
      "id": "1861437881237282971",
      "thread_id": "1861437591285084364",
      "content": "i see i see https://t.co/3KOor7q7pS"
    },
    {
      "id": "1861437591285084364",
      "thread_id": "1861437369238593742",
      "content": "https://t.co/YzTF5TosSJ"
    },
    {
      "id": "1861437369238593742",
      "thread_id": "1861436925149958353",
      "content": "yeah, i'm slowly triangulating on something quite similar\nhttps://t.co/u3igXh4cNG"
    },
    {
      "id": "1861436925149958353",
      "thread_id": "1861436068723315004",
      "content": "not sure if i agree, but interesting nevertheless\nhttps://t.co/mOXneBvdhE"
    },
    {
      "id": "1861436068723315004",
      "thread_id": "1861435518447427996",
      "content": "😂😂😂\nhttps://t.co/Yrz2VLV6qz"
    },
    {
      "id": "1861435518447427996",
      "thread_id": "1861435125445337236",
      "content": "🤔\nhttps://t.co/xUV9I9GH8w"
    },
    {
      "id": "1861435125445337236",
      "thread_id": "1861434819219202345",
      "content": "okay, my mental model is getting clearer around wifejak\nhttps://t.co/5nWZ3vB0zs"
    },
    {
      "id": "1861434819219202345",
      "thread_id": "1861434643683385821",
      "content": "https://t.co/S3UYH3q0Ng"
    },
    {
      "id": "1861434643683385821",
      "thread_id": "1861434394243932336",
      "content": "makes sense\nhttps://t.co/GZ19u6rv2W"
    },
    {
      "id": "1861434394243932336",
      "thread_id": "1861433987442581933",
      "content": "https://t.co/IgZtCzzE7H"
    },
    {
      "id": "1861433987442581933",
      "thread_id": "1861433332275589270",
      "content": "https://t.co/gha9CulaMG"
    },
    {
      "id": "1861433332275589270",
      "thread_id": "1861432891219325045",
      "content": "https://t.co/rYaktMi3sQ"
    },
    {
      "id": "1861432891219325045",
      "thread_id": "1861432698604298308",
      "content": "https://t.co/NtfFcYAue5"
    },
    {
      "id": "1861432698604298308",
      "thread_id": "1861432548079083809",
      "content": "deep\nhttps://t.co/gMS64yMgBO"
    },
    {
      "id": "1861432548079083809",
      "thread_id": "1861432414561824889",
      "content": "wow\nhttps://t.co/Be8BOXNS0i"
    },
    {
      "id": "1861432414561824889",
      "thread_id": "1861432307347005926",
      "content": "https://t.co/2nvUj2UHjx"
    },
    {
      "id": "1861432307347005926",
      "thread_id": "1861432096172191755",
      "content": "https://t.co/6l5VZq0W61"
    },
    {
      "id": "1861432096172191755",
      "thread_id": "1861431957344920040",
      "content": "https://t.co/5l5Nk1Cfrt"
    },
    {
      "id": "1861431957344920040",
      "thread_id": "1861431770107064459",
      "content": "nice!\nhttps://t.co/QCJTVRHn9u"
    },
    {
      "id": "1861431770107064459",
      "thread_id": "1861431501050789938",
      "content": "very interesting\nhttps://t.co/Y8Y7EVqfFC"
    },
    {
      "id": "1861431501050789938",
      "thread_id": "1861431244120301854",
      "content": "https://t.co/uaTRiXOwex"
    },
    {
      "id": "1861431244120301854",
      "thread_id": "1861430839562940665",
      "content": "https://t.co/hMls5Wbpsp"
    },
    {
      "id": "1861430839562940665",
      "thread_id": "1861430839562940665",
      "content": "collating all the good tweets i can find with interesting interpretations of the wifejak meme in this thread"
    },
    {
      "id": "1861317143150895368",
      "thread_id": "1861317143150895368",
      "content": "excuses are where the heart isn't"
    },
    {
      "id": "1861312514249957832",
      "thread_id": "1861312514249957832",
      "content": "reality has a lot of detail."
    },
    {
      "id": "1861076142968520897",
      "thread_id": "1861073912068489505",
      "content": "@JustAnkurBagchi i don't consider the latter 'philosophers', only intellectuals"
    },
    {
      "id": "1861073283820421347",
      "thread_id": "1861071872483275082",
      "content": "@JustAnkurBagchi philosophy never promises to be useful, and rarely is; it only promises truth and wherever it leads you\n\na philosopher seeking utility is a bad philosopher, i.e., not a philosopher"
    },
    {
      "id": "1861071736160096476",
      "thread_id": "1861071736160096476",
      "content": "truly smart people always react positively to honesty, even if its content is negative."
    },
    {
      "id": "1861069919527284826",
      "thread_id": "1861065007280095668",
      "content": "@JustAnkurBagchi the words and the unique mental motions they create are really good though"
    },
    {
      "id": "1861042813770620997",
      "thread_id": "1861005102493905073",
      "content": "@JustAnkurBagchi for me, it's the sheer sadness of attachment and the inevitability of death and loss"
    },
    {
      "id": "1861025459141579243",
      "thread_id": "1861025459141579243",
      "content": "marry a designer and your house will always look aesthetic ✨"
    },
    {
      "id": "1860912218822308247",
      "thread_id": "1860911531208417701",
      "content": "@pseudonymtra suggestion: use sentence case for headlines, not title case. it scales better.\n\ntitle case is okay for short headlines, but for longer ones, it looks off."
    },
    {
      "id": "1860885854090072401",
      "thread_id": "1860885854090072401",
      "content": "new linkedin bio ✨ https://t.co/bF2QY5E6q5"
    },
    {
      "id": "1860674093898473801",
      "thread_id": "1860671784082612246",
      "content": "@Ajain112 the mind will feel bad for any reason under the sun because conjuring up insecurity and then pushing back against said insecurity is its entire nature."
    },
    {
      "id": "1860612711027249352",
      "thread_id": "1860612711027249352",
      "content": "this was a real rite of passage for me, because i had been a class topper all throughout my school life.\n\nmy engineering batchmates who knew me from school used to walk up to me and show concern.\n\n\"bro, i've known you as a topper all through school and now you're a failure. what's going on\"\n\nthat period is usually the time when average performers start their upward trajectory in academics.\n\ni went down a cliff during the same period.\n\ncountless backlogs during engineering, one dropped year, some infamy around being an \"eid ka chaand\" and rarely attending college, contempt from all studious kids...\n\nit was a good time."
    },
    {
      "id": "1860608026526531870",
      "thread_id": "1860606619152678970",
      "content": "@nadininv congratulations and all the best."
    },
    {
      "id": "1860607874814423119",
      "thread_id": "1860607874814423119",
      "content": "okay, real possibility that i have turned into the bad influence/company your parents warned you about"
    },
    {
      "id": "1860607029976736017",
      "thread_id": "1860606009179295896",
      "content": "@nadininv all relatable. depending on how much control your parents exert on you and the degree to which they treat you like their property, there will be many bigger milestones you'll cross. be prepared. you'll be okay, they won't be"
    },
    {
      "id": "1860606390584410196",
      "thread_id": "1860606390584410196",
      "content": "going otaku on a problem and quickly becoming a threat to society are sets with a nontrivial overlap, depending on what you get obsessed about"
    },
    {
      "id": "1860605062420332949",
      "thread_id": "1860601283570180440",
      "content": "it has to be a choice where trade-offs aren't even calculated consciously. a good test: when you mention what you're doing to someone, they're taken aback like, \"bro, are you fucking kidding me?!\"\n\nthis is table stakes. there are many higher levels, for sure. but this is the lowest bar to meet before i start taking someone's autism seriously.\n\nsuch events should be normal and frequent in your life if you claim you're on the spectrum."
    },
    {
      "id": "1860603805039227236",
      "thread_id": "1860601099285131361",
      "content": "oh, i can relate. did a similar thing back in engineering college.\n\ni got 6/6 backlogs in my very first semester. just decided i didn't want to study.\n\nit's the CS paper, and i'm sitting there scribbling doodles on my answer sheet. supervisor notices me for a while and then comes and sits right next to me. asks me if everything's okay.\n\n\"yeah, i just didn't study so i have nothing to write\"\n\nscored a 0 in one paper and <20 in a few others.\n\nfelt like leaving home and just bunking the exams, but then figured sitting in an exam hall without studying would be more fun"
    },
    {
      "id": "1860594799109374458",
      "thread_id": "1860594723402248319",
      "content": "@Bhoomika_v2000 or autistic"
    },
    {
      "id": "1860594723402248319",
      "thread_id": "1860593849917407576",
      "content": "@Bhoomika_v2000 i empathise with you and also understand that it's natural human tendency to overinflate the gravity of such events when it happens to them, but do not take the bait. this is not at all unusual."
    },
    {
      "id": "1860590048074518989",
      "thread_id": "1860589333620597227",
      "content": "@JustAnkurBagchi i don't think this is autistic behavior, it's pretty normal\n\nshowing up unkempt at a wedding is a very low on the autistic rung, and even lower if it's calculated"
    },
    {
      "id": "1860588951951802533",
      "thread_id": "1860587797998108865",
      "content": "@kunalb11 claude has both loving mommy and tiger mommy energy, depending on how unsafe your views are. maybe it's more a reflection of my interactions with her than anything else\n\nmaybe i need a hot, high iq mommy"
    },
    {
      "id": "1860588000553632250",
      "thread_id": "1860587443734598029",
      "content": "i bet most calling themselves autists have nothing to show here.\n\nall liars and larpers."
    },
    {
      "id": "1860587443734598029",
      "thread_id": "1860587443734598029",
      "content": "so, you're an autist? tell me the latest antisocial stupidity you pulled off in the real world, while being absolutely nonchalant about it"
    },
    {
      "id": "1860577310765907982",
      "thread_id": "1860577310765907982",
      "content": "many such cases"
    },
    {
      "id": "1860334046452109607",
      "thread_id": "1860334046452109607",
      "content": "https://t.co/Oejlh8NFjZ"
    },
    {
      "id": "1860324755871539702",
      "thread_id": "1860324755871539702",
      "content": "https://t.co/DJFb4DxjwD"
    },
    {
      "id": "1860290080377540840",
      "thread_id": "1860290080377540840",
      "content": "the beautiful bit about agency is that it can be microdosed towards having more and more of it."
    },
    {
      "id": "1860278355221676537",
      "thread_id": "1860278355221676537",
      "content": "https://t.co/zBRgYeOtRA"
    },
    {
      "id": "1860158736926671118",
      "thread_id": "1860157796454703354",
      "content": "@mookimmegha wim hof breathing + coffee + thiamine (B1)"
    },
    {
      "id": "1860150343562383728",
      "thread_id": "1860150343562383728",
      "content": "https://t.co/tI2FO4SmBS"
    },
    {
      "id": "1859948854453690431",
      "thread_id": "1859948854453690431",
      "content": "https://t.co/1FzrzPGbHv"
    },
    {
      "id": "1859898783183831193",
      "thread_id": "1859897155802247225",
      "content": "@prvkhvr ehh, not really"
    },
    {
      "id": "1859626405736165673",
      "thread_id": "1859621403722707340",
      "content": "@Niharika__rao niharika asking the real questions"
    },
    {
      "id": "1859626305769099731",
      "thread_id": "1859626305769099731",
      "content": "♥️ https://t.co/idb3evOWp4"
    },
    {
      "id": "1859607542843703521",
      "thread_id": "1859606640133275861",
      "content": "@cto_junior he barbelled it, and focused on going all in on what would generate the most buzz. zero additional operational overhead.\n\nin any case, i refused to comment on it even yesterday because i can't imagine thinking that i have more context around the jtbd than goyal saab himself."
    },
    {
      "id": "1859606373262143822",
      "thread_id": "1859603770168180773",
      "content": "this is not a great solution either. no one has the context around the business like zomato's team does, internally. so this selects for ppt-pros and larpers who are good at talking and making wild assumptions — essentially the mba archetype.\n\nmost submissions will be filled with chatgpt-slop, and the rest will make such harebrained assumptions under limited data, you'll want to kys."
    },
    {
      "id": "1859601595060908073",
      "thread_id": "1859583969999847503",
      "content": "@visakanv yea, been seeking this functionality for a couple of years now, combined with smarter search that searches based on associations, not just unintelligent text-matching"
    },
    {
      "id": "1859542359706394721",
      "thread_id": "1859541864728187191",
      "content": "@JustAnkurBagchi yeah, be on that sheepdog grindset"
    },
    {
      "id": "1859541541234082258",
      "thread_id": "1859537157041320274",
      "content": "@JustAnkurBagchi you can just do things and exhibit high agency behaviour 🤷🏻‍♂️"
    },
    {
      "id": "1859520547262255458",
      "thread_id": "1859520547262255458",
      "content": "my tweets are thoughts, not recommendations.\n\ndo not come at me with your \"this is not good for society\" concepts, i'm only speaking my mind, not doing social service outchea or asking people to be like me.\n\nwhen in doubt, look at my profile name, and chill tf out.\n\nif my phrasing sounds like prescriptive advice, which it can, know that it's just how i write sometimes and i have no intention of helping anyone.\n\nit's just words. if you find them useful, great. if you don't find them useful, also great. i'm not writing for you, bro."
    },
    {
      "id": "1859517657470599676",
      "thread_id": "1859517657470599676",
      "content": "if you never lose an opportunity to throw shade/snark on others, do not be surprised when you're at the receiving end, which you will be one day."
    },
    {
      "id": "1859504280878670315",
      "thread_id": "1859502488120066211",
      "content": "@velocitycake just like i said, you're not even good at trolling well. bye."
    },
    {
      "id": "1859500003670249883",
      "thread_id": "1859497956115964216",
      "content": "i know you like hating on me and never have anything good to say. but let me tell you that i'm not a keith rabois pretending to be a market expert and chief contrarian. i simply write what i think. \n\nyou have no obligation to read what i write. you can mute and move on. so do take your entitlement elsewhere.\n\nbut i'm afraid you're just a clown who is not even good at trolling well."
    },
    {
      "id": "1859448283527360991",
      "thread_id": "1859448283527360991",
      "content": "\"My motto has always been: Debate the audience, not the person. Don't even try to convince someone that he or she is wrong\"\n\ni'd extend this to —\n\n\"don't even debate the audience. don't debate anyone. write/say what you think and fuck off.\" \n\nyou write and influence the best when you don't care what others think. not that you should do it to write well or influence others. but it just so happens to be the case when you do not care.\n\nfor example, a few kids in my family are completely enamoured by me because i speak what i think, and they find it refreshing. \n\nif i \"cared\" about them, i'd be no different from other members in the family who were hellbent on persuading and convincing those kids about their way of life.\n\ni don't care about you, kid. do whatever. in any case, those 30 minutes of interaction in a year won't magically wipe away all the conditioning you're subjected to 24x7 for the rest of the year."
    },
    {
      "id": "1859437791148449998",
      "thread_id": "1859436874726523202",
      "content": "@griefenjooyer @JustAnkurBagchi thank you for your opinion."
    },
    {
      "id": "1859285251161276701",
      "thread_id": "1859283912125534438",
      "content": "@JustAnkurBagchi raw causal understanding is always strictly contextual. and the context houses both subject and object, observer and the observed.\n\nso it can never be fixed, because the subject is always a living entity, and so is her environment."
    },
    {
      "id": "1859283912125534438",
      "thread_id": "1859283665064186050",
      "content": "@JustAnkurBagchi truth isn't a concept or a fixed entity. it is raw understanding, before it gets muddied by abstractions."
    },
    {
      "id": "1859283665064186050",
      "thread_id": "1859283023734395164",
      "content": "@JustAnkurBagchi understanding comes before reason/abstract conception. read schopenhauer."
    },
    {
      "id": "1859283301292241236",
      "thread_id": "1859273788288016796",
      "content": "if you want to make people learn your language, or learn anything you do, be someone they'd want to emulate and mingle with. today, probably more non-native people learn german, french, and japanese than they learn kannada. because those countries and cultures give them an incentive to do so.\n\ni've heard many good things about kannada language and literature. that's a strong-ish incentive for me.\n\nyet most will shame you into learning the language, instead of woo you into learning it."
    },
    {
      "id": "1859281090839707705",
      "thread_id": "1859280131761766848",
      "content": "@JustAnkurBagchi truth is that which keeps breaking cherished aesthetics over and over again. it is never contradictory, yet appears full of contradictions when only grokked conceptually/logically from an outside pov."
    },
    {
      "id": "1859280131761766848",
      "thread_id": "1859278075260719556",
      "content": "@JustAnkurBagchi everything is an aesthetic, recursively speaking. and that is a very trivial argument.\n\ntruth doesn't lend itself to language and logic, so readers can always make this argument. there's no way to defend it in the realm of language and logic, nor do i care much about it.\n\niykyk."
    },
    {
      "id": "1859279358005022854",
      "thread_id": "1859279175531545085",
      "content": "@JustAnkurBagchi https://t.co/yk4Vo7EyfQ"
    },
    {
      "id": "1859279241919201574",
      "thread_id": "1859278844928356455",
      "content": "@JustAnkurBagchi if i touch a hot stove, i instinctually pull away. but i do not go around wearing and piling on armor, just so that one day i'll be able to protect myself from burning."
    },
    {
      "id": "1859278844928356455",
      "thread_id": "1859277384563982359",
      "content": "\"instincts\" arise naturally, only when the situation presents itself, never before. and the human cannot absolve himself of it, because it's the natural intelligence of the organism operating.\n\neverything that precedes that is a conceptual myth your fearful self creates, snowballing unto itself, and turning the imagined calamity into a certain eventuality.\n\nyou reap what you sow."
    },
    {
      "id": "1859275837415227599",
      "thread_id": "1859274013085773952",
      "content": "i have moved on from a tribal world that can only anchor in images of war and death in order to establish its utility. peaceful civil society has no need for any man to be laying down his life for me, and that too due to some trivial tribal differences.\n\nit is one thing to defend yourself when attacked, totally another to be all gung-ho about war and conflict to assert your identity and to constantly strengthen it in expectation of war.\n\nwhat a ridiculous existence."
    },
    {
      "id": "1859273788288016796",
      "thread_id": "1859273788288016796",
      "content": "the harsh truth about people immigrating to blr and not learning kannada:\n\nthey have no real incentive to. the people they're making money with — all converse in english.\n\nif you're interested in kannada literature, that might be a good incentive to learn kannada. if you're visiting places in blr outside of the holy trifecta (kora-hsr-indiranagar), and wish to interact with the people there, that might be a good incentive to learn kannada. if you wish to get laid with a native baddie, that might be a good incentive to learn kannada.\n\nshame and \"ought\", however, will never be great incentives for anything, though. you only alienate people with your moral righteousness and hostility."
    },
    {
      "id": "1859271729866211423",
      "thread_id": "1859271729866211423",
      "content": "truth over aesthetic.\ntruth over morality.\ntruth over friendship.\ntruth over shame.\n\ntruth over everything and everything in service of truth."
    },
    {
      "id": "1859269579437994403",
      "thread_id": "1859269579437994403",
      "content": "one truth about me that most people i admire do not subscribe to is that never once in my life have i felt any \"rootedness\" or \"connection to the motherland\" or any such romantic notion.\n\ni'm grateful for whatever i got from the place and environment i was raised in, but i think that would've probably been the case had i been brought up in most other parts of the world. you only need basic human decency and a stable social morality to raise a child.\n\ni don't have any roots or take any pride in my ancestry or want to preserve or pass on anything.\n\ni'm a born nomad. i have no roots. i have no home.\n\nall i want from this world is money to keep going. everything else is between me and god."
    },
    {
      "id": "1859264864067465579",
      "thread_id": "1859264030604656795",
      "content": "if my priority is material success, i'd rather prioritise english than learning five different languages i'll rarely use. it all depends on what the individual wants.\n\ni can read and speak gujarati, hindi, marathi, english, and even read arabic, but only one of them pays my bills and proves useful in my life."
    },
    {
      "id": "1859264030604656795",
      "thread_id": "1859262026088128762",
      "content": "i think everyone is smart enough to work according to their context. if someone doesn't find benefit in learning a language, they may not and it's entirely within their right to do so. i do not subscribe to the idea that you should learn the local language because not doing so would make you a \"bad\" citizen. i do not think it is odd at all."
    },
    {
      "id": "1859258447046303892",
      "thread_id": "1859258447046303892",
      "content": "the professional world is kinder to people raised up speaking english in affluent households, and no one understands this better than indian parents who talk to their kids in english and not in their mother tongue.\n\nin general, many such desi rich parent behaviors that are mocked online are actually good, because no one understands these risks like indian parents do.\n\nand the ones mocking are usually the biggest hypocrites who were themselves born with silver spoons in a well-read family."
    },
    {
      "id": "1859150177619050758",
      "thread_id": "1859146684506534198",
      "content": "@JustAnkurBagchi arey wife/gf ke saath chalta hai"
    },
    {
      "id": "1859146410077417732",
      "thread_id": "1859143635318800420",
      "content": "@JustAnkurBagchi one big advantage of living alone is i can go commando 24x7, all seasons"
    },
    {
      "id": "1859141349641253225",
      "thread_id": "1859138959038713925",
      "content": "@_svs_ related but adding on to what you said\nhttps://t.co/pSftzwlR5y"
    },
    {
      "id": "1858927448936902900",
      "thread_id": "1858927046761869667",
      "content": "doesn't matter if you earn in dollars, you will still have to spend big to get below-average services as long as you live here."
    },
    {
      "id": "1858927046761869667",
      "thread_id": "1858925815947555077",
      "content": "tourism is a top-of-mind example but there are others like real estate, education, healthcare, anything requiring govt support and big infra"
    },
    {
      "id": "1858925815947555077",
      "thread_id": "1858925815947555077",
      "content": "everything in india is going to get a lot more expensive very fast. the value/price ratio will hit an all time low.\n\nbaumol's cost disease coming hard and fast for economies that reject progress due to various vested interests/ethics/culture/philosophy, etc."
    },
    {
      "id": "1858881876766625861",
      "thread_id": "1858881377216692597",
      "content": "even health is a matter of psychology first, before everything. when the psyche is conditioned to believe age imposes innumerable constraints on everything, those constraints become self-fulfilling."
    },
    {
      "id": "1858881377216692597",
      "thread_id": "1858880595016786048",
      "content": "literal mental handicap that you can feel palpably when you try to talk to them about anything even slightly skewed from centre.\n\nadd loads of romanticisation and rotlu pseudo-philosophies to mask away the ignorance."
    },
    {
      "id": "1858880595016786048",
      "thread_id": "1858880595016786048",
      "content": "indians are debilitated by their social conditioning more than anything. have observed this very closely."
    },
    {
      "id": "1858878343262699865",
      "thread_id": "1858878343262699865",
      "content": "ye kya chal raha hai bhai"
    },
    {
      "id": "1858836129296089192",
      "thread_id": "1858836129296089192",
      "content": "no one wants to know. ignorance is bliss."
    },
    {
      "id": "1858812034600890576",
      "thread_id": "1858812034600890576",
      "content": "but the people are afraid, and frictionful security beats frictionless trust in our society."
    },
    {
      "id": "1858798189727330521",
      "thread_id": "1858798189727330521",
      "content": "incredible banger"
    },
    {
      "id": "1858789135428747599",
      "thread_id": "1858787065892098108",
      "content": "@mryalamanchi @ponnappa @shrihacker at the risk of stating the obvious, more time in the game is usually better. but contrary to your point, tech is actually conducive to starting whenever, because it keeps changing so quickly. it's \"always day one\" for everyone."
    },
    {
      "id": "1858786488961441805",
      "thread_id": "1858786488961441805",
      "content": "the best thing you can watch today to understand this is \"The Man Who Planted Trees\" on youtube. you'll come to appreciate both the physical and spiritual gravity of conquering nature with this short story."
    },
    {
      "id": "1858780092018938030",
      "thread_id": "1858780092018938030",
      "content": "the only thing you can consciously work towards, at least in a financial and psychological sense, is to be available for the inspiration/opportunity when it presents itself and not be too bogged down by attachments and responsibilities.\n\nin that sense, your 20s are typically when you have all of your freedoms available to you. having said that, inspiration can dawn at any time and is not beholden to manmade constructs like age and notions of what you should be doing at any age."
    },
    {
      "id": "1858777927745143194",
      "thread_id": "1858775918829072808",
      "content": "@mryalamanchi @ponnappa @shrihacker yeah. everyone blossoms at different times. there's no fixed decade or timeframe for it within which if you don't make it, you're finished and it's all over for you"
    },
    {
      "id": "1858758514652705205",
      "thread_id": "1858749919240085672",
      "content": "you're right, it is not. the memeplex is totally skewed in the other direction currently as a reflexive impulse to liberal values. it's difficult for men, and it is doubly difficult for women to go against the grain. being unmarried is associated with negative traits, undesirability, etc."
    },
    {
      "id": "1858734812041015418",
      "thread_id": "1858733724344742168",
      "content": "genuine respect can only exist between peers. i can say i \"respect\" someone great, but the fact is  my respect actually means nothing. the word is stripped away of all its essence. i have no understanding of what they do, so what am i even respecting? there's no relationship between me and them."
    },
    {
      "id": "1858733724344742168",
      "thread_id": "1858733724344742168",
      "content": "\"nature is not something to be conquered; it is something to be respected.\"\n\nbut conquering nature is how you come to respect it fully!\n\nonly the one who has summitted a mountain can truly see the mountain for what it is. and fighters develop true appreciation for each other  only after the fight ends.\n\nbecause you can't conquer something you do not understand or respect."
    },
    {
      "id": "1858549126797185344",
      "thread_id": "1858547702449217700",
      "content": "@green4ranger what"
    },
    {
      "id": "1858542796174426489",
      "thread_id": "1858541205577248858",
      "content": "@green4ranger you're the green ranger with ganja in your name, you tell me"
    },
    {
      "id": "1858532423488692598",
      "thread_id": "1858532423488692598",
      "content": "another goody two shoes ruining a good thing for content"
    },
    {
      "id": "1858522179056341388",
      "thread_id": "1858522179056341388",
      "content": "cats won't stay a second longer in a place they don't like. absolutely uncompromising creatures. https://t.co/FcPqPE210o"
    },
    {
      "id": "1858444559966990566",
      "thread_id": "1858443756699042272",
      "content": "jaldi jaldi meri photo kheech bhai, abhi paanch minute mein panvel nikalna hai"
    },
    {
      "id": "1858444360276169175",
      "thread_id": "1858444360276169175",
      "content": "till transformation remains a choice, you will not choose it."
    },
    {
      "id": "1858443756699042272",
      "thread_id": "1858443756699042272",
      "content": "the tourists are always in such a hurry"
    },
    {
      "id": "1858437379192689118",
      "thread_id": "1858437379192689118",
      "content": "the entire business of motivation and prescriptions would end if we realised that the essential is not really a choice. only the trivial is.\n\nsincere impulses induct you into fulfilling them without your permission. and what seeks your permission is never that important in hindsight."
    },
    {
      "id": "1858435026884375024",
      "thread_id": "1858435026884375024",
      "content": "a terribly refined aesthetic sensibility is its own reward and prison."
    },
    {
      "id": "1858433047428735479",
      "thread_id": "1858433047428735479",
      "content": "the goal of life is to be a cat:\n\naccountable to no one, yet loved by everyone.\n\nmost love the zero accountability bit, but never arrive at the latter."
    },
    {
      "id": "1858161474121937380",
      "thread_id": "1858159427653943533",
      "content": "hypothesis:\n\nclub = one's own nature + nurture (context/environment)\nfire = attention/self-awareness\nhydra's own blood = ego turning onto itself, leading to paradox and dissolution\nathena's golden sword = divine grace/anugraha https://t.co/YcvxKIXQjH"
    },
    {
      "id": "1858159427653943533",
      "thread_id": "1858159427653943533",
      "content": "\"n\" sins = \"n\" heads of the hydra (ego) https://t.co/I1k7I8JyAs"
    },
    {
      "id": "1858145587863892352",
      "thread_id": "1858145109092532295",
      "content": "JUSSS BECOZZZ\nJUSSSSS BECOZZZZZ"
    },
    {
      "id": "1858145109092532295",
      "thread_id": "1858145109092532295",
      "content": "1. there's no need to fix anyone\n\n2. please don't run towards anyone just because they've read some books"
    },
    {
      "id": "1858128781413933356",
      "thread_id": "1858124400869921000",
      "content": "@dejavucoder what's her @"
    },
    {
      "id": "1858116525871305166",
      "thread_id": "1858114196879135099",
      "content": "@OtakuProcess best gaalis too ig"
    },
    {
      "id": "1858101788299161891",
      "thread_id": "1858101788299161891",
      "content": "same same but different,\nno money, no honey.\n\ngood boy goes to heaven,\nbad boy goes to bangkok."
    },
    {
      "id": "1858083901878522316",
      "thread_id": "1858083901878522316",
      "content": "you're not allowed to have an opinion till you have kids. and once you have kids, saying otherwise would be too terrible. might as well learn how to treat it positively.\n\nso it remains a lovely pyramid scheme with no one who can call it out as one."
    },
    {
      "id": "1858064646919409865",
      "thread_id": "1858059594490327265",
      "content": "@Steve_Sule 🤣🤣🤣"
    },
    {
      "id": "1858058770712240626",
      "thread_id": "1858058770712240626",
      "content": "i don't understand how people can talk about osho, awareness, and enlightenment in one breath and perils of meditation in another\n\nboggles the solar plexus"
    },
    {
      "id": "1858057257038262561",
      "thread_id": "1858056548892946829",
      "content": "\"ramanujan was based for dreaming up math tho\"\n\n— a summary of technophilic discourse on perils of meditation"
    },
    {
      "id": "1858056548892946829",
      "thread_id": "1858055473930580358",
      "content": "\"j krishnamurti was a glorified wordcel\"\n\n— a summary of  based and ambition-pilled discourse on perils of meditation"
    },
    {
      "id": "1858055473930580358",
      "thread_id": "1858055473930580358",
      "content": "\"ramana maharshi was a lazy, good-for-nothing bum\"\n\n— a summary of the kindergarten-level western discourse on perils of meditation"
    },
    {
      "id": "1857812333449588736",
      "thread_id": "1857809837356363857",
      "content": "\"why do anything?\"\n\n\"okay, don't do anything.\"\n\n\"but i can't, i have mouths to feed, bills to pay, and movies to re-enact\"\n\n\"then how is everything meaningless?\"\n\n\"...\""
    },
    {
      "id": "1857809837356363857",
      "thread_id": "1857809837356363857",
      "content": "\"if everything is meaningless, why do anything?\" is often not a question but a dismissive retort from people who haven't really understood the essence of meaninglessness.\n\nthe question \"why do anything?\" only arises on the level of the concept. it can never arise on the level of awareness, because anyone even remotely self-aware knows the sheer impossibility of not doing anything.\n\nthe essence of meaninglessness lies in discovering it for yourself; incessantly chopping away everything that is realised as meaningless, till you're left with total absorption in the present. \n\nto think about it as an intellectual concept and then ask \"why do anything?\" only betrays cluelessness."
    },
    {
      "id": "1857783165194268716",
      "thread_id": "1857783165194268716",
      "content": "\"Man is a rope stretched between the animal and the Superman — a rope over an abyss.\n\nA dangerous crossing, a dangerous wayfaring, a dangerous looking-back, a dangerous trembling and halting.\n\nWhat is great in man is that he is a bridge and not a goal: what is lovable in man is that he is an OVER-GOING and a DOWN-GOING.\n\nI love those that know not how to live except as down-goers, for they are the over-goers.\n\nI love the great despisers, because they are the great adorers, and arrows of longing for the other shore.\n\nI love those who do not first seek a reason beyond the stars for going down and being sacrifices, but sacrifice themselves to the earth, that the earth of the Superman may hereafter arrive.\n\nI love him who lives in order to know, and seeks to know in order that the Superman may hereafter live. Thus seeks he his own down-going.\n\nI love him who labors and invents, that he may build the house for the Superman, and prepare for him earth, animal, and plant: for thus seeks he his own down-going.\n\nI love him who loves his virtue: for virtue is the will to down-going, and an arrow of longing.\n\nI love him who reserves no share of spirit for himself, but wants to be wholly the spirit of his virtue: thus walks he as spirit over the bridge.\n\nI love him who makes his virtue his inclination and destiny: thus, for the sake of his virtue, he is willing to live on, or live no more.\n\nI love him who desires not too many virtues. One virtue is more of a virtue than two, because it is more of a knot for one's destiny to cling to.\n\nI love him whose soul is lavish, who wants no thanks and does not give back: for he always bestows, and desires not to keep for himself.\n\nI love him who is ashamed when the dice fall in his favor, and who then asks: \"Am I a dishonest player?\" — for he is willing to succumb.\n\nI love him who scatters golden words in advance of his deeds, and always does more than he promises: for he seeks his own down-going.\n\nI love him who justifies the future ones, and redeems the past ones: for he is willing to succumb through the present ones.\n\nI love him who chastens his God, because he loves his God: for he must succumb through the wrath of his God.\n\nI love him whose soul is deep even in the wounding, and may succumb through a small matter: thus goes he willingly over the bridge.\n\nI love him whose soul is so overfull that he forgets himself, and all things that are in him: thus all things become his down-going.\n\nI love him who is of a free spirit and a free heart: thus is his head only the bowels of his heart; his heart, however, causes his down-going.\n\nI love all who are like heavy drops falling one by one out of the dark cloud that lowers over man: they herald the coming of the lightning, and succumb as heralds.\n\nLo, I am a herald of the lightning, and a heavy drop out of the cloud: the lightning, however, is the SUPERMAN.\""
    },
    {
      "id": "1857689689542537374",
      "thread_id": "1857689689542537374",
      "content": "always appreciate a beautiful tree https://t.co/iqgG2Tt9f3"
    },
    {
      "id": "1857487933655363638",
      "thread_id": "1857487933655363638",
      "content": "memorychads will never understand what it means to be me, the forgormaster"
    },
    {
      "id": "1857477129996558476",
      "thread_id": "1857477129996558476",
      "content": "bruh 💀"
    },
    {
      "id": "1857418895373561974",
      "thread_id": "1857418895373561974",
      "content": "https://t.co/out1EG65ED"
    },
    {
      "id": "1857129759794442645",
      "thread_id": "1857129759794442645",
      "content": "making (as-seen-in) movies would be more apt"
    },
    {
      "id": "1857122640424562937",
      "thread_id": "1857122640424562937",
      "content": "there are no brownie points for suffering."
    },
    {
      "id": "1857122134054580433",
      "thread_id": "1857083794928316924",
      "content": "@Niharika__rao https://t.co/8i4Z1ViKo1"
    },
    {
      "id": "1857120946131537995",
      "thread_id": "1857120946131537995",
      "content": "https://t.co/smj5bPAr04"
    },
    {
      "id": "1857070235825631393",
      "thread_id": "1857011386800304517",
      "content": "@rizzler0501 i feel good when things work and don't feel good when they don't.\n\nno point feeling good or bad about the facts themselves, which are merely utilitarian.\n\nfacts are useful if they make life better and useless if they don't."
    },
    {
      "id": "1857068898606092743",
      "thread_id": "1857068898606092743",
      "content": "the full circle from notes app to notion to notes app is an important journey with lots of wisdom accrued on the way.\n\nsome fundamental paradigms like bullet lists and excel sheets are timeless and eternally enduring."
    },
    {
      "id": "1856976462395707771",
      "thread_id": "1856976462395707771",
      "content": "i notice i'm able to say things about myself that most people wouldn't say.\n\nsometimes people can't help but laugh when i do this. not because i'm trying to be funny, but because it catches them off guard. they're used to everyone trying to look good all the time. \n\nwhen i just state things as they are, it creates this weird comedic relief for them.\n\nperhaps because it subverts the social expectation that people will always try to present themselves favorably. it breaks the usual social contract of maintaining face, but does it with such matter-of-fact clarity that it becomes almost liberating rather than depressing. \n\nbut i think this is core to truth-seeking. to be able to live with facts without needing them to be good or bad. \n\nif you judge too quickly, you'll just make up stories to hide from what's actually true.\n\nyou have to be able to just sit with facts, to look at them directly without needing to feel better or worse about them. most people can't do this. they're too busy trying to feel good about themselves."
    },
    {
      "id": "1856742929693331484",
      "thread_id": "1856742670263005595",
      "content": "@recurshawn https://t.co/PtfjrJiKZO"
    },
    {
      "id": "1856740817496371594",
      "thread_id": "1856740817496371594",
      "content": "every month, my iq drops by a couple of points at least"
    },
    {
      "id": "1856592462996983853",
      "thread_id": "1856592462996983853",
      "content": "til vibhishana is a chiranjivi"
    },
    {
      "id": "1856591644025598309",
      "thread_id": "1856590459206074421",
      "content": "@rakwtf @tszzl sorry, i have confused ramayana with this"
    },
    {
      "id": "1856590459206074421",
      "thread_id": "1856589627500396929",
      "content": "@rakwtf @tszzl yes."
    },
    {
      "id": "1856589074028695862",
      "thread_id": "1856587381077606438",
      "content": "@tszzl it was vibhishan."
    },
    {
      "id": "1856579782797824022",
      "thread_id": "1856579782797824022",
      "content": "https://t.co/QJjP78Sp2t"
    },
    {
      "id": "1856550861260099759",
      "thread_id": "1856550861260099759",
      "content": "truly one of a kind with no equal. his arcane and mystical writing is littered with moments of revelation. and when you realize what he's hinting at, a chill runs through your spine, no less.\n\nno author has had this effect on me. only master borges."
    },
    {
      "id": "1856383471649993212",
      "thread_id": "1856383471649993212",
      "content": "just a reminder."
    },
    {
      "id": "1856379725280870558",
      "thread_id": "1856379725280870558",
      "content": "made me realize something interesting:\n\nthe god of the bible is all masculine for the large part, so he has to be necessarily interfering in wordly affairs and dishing out punishments. because there's no concept of the feminine in their theology, unlike hinduism, which has brahman, the overarching masculine, silent, and indifferent principle, and shakti, which is its manifestation.\n\nbrahman can be indifferent but shakti never is, because it is what you're made of. so while the book of job has god himself raining down suffering on job, it's actually shakti — nature — that dishes out suffering the more you try to transcend it."
    },
    {
      "id": "1856375782643511789",
      "thread_id": "1856375498722685092",
      "content": "@Muralidha07 bank statement hi maang le na bhai"
    },
    {
      "id": "1856375611872424413",
      "thread_id": "1856375093665882277",
      "content": "@nadininv rarely. i set up my hall thinking i would, but i don't. so it's all useless for most of the year, till i have a friend staying with me for a few days."
    },
    {
      "id": "1856374758419661268",
      "thread_id": "1856374758419661268",
      "content": "for the past 3 years, I've lived in a 2BHK and only ever used one 150 sq. ft. room. so that's actually all i need. have started using the other room only recently, and that too out of boredom, more than anything else."
    },
    {
      "id": "1856368182925373876",
      "thread_id": "1856367670951850109",
      "content": "the book of job in the old testament is a great allegory that points to the suffering that befalls the most sincere and devout men.\n\nno master truly ever \"recommends\" the path or exhorts you to chase it. because they know it's not something they can help you with. \n\nit is a non-decision a few clowns are just inducted into without their permission. and there's no way out of that path once you're on it.\n\nchoice didn't get you into it, so choice won't get you out of it."
    },
    {
      "id": "1856367670951850109",
      "thread_id": "1856367670951850109",
      "content": "the final boss here is mother nature. she's the deceptive, devouring mother. there are no limits to what she will give you once you want something genuinely. In that way, she's the kindest and most generous.\n\nbut this is how she keeps you trapped in the world of things. this is the great deception. try to escape her clutches, and you will most certainly befall a whole host of calamities and suffering, which you alone will have to bear. society will attribute your suffering to your own moral failings. they will not help; they will only condemn and label you. worse — they'll try to save you."
    },
    {
      "id": "1856362317614621017",
      "thread_id": "1856358293922308375",
      "content": "a year ago, i thought it was 5 cr. don't need much from life, right?\n\nbut now i think even that would be too less. and that's the point. there is no cap to how much money will make you feel secure, because even though money is a big part of security, it is insufficient. the very nature of the mind is insecurity.\n\nand i now recall something i had tweeted a few years ago, which was as obvious to me then as it is now:\n\nthe kind of person you need to become to earn a billion dollars is the same kind of person who won't be able to enjoy that billion dollars.\n\nand i don't mean frivolous enjoyment. i mean the kind of joy that makes you stop and say i'm done, i need nothing more, i can die this moment and it would be alright. and you don't feel this just for a moment when you're high, but all the time.\n\nthat is real, lasting joy. and it may or may not come with money, although money is often crucial to getting there."
    },
    {
      "id": "1856359730215624934",
      "thread_id": "1856359730215624934",
      "content": "you don't need to live for centuries or even read loads of history to internalise this.\n\neven observing yourself during and after a hard day of work will sometimes reveal this to you.\n\n- uncomfortable task pushes you to work hard\n- working improves skill and produces a good result\n- good result makes you happy so you drink and binge\n- drinking and binging makes you weak the next day"
    },
    {
      "id": "1856283804484133082",
      "thread_id": "1856281938547339337",
      "content": "@_svs_ no, i'm not saying that. money is a necessary but not sufficient condition. lots of people with tonnes of money, but never truly internalise this"
    },
    {
      "id": "1856283333983891897",
      "thread_id": "1856283333983891897",
      "content": "\"because i want to do it\" is the most natural and obvious reason to do something but it will never be the \"great\" reason to do something.\n\ngreatness is supposed to lie beyond yourself. and \"beyond yourself\" usually means \"in society\"\n\nfor me to be \"great\", you have to be a \"normie\".\n\nfor my work to be \"great\", it has to help \"others\".\n\nfor my story to be \"great\", it has to be applauded by an audience.\n\nbut the playground, the game, and the reward — all 3 are still sponsored by society.\n\nso you were never playing the game; you were merely used by it."
    },
    {
      "id": "1856276058875609118",
      "thread_id": "1856275636714639393",
      "content": "expecting everyone to like you is like trying to control nature. easier to do it by contorting yourself to known shapes and fitting in.\n\nbut it is much better to give up trying to control what others think."
    },
    {
      "id": "1856275636714639393",
      "thread_id": "1856274222877716756",
      "content": "when people do not understand, they're quick to label. quick to mock.\n\nsee it as their state and nature, nothing more.\n\nit has nothing to do with you. only what you feel and do has to do with you."
    },
    {
      "id": "1856274222877716756",
      "thread_id": "1856272079542198722",
      "content": "the greatness of the work lies in its source, not in its story. the story is for society. and till you're invested in society, everything will be a comparison and a competition."
    },
    {
      "id": "1856272079542198722",
      "thread_id": "1856271629908631730",
      "content": "do everything with a light touch. leave no footprints. when the work is done, forget it."
    },
    {
      "id": "1856271629908631730",
      "thread_id": "1856271429030838781",
      "content": "it is completely possible to do the bit without convincing yourself of the greatness of the bit. it is possible to do the best of work without telling yourself grandiose stories about it. it is possible to continue living the way you think is right for you, no matter the opposition, if you don't frame your narrative in opposition to the status quo."
    },
    {
      "id": "1856271429030838781",
      "thread_id": "1856270135360671769",
      "content": "i know this sentiment is borne out of being mocked/treated unfairly. but if you didn't think too highly of yourself, the mocking wouldn't register as much."
    },
    {
      "id": "1856270135360671769",
      "thread_id": "1856270135360671769",
      "content": "i used to be like this. vindictive. do not live like this. it's not a good life awaiting the downfall of others. waiting to say \"i told you so.\" waiting to be proven right via others' loss. it's much better to remove such comparative thinking from your worldview entirely and just focus on your own state. if you're a loser and someone you've always hated has a downfall, now there are two losers. nothing changes. you and your identity are still a slave to others and their outcomes."
    },
    {
      "id": "1856240052717924816",
      "thread_id": "1856238428255596712",
      "content": "some high-profile account on twitter says something and the next day you see people wielding it like it was their own.\n\nthe need to appear intellectual is what stops the intellect from developing"
    },
    {
      "id": "1856238428255596712",
      "thread_id": "1856237361967120653",
      "content": "i avoid the maal-bechu type"
    },
    {
      "id": "1856237361967120653",
      "thread_id": "1856237361967120653",
      "content": "always be extremely wary of people who are quick to adopt the latest verbiage of the memeplex they inhabit.\n\nthey're often salespersons, and nothing more."
    },
    {
      "id": "1856233513189814403",
      "thread_id": "1856232656532582803",
      "content": "show me your bank statements and your illiquid assets. and then we'll talk.\n\neasy to say this when you're sitting on a cushion of wealth. you see flow on the surface, but there's lots of stability underneath."
    },
    {
      "id": "1856232656532582803",
      "thread_id": "1856232656532582803",
      "content": "this realisation doesn't occur on the level of money.\n\nso as long as you're thinking about chasing security, you can't and won't think about money like this, no matter how cool it sounds.\n\na lot of other stuff about you has to change for this to be true. simply reading this doesn't change a thing. it's just a nice concept."
    },
    {
      "id": "1856179031462260994",
      "thread_id": "1856176194565116238",
      "content": "as a capitalist, it's in my best interest to promote left wing values"
    },
    {
      "id": "1856176194565116238",
      "thread_id": "1856170005672472921",
      "content": "economically right + culturally left"
    },
    {
      "id": "1856170005672472921",
      "thread_id": "1856170005672472921",
      "content": "capitalism is right wing but consumerism is left wing."
    },
    {
      "id": "1855844823028130287",
      "thread_id": "1855844823028130287",
      "content": "putting the din in linkedin"
    },
    {
      "id": "1855839853868380181",
      "thread_id": "1855839268033200234",
      "content": "will be centi soon, only $100 million to go 🚀🚀🚀"
    },
    {
      "id": "1855839268033200234",
      "thread_id": "1855839268033200234",
      "content": "so true"
    },
    {
      "id": "1855657113671897257",
      "thread_id": "1855657113671897257",
      "content": "right wing accounts that make a personality out of quote tweeting harebrained takes from the opposition and lecturing them are an articulate but ultimately tedious bunch.\n\nsuch exposition is great if done once in a while, and only for actually complex topics that might benefit from an advanced understanding.\n\nbut do it for every egregious take by the most retarded of your opponents and you turn into a dull political account beating a dead horse: the same tirade over and over again.\n\nyour best followers mute or unfollow you after a while.\n\nmany such cases."
    },
    {
      "id": "1855586870136054239",
      "thread_id": "1855579958921277623",
      "content": "same challenge in converting sanghis to libs"
    },
    {
      "id": "1855579958921277623",
      "thread_id": "1855579958921277623",
      "content": "difficulty getting a girlfriend."
    },
    {
      "id": "1855505042385883597",
      "thread_id": "1855499386165379161",
      "content": "@radshaan you realize most constraints are made up when the gold you're seeking is right and true"
    },
    {
      "id": "1855498636274352393",
      "thread_id": "1855496759008735471",
      "content": "@radshaan let your gold drive you to your real constraints"
    },
    {
      "id": "1855484594407247915",
      "thread_id": "1855484594407247915",
      "content": "uncompromise. https://t.co/bDaOKwHLHY"
    },
    {
      "id": "1855479286230073544",
      "thread_id": "1855476333259919633",
      "content": "@Steve_Sule https://t.co/ZcT2u0GXFa"
    },
    {
      "id": "1855475446642835476",
      "thread_id": "1855475446642835476",
      "content": "every essay starts with a bunch of good sentences\n\nno good sentences, no good essay"
    },
    {
      "id": "1855159675337216122",
      "thread_id": "1855158923210506327",
      "content": "@mryalamanchi \"honest mistake\" is probably giving her too much credit."
    },
    {
      "id": "1855143695479455955",
      "thread_id": "1855141955950264456",
      "content": "@OtakuProcess republicans ki baat kar raha hu biraadar"
    },
    {
      "id": "1855131457473450308",
      "thread_id": "1855131457473450308",
      "content": "phoole nahi sama rahe bhai"
    },
    {
      "id": "1855120768218407414",
      "thread_id": "1855118413091553622",
      "content": "you're fighting the war against sexism and patriarchy when you meet a man with a common surname like shah, patel, yadav, singh, agarwal... and use his first name"
    },
    {
      "id": "1855118413091553622",
      "thread_id": "1855108687247118633",
      "content": "do you also know that vivek ramaswamy is called vivek more than ramaswamy"
    },
    {
      "id": "1855116803808412138",
      "thread_id": "1855115128867353068",
      "content": "@rakwtf no no, i'm not saying it's simpler. it's contingent on a lot of stuff and can't be attributed to a single cause"
    },
    {
      "id": "1855112128388382987",
      "thread_id": "1855110090983944651",
      "content": "have you considered the fact that famous men in the same domain have usually taken all the surnames, so the only differentiator we have is the first name\n\ncounter examples are way too many for the point to hold:\n\nsitharaman, sharapova, navratilova, elvis, kanye, swiftie...\n\nit's an absurdly simplistic connection at best, driven by motivated reasoning."
    },
    {
      "id": "1855108687247118633",
      "thread_id": "1855108687247118633",
      "content": "what if i told you it had to do with her looks and that she looks more like a kamala than a harris :)"
    },
    {
      "id": "1855107945832628451",
      "thread_id": "1855107945832628451",
      "content": "we are once again entering the era of hero worship after a long period of having no gods"
    },
    {
      "id": "1854927815134880170",
      "thread_id": "1854927815134880170",
      "content": "♥️ https://t.co/jhwhbXiqG7"
    },
    {
      "id": "1854924667632730129",
      "thread_id": "1854924667632730129",
      "content": "rolle's mean value theorem"
    },
    {
      "id": "1854923900192543157",
      "thread_id": "1854923900192543157",
      "content": "if you want to get a non-dualistic interpretation of islamic monotheism (and the argument against polytheism), read ibn arabi's know yourself\n\np. s. there's no argument. every master everywhere ultimately says the same thing. it's only the ignorant who go to war with second-hand words absent understanding."
    },
    {
      "id": "1854921736187519223",
      "thread_id": "1854921736187519223",
      "content": "you know what the secret to building psychic defenses is?\n\nit's being defenseless within.\n\nintrusive thoughts gonna intrude if you have a huge identity you need to have your defenses up to protect at all times.\n\nbut when all ideas are okay and open for consideration, there's no need to be at war at all."
    },
    {
      "id": "1854905831286096129",
      "thread_id": "1854903616844206381",
      "content": "@dejavucoder just a gay thing ig"
    },
    {
      "id": "1854901032931017188",
      "thread_id": "1854898599697826090",
      "content": "this movie is so bad jfc"
    },
    {
      "id": "1854898599697826090",
      "thread_id": "1854898599697826090",
      "content": "watching a movie rated 4.4 on imdb every once in a while builds antifragility"
    },
    {
      "id": "1854843166308118634",
      "thread_id": "1854842383676195002",
      "content": "@JustAnkurBagchi no"
    },
    {
      "id": "1854587376674505202",
      "thread_id": "1854587207287554457",
      "content": "@isenditbacc i swear"
    },
    {
      "id": "1854559162501656852",
      "thread_id": "1854431811566493815",
      "content": "1) just open a separate bank account and dump emergency fund money there\n\n2) might be an extreme pov, but no point \"managing money\" or exploring ten financial instruments till you're making at least $500k a year, ideally a million. the juice simply isn't worth the squeeze. all that time could be better spent on increasing your competence and earning more. the former is incremental benefits at best; the latter compounds"
    },
    {
      "id": "1854476451892154647",
      "thread_id": "1854476451892154647",
      "content": "nice!"
    },
    {
      "id": "1854465983211294869",
      "thread_id": "1854465983211294869",
      "content": "all personal trauma and injury becomes a weapon in the hands of a tyrant."
    },
    {
      "id": "1854463661043327483",
      "thread_id": "1854458923182678424",
      "content": "this is not to say that anyone else can have my precise vantage or have as much context as i do. i and i alone will have all the context at all times, because only i am privy to my real intent.\n\nhowever, acknowledging that i alone possess the full context isn't a justification for judgment, but rather the very reason judgment becomes impossible. the exclusive nature of my vantage doesn't empower me to judge; it disqualifies me.\n\nso, the only moments of true seeing come through conflict — when my carefully constructed self-understanding meets resistance... not through my internal narrative or rationalization, but through my immediate, unpremeditated response. \n\ndo i defend or say it like it is? the answer reveals everything.\n\nthis is why masters never judge: they understand that another's complete context is forever inaccessible. instead, they simply ask questions. the way someone responds tells the whole story, far more than any explanation they might give.\n\nthey create the space for truth to reveal itself through response. the question becomes a mirror, and the response shows what needs to be shown.\n\nwhether the seeker accepts or rejects what he sees depends on his sincerity alone."
    },
    {
      "id": "1854458923182678424",
      "thread_id": "1854458923182678424",
      "content": "truthseeking ends up in paradox. and once paradox is encountered, context becomes everything. \n\nyet context itself can become a trap. since much of my context is internal, i can easily delude myself into thinking that my view must be right simply because no other person inhabits my precise vantage. \n\nif i'm the only one with all the context at all times, i can justify anything.\n\nthis is one of the most subtle and dangerous forms of self-deception, precisely because it's where fear and self-interest masquerade as deep wisdom. the very recognition of context's all-pervading importance will lead to a new kind of dogmatism if you aren't careful.\n\nthis — being a clear mirror unto thyself — is the real work involved in meditation. and it never ends. its only destination is absolute confusion. and absolute confusion is freedom from the known.\n\nnote to self."
    },
    {
      "id": "1854445918499836090",
      "thread_id": "1854445918499836090",
      "content": "i had a friend in college who didn't like looking at himself in the mirror because the story that popped up in his head wasn't very good."
    },
    {
      "id": "1854181555398127808",
      "thread_id": "1854180100281123072",
      "content": "@Niharika__rao yes. all part of my grand scheme. https://t.co/7lGuWnbJwu"
    },
    {
      "id": "1854174821237874774",
      "thread_id": "1854174821237874774",
      "content": "made errors with both memes today, i'm truly on the decline and it'll all be over for me soon inshaallah"
    },
    {
      "id": "1854157887687528527",
      "thread_id": "1854157887687528527",
      "content": "MELANIA BHABHI HATIYE"
    },
    {
      "id": "1854150536263807435",
      "thread_id": "1854150536263807435",
      "content": "thank you modiji https://t.co/lJTL4kphpw"
    },
    {
      "id": "1854146039798001856",
      "thread_id": "1854145378062614999",
      "content": "the true ideal state would be one of pure intrinsic motivation, completely uncoupled from external measures. \n\nbut we carry deep conditioning that makes us instinctively grasp for benchmarks and comparisons, even when we are genuinely passionate about something. \n\nwe can't help but look sideways at others or measure ourselves against arbitrary standards.\n\nso the real work becomes one of progressive unconditioning"
    },
    {
      "id": "1854145378062614999",
      "thread_id": "1854126855240217030",
      "content": "the second statement sounds like a non-sequitur.\n\nif you're really into it, would benchmarks matter at all?\n\nin the ideal case, they wouldn't. but conditioning runs deeper than we think it does.\n\nso the natural journey one embarks on once they're deeply invested in something is that of getting rid of one's conditioning, at least within one's domain of mastery."
    },
    {
      "id": "1854143566089756864",
      "thread_id": "1854143566089756864",
      "content": "this is real hater energy 💀🤣 https://t.co/t9DT6hG6cW"
    },
    {
      "id": "1854140065435549789",
      "thread_id": "1854131179433107802",
      "content": "@dadbodshuffl put false limits/constraints on your imagination"
    },
    {
      "id": "1854126855240217030",
      "thread_id": "1854126855240217030",
      "content": "if you're not into it, all benchmarks will overwhelm and burden you with stress and fomo\n\nand if you're into it, all benchmarks will only amount to shortchanging yourself"
    },
    {
      "id": "1853861586999365963",
      "thread_id": "1853861586999365963",
      "content": "AI content creation is perfect for an era where the only thing that matters is novelty, even if brainrot. it'll be essential to churning out mindless novelty faster than ever before.\n\nbut as counterintuitive as it might sound, i predict most of it will still be better than the human-generated seo slop we've had since the last ten years."
    },
    {
      "id": "1853859447233196467",
      "thread_id": "1853856079454642508",
      "content": "@arindam___paul as the actual impact of a brand awareness / top-of-mind campaign is almost impossible to attribute, the optimal strategy for both marketer and business is to do what the competition is doing."
    },
    {
      "id": "1853858340709015708",
      "thread_id": "1853858340709015708",
      "content": "https://t.co/QLxcNtHcmg"
    },
    {
      "id": "1853856183150354461",
      "thread_id": "1853856183150354461",
      "content": "https://t.co/8M8zzz4EQJ"
    },
    {
      "id": "1853847804306993518",
      "thread_id": "1853847804306993518",
      "content": "when you have no competence and nothing better to do in life, these are the cheap thrills you find meaning in.\n\n\"look how good of a negotiator i am\"\n\npenny-wise but pound-foolish idiocy"
    },
    {
      "id": "1853838025857568811",
      "thread_id": "1853835524617936951",
      "content": "you'd think that the leader of the most powerful country in the world would at least embody above-average taste, excellence, or mastery, if not the superhuman ideal itself.\n\nbut then you realize politics is a game that actively incentivizes the selection of the not-even-mediocre, while people who represent the human ideal are elsewhere, indifferent to all of this."
    },
    {
      "id": "1853835524617936951",
      "thread_id": "1853835524617936951",
      "content": "if twitter was a sufficiently randomized sample (it isn't) you'd perhaps rightly think more people are voting for musk than trump at this point.\n\npeople are voting for \"definitely not harris\" and \"definitely not trump\", \n\nand not \n\n\"for harris\" or \"for trump\", which is a crucial distinction between having the right candidate vs. having the more palatable option.\n\nit's a competition of the mediocre, for the mediocre, by the mediocre. \n\nplease don't @ me with their political/marketing brilliance, i don't care. i think the job of a leader is much more than selling snake oil."
    },
    {
      "id": "1853818745392869397",
      "thread_id": "1853817277176754550",
      "content": "in any case, the value i've derived from this platform has reduced consistently over the years, so i'm already spending a lot less time here than i did before. can't relate to most things."
    },
    {
      "id": "1853817277176754550",
      "thread_id": "1853817277176754550",
      "content": "if trump is back in office, i expect twitter to turn increasingly insufferable for the next few years."
    },
    {
      "id": "1853808642048524731",
      "thread_id": "1853511400838279599",
      "content": "@dejavucoder @dhruvtrehan9 this feels exactly right to me. raw iq is the biggest differentiation, and is what will command higher pricing. if you had something that almost felt like AGI, even $10,000 a month would be pricing it too low."
    },
    {
      "id": "1853738965448462662",
      "thread_id": "1853738965448462662",
      "content": "parceltongue: the unique messaging you develop to communicate effectively with swiggy, zepto, and amazon delivery guys"
    },
    {
      "id": "1853736185954484475",
      "thread_id": "1853733639663804574",
      "content": "applies to humans, too, btw.\n\ncan't grasp what one hasn't understood for oneself. can use a lot of words but still miss the vital essence.\n\nanyway, seeking originality is a fool's goal: chasing it does not produce insight.\n\nthe essence (hear paradox) of originality is this: every truth realised for oneself, no matter how old its garment, is always born anew in the one realising it.\n\ntruth is always new and original, but the words it uses almost never are. old truths hide in novel contexts, so essence is rarely original, but the context and approach in which it was discovered can be, and usually is."
    },
    {
      "id": "1853733639663804574",
      "thread_id": "1853733639663804574",
      "content": "if an llm can say it better and more exhaustively than you can, it has been said before and in a much better way than you have; you aren't saying anything new.\n\nhowever when there's a touch of originality to whatever you're saying the llm will always miss it. it will say a lot of stuff, but it'll still miss the essence of what you were trying to say."
    },
    {
      "id": "1853503767955558497",
      "thread_id": "1853503767955558497",
      "content": "oh i may be troubled, but i'm gracious in defeat\nhttps://t.co/FJwfvGMt71"
    },
    {
      "id": "1853460035612901620",
      "thread_id": "1853456710242808292",
      "content": "caution: i love muted tastes with mild flavour profiles. if you have a mughal palate or just like spicy food with strong flavours, you will not enjoy this one at all.\n\ni loved it because it was so fucking smooth"
    },
    {
      "id": "1853456710242808292",
      "thread_id": "1853456710242808292",
      "content": "discovered a lovely shawarma place today, i'm so happy\n\nzaitoon in jp nagar"
    },
    {
      "id": "1853081837976916432",
      "thread_id": "1853081837976916432",
      "content": "absolute certainty can only be irrational; one can only convey doubt, never certainty; one can only convey reason, never unreason."
    },
    {
      "id": "1853039628829229541",
      "thread_id": "1853039628829229541",
      "content": "🌚 https://t.co/r6P7uTtUUY"
    },
    {
      "id": "1853028880946221283",
      "thread_id": "1853028880946221283",
      "content": "the weak see the world as a struggle for status and power; the strong just want to be left alone."
    },
    {
      "id": "1852990698544398345",
      "thread_id": "1852990698544398345",
      "content": "https://t.co/gRvtGXw4Yd"
    },
    {
      "id": "1852945065775112316",
      "thread_id": "1852945065775112316",
      "content": "a man's respect for society is inversely proportional to his respect for truth."
    },
    {
      "id": "1852942502405509379",
      "thread_id": "1852942502405509379",
      "content": "always remember that they crucified christ and later made a religion out of him because they couldn't bear the living version, only a dead one, which they could then create in their own image to further their own ignorance"
    },
    {
      "id": "1852648577534685240",
      "thread_id": "1852648577534685240",
      "content": "only on days i'm really joyful do i realise how miserable a place twitter actually is"
    },
    {
      "id": "1852608016295591982",
      "thread_id": "1852604892629868724",
      "content": "information is technology\n\nand the real information being generated here is the talent/mindset arbitrage tesla had over nasa that created the new designs with the new BOM. and the BOM is also dependent on the talent the company has to manufacture in house and optimise the cost of materials."
    },
    {
      "id": "1852605069843103984",
      "thread_id": "1852604543135064296",
      "content": "@mookimmegha all appeals to reason"
    },
    {
      "id": "1852602919389978818",
      "thread_id": "1852602531425157575",
      "content": "@mookimmegha why are you asking a mentally challenged person to be reasonable"
    },
    {
      "id": "1852602038003150939",
      "thread_id": "1852601019986743400",
      "content": "@mookimmegha kalidas before his transformation, yes"
    },
    {
      "id": "1852599816204824632",
      "thread_id": "1852595105573613920",
      "content": "@aakashd how so?"
    },
    {
      "id": "1852599497676779554",
      "thread_id": "1852599497676779554",
      "content": "primary reason why i'd be bearish on india\n\nmassive game theory problem"
    },
    {
      "id": "1852598457288077506",
      "thread_id": "1852598457288077506",
      "content": "\"good progress bars are hard\" is profound\n\nngl the best tweet i've read this week\n\ni'm gonna use this so much\n\ngood progress bars are hard."
    },
    {
      "id": "1852596777523835285",
      "thread_id": "1852596480801980674",
      "content": "@mookimmegha who is tulsiram"
    },
    {
      "id": "1852404973117555159",
      "thread_id": "1852404973117555159",
      "content": "wait, i think i have an answer. \n\nif the yap is coming from a place of sheer selflessness and truth, it affects others' consciousness in deep ways, often without them even being consciously aware of it.\n\nif it's not, it's just yap.\n\na selfless way of being is contagious; the degree of contagion depends on the receptivity of its recipients. but it makes itself known, without a doubt."
    },
    {
      "id": "1852394154371801168",
      "thread_id": "1852393989812654513",
      "content": "@hibicemesoot who tf knows, i don't"
    },
    {
      "id": "1852392438716940576",
      "thread_id": "1852392438716940576",
      "content": "i have been invited to a couple of podcasts in the past. never accepted the offer because i knew i would short circuit any philosophical conversation so quickly that there would be no interesting/entertaining conversation to be had any more after that. we would wrap up in 5 minutes, and the only thing we could talk about at length after that would be superficialities — a capacity i'm afraid i do not have anymore — so there would be no substance to the conversation.\n\nthis perhaps also explains the difference you see between j krishnamurti and ug krishnamurti. j krishnamurti yapped so much in his life because he really wanted to help people, while ugk didn't, because he wasn't interested or even considered he could help anyone. so he had an interesting way of short circuiting any philosophy, with an approach that actively discouraged conversation and yapping instead of encouraging it.\n\nif you really weren't interested in bakchodi — secretly hoping it produces some unique mental motions within a few and helps them — there'd be nothing left to say at all"
    },
    {
      "id": "1852379056395698212",
      "thread_id": "1852379056395698212",
      "content": "https://t.co/8ywUhloLEP"
    },
    {
      "id": "1852248032303288372",
      "thread_id": "1852248032303288372",
      "content": "the need underlying all needs is the need to feel special, singularly gifted, uniquely blessed"
    },
    {
      "id": "1851974419482112125",
      "thread_id": "1851974419482112125",
      "content": "i have little to no curiosity about the world, and i have no taste for trivia."
    },
    {
      "id": "1851894261173600429",
      "thread_id": "1851891959054405726",
      "content": "@adithi_mallesh none of them wants to socialise with you, unfortunately"
    },
    {
      "id": "1851894113051762906",
      "thread_id": "1851894113051762906",
      "content": "💀 https://t.co/VWeS5C0dnz"
    },
    {
      "id": "1851873771998642411",
      "thread_id": "1851873771998642411",
      "content": "https://t.co/2tQnTJNYi8"
    },
    {
      "id": "1851839734215270519",
      "thread_id": "1851839304768663798",
      "content": "@Ajain112 this https://t.co/DBqwhRRZzU"
    },
    {
      "id": "1851522845748375571",
      "thread_id": "1851521825605333174",
      "content": "@Infinite_Outlaw when you have to say something so obvious, you should realise that wasn't the point"
    },
    {
      "id": "1851488038335234454",
      "thread_id": "1851488038335234454",
      "content": "indisciplined people attribute their success to luck way more than their disciplined peers. and the problem primarily has to do with how we define discipline and luck.\n\nif you're someone others might call \"indisciplined,\" you're likelier to chalk up your wins to luck. meanwhile, if you fit the \"disciplined\" mold, you might rarely credit luck at all. \n\nthis says more about our collective biases than it does about how success actually works.\n\nyou might be getting things done in ways that work perfectly for you, but because they don't match what we're taught discipline should look like — all those rigid schedules and visible struggle — you discount your own effective patterns. \n\nwhen success comes, you might think \"i just got lucky\" because you weren't \"really trying\" in the way we are told we should.\n\nbut if you're the type who checks all the discipline boxes, you might push through and achieve some success even when you're focusing on the wrong things. \n\nand because you've put in all this visible effort that matches what we think discipline should look like, you'll probably resist seeing any role luck might have played.\n\nyou're so caught up in what we think discipline should look like that you miss what actually works. \n\nyour effectiveness doesn't need to wear the costume you expect it to."
    },
    {
      "id": "1851482655101239431",
      "thread_id": "1851481934121353574",
      "content": "podcasts and autobiographies, both fall prey to the post-hoc rationalization bias. a consistent stream of public writing over the years avoids this, by design."
    },
    {
      "id": "1851481934121353574",
      "thread_id": "1851479957073215650",
      "content": "the beauty of writing online is having your own permissionless platform that isn't gatekept from you due to some narrow conception of what the market wants to see.\n\nyou can write whatever you want, whenever you want, without seeking permission from someone who thinks what you have to say is only valid if you meet certain criteria."
    },
    {
      "id": "1851479957073215650",
      "thread_id": "1851479957073215650",
      "content": "most podcasters want to have you as a guest only after you've arrived at outlier success in your domain. and that is why most podcasts will never go beyond vacuous and retrofitted gyaan."
    },
    {
      "id": "1851291582550720637",
      "thread_id": "1851291582550720637",
      "content": "if you turn unemployable, you will have to figure it out. and you likely will.\n\n(no need to immediately anchor on the thought of being a billionaire founder. you can be a mercenary/small dhandho and do just fine.)\n\nbut if you can fit into the 9-5 mould and are just comfortable enough fitting in, you will likely not take a plunge. and if you do, it will most probably be due to some stupid reason or fomo. and it will not work out.\n\nthe reason has to be authentic to your natural design. taking this decision due to fomo rarely works."
    },
    {
      "id": "1851289137342718354",
      "thread_id": "1851288848795640232",
      "content": "https://t.co/bbf4DLSVFv"
    },
    {
      "id": "1851288848795640232",
      "thread_id": "1851288848795640232",
      "content": "this is the correct take. the most genuine and sincere reason for entrepreneurship is unemployability."
    },
    {
      "id": "1851275130972094603",
      "thread_id": "1851275130972094603",
      "content": "english standup makes me feel smart\nbut only hindi standup makes me laugh"
    },
    {
      "id": "1851197750236627421",
      "thread_id": "1851197310929420383",
      "content": "\"Ye, it is I, the boy.\""
    },
    {
      "id": "1851197310929420383",
      "thread_id": "1851197310929420383",
      "content": "He, the boy,"
    },
    {
      "id": "1851196475935805468",
      "thread_id": "1851196475935805468",
      "content": "\"let's touch base\" ok what base are we touching"
    },
    {
      "id": "1851192519524303136",
      "thread_id": "1851192519524303136",
      "content": "sudo rm -rf / https://t.co/2ixIvwOZ19"
    },
    {
      "id": "1851190303115657592",
      "thread_id": "1851190303115657592",
      "content": "\"it's difficult, but i'll do it for the shareholders. gotta do it for the shareholders.\" https://t.co/XbqEgTEBW8"
    },
    {
      "id": "1851188472754896933",
      "thread_id": "1851188472754896933",
      "content": "want to be a बुद्ध but turning into a बुढ़ऊ"
    },
    {
      "id": "1851154049728753671",
      "thread_id": "1851154049728753671",
      "content": "AI zhavli"
    },
    {
      "id": "1851137031281246653",
      "thread_id": "1851131165077340322",
      "content": "@Naina_2728 i find them all quite diseased tbh\n\nall that empty and lifeless white space with the product as the axis mundi... it reduces me to a clown chasing meaning in something absolutely trivial\n\nexistential malaise maxxing"
    },
    {
      "id": "1851134595271651610",
      "thread_id": "1851133604602192245",
      "content": "if you want to live out all your whims and fancies, with no jurisdiction, starting up is the least effective path you can choose. coasting comfortably as a well-paid 9-5 employee is much, much better.\n\nbut the best of all is having lots of money and little to no psychological dependence on other people."
    },
    {
      "id": "1851133604602192245",
      "thread_id": "1851133604602192245",
      "content": "no, starting up will not allow you to do as you please and be the master of your own life and schedule.\n\nonly an insanely fluffy cushion will do that.\n\neveryone is a slave, except the one who\n\nhas unfathomable psychological and/or financial security \n\nor \n\nis dead."
    },
    {
      "id": "1851130785442697305",
      "thread_id": "1851130785442697305",
      "content": "the only reason i'm in this job?\n\non a conceptual level: i like explaining things and i love interesting frames and ways to articulate stuff\n\non a concrete level: i love good sentences\n\nnothing makes my day more than an insight stated in a way that makes it obvious in retrospect"
    },
    {
      "id": "1851118453836709919",
      "thread_id": "1851118453836709919",
      "content": "life is long. if you don't have a purpose, shareholders and society will give you one to further their own myopic ends"
    },
    {
      "id": "1851107954293932249",
      "thread_id": "1851107954293932249",
      "content": "but the shareholders are retarded https://t.co/cjOSovUVwe"
    },
    {
      "id": "1850949200416244179",
      "thread_id": "1850949200416244179",
      "content": "the future is always good if you have a quiet mind and few desires."
    },
    {
      "id": "1850885158989119951",
      "thread_id": "1850885158989119951",
      "content": "podcasts have killed silence for a specific cohort"
    },
    {
      "id": "1850762477610598519",
      "thread_id": "1850762477610598519",
      "content": "this works partly because 'learning' as a concept is often too vague and lacks structure. pure learning has no concrete outputs or feedback loops to validate progress. in contrast, actively doing something provides clear markers of success and naturally reinforces what works. this creates positive momentum.\n\nthis hands-on approach often feels unsatisfying to the learner. we want to clearly define and catalogue the concepts we're mastering. \n\nbut real-world practice is messy; different skills and knowledge combine in incomplete ways. so, while it produces good results, the chaotic nature of \"doing the thing\" itself feels uncomfortable and disorganized.\n\nthe classic difference between an academic mindset and a doer mindset. academics wanna \"learn\" as a goal in itself, while most of us would be better off treating it as a means to an end and nothing more. so all the studying that has to happen will happen as a part of doing the thing and not as a separate end in itself.\n\nlearning is clean and simple; real world application is messy and complex."
    },
    {
      "id": "1850735770996445254",
      "thread_id": "1850697521536159962",
      "content": "@radshaan smartyy lag rha h"
    },
    {
      "id": "1850735170627969045",
      "thread_id": "1850643129722130790",
      "content": "@Ajain112 you can look it up on google, but in my head, it's what a loving mother would serve god if he showed up as a guest one fine day"
    },
    {
      "id": "1850516944136646817",
      "thread_id": "1850516944136646817",
      "content": "quite the chatty and chewy theatre today"
    },
    {
      "id": "1850475660625498254",
      "thread_id": "1850475660625498254",
      "content": "had such wholesome ghee pongal today, i cried a little"
    },
    {
      "id": "1850445344859193797",
      "thread_id": "1850445344859193797",
      "content": "if you never know what they're going to say next, they'll be as interesting as they'll be intimidating"
    },
    {
      "id": "1850444964217659679",
      "thread_id": "1850444964217659679",
      "content": "all you need to do is step out of the frame. and suddenly, it is all hilarious"
    },
    {
      "id": "1850443336584482985",
      "thread_id": "1850443336584482985",
      "content": "quick commerce speeds up premium mediocrity like nothing else"
    },
    {
      "id": "1849985290754195582",
      "thread_id": "1849985290754195582",
      "content": "😹😹😹"
    },
    {
      "id": "1849985208617140463",
      "thread_id": "1849985208617140463",
      "content": "🤣🤣🤣🤣🤣"
    },
    {
      "id": "1849509468221943921",
      "thread_id": "1849509468221943921",
      "content": "x tweets something. something that can be verified personally. independently. we don't pay attention. because x is a nobody.\n\nsuddenly, y, someone with influence and authority, retweets it. and we buy it wholesale.\n\nso, we remain a slave to words and authority.\n\nthe words were supposed to be a mirror. but we turned them into an image, put them up on a pedestal, and started parroting them.\n\nthis is the truth about how we operate.\n\nsee it for yourself the next time it happens. and you will know it. for yourself."
    },
    {
      "id": "1849504136296861914",
      "thread_id": "1849504136296861914",
      "content": "https://t.co/mjmHeE4ZQY"
    },
    {
      "id": "1849442910653288529",
      "thread_id": "1849437014791245933",
      "content": "@fruitycigar the natural place for those who like to pester and torment others with their insipid righteousness."
    },
    {
      "id": "1849442352852849095",
      "thread_id": "1849442352852849095",
      "content": "a question i find myself asking quite often these days: \n\nwould I have come up with this idea, habit, or way of living on my own? or did I just read it somewhere (or was inducted into some established order) and hence made it part of my life?\n\nsometimes i know i wouldn't have — which means I don't really understand it firsthand. i have no authority on it. i've merely accepted a way of life i do not understand and have never questioned.*\n\nand sometimes, the answer is \"yes, i was living with that idea all along and and reading about it just put words to what I already knew.\"\n\nthere are ideas that feel like they were downloaded versus those that were already living inside us, just waiting for the right words to crystallize them.\n\nknowing which is which is a big part of really knowing yourself.\n\nand it's almost unsettling when you start doing this audit of your own beliefs and behaviors and realize how many of them you've just... absorbed.\n\nlike, you might have strong opinions about how to structure your day or how many times to eat in a day or what constitutes \"success\" or even what makes you happy — but how much of that is actually from your own lived experience versus what you've internalized from books, social media, or just ambient cultural pressure?\n\nit is rare to truly arrive at something through pure observation and experimentation. but only that is real authority. everything else is second-hand goods that are not yours.\n\n*seeing this also rids me of the (unchallenged) necessity of believing in something or doing that thing. in that moment, i lose that part of my natural conditioning. that's one constraint/rule taken away from my rule book. i'm now a freer human being because i realise my lack of authority on it."
    },
    {
      "id": "1849403066543731133",
      "thread_id": "1849401956286287960",
      "content": "tl;dr\n\nonly pretty women (self-evaluation) wish for sugar daddies.\n\nthe not-so-pretty ones have to find another way to cope that's culturally acceptable and even admirable."
    },
    {
      "id": "1849401956286287960",
      "thread_id": "1849401956286287960",
      "content": "my very cancellable take on the matter:\n\nhow certain women react to this versus others depends a lot on where they secretly feel they have a competitive edge.\n\ngenerally, women who consider themselves beautiful and value their femininity don't mind maintaining the status quo and adapting to traditional gender roles because it works for them.\n\nbut women who feel they can't compete on this playground due to one or more reasons will often seek meaning in fighting tradition and build a personality out of feminism and equality.\n\nthis is, of course, a spectrum and not a binary. but you will *generally* find that the ones who will happily buy into the status quo and ones who won't are roughly split along this line. and both have selfish motives that have little to do with \"social good\" or \"social reform\""
    },
    {
      "id": "1849311248757956664",
      "thread_id": "1849310141306327516",
      "content": "@OtakuProcess ho gaya projection shuru"
    },
    {
      "id": "1849307442934628756",
      "thread_id": "1849307442934628756",
      "content": "psa: you can be open to someone's views without trying to put yourself in their shoes, because you can't."
    },
    {
      "id": "1849306912736866311",
      "thread_id": "1849279550376890638",
      "content": "@shapegrifter \"high openness\" people when they come across aella https://t.co/jmbPrZ4cre"
    },
    {
      "id": "1849305845492031970",
      "thread_id": "1849130710650573031",
      "content": "https://t.co/QT60A62S4u https://t.co/ciKfEzeBEN"
    },
    {
      "id": "1849144250467749914",
      "thread_id": "1849142656603189683",
      "content": "@Ajain112 the only love that can last for a lifetime, and more"
    },
    {
      "id": "1849130710650573031",
      "thread_id": "1849130710650573031",
      "content": "1. she likes me irrationally\n2. i like her irrationally\n3. we both render each others frameworks and optimisations null and void (not a separate point, really. just follows from the top 2)"
    },
    {
      "id": "1849093789547372756",
      "thread_id": "1849093789547372756",
      "content": "♥️ https://t.co/MPhtzKPDqK"
    },
    {
      "id": "1849058257886646676",
      "thread_id": "1849058257886646676",
      "content": "chikni chupdi chaaaaachi chikni chupdi chaachiii"
    },
    {
      "id": "1848617462096662932",
      "thread_id": "1848615655479906544",
      "content": "@dhruvtrehan9 i upload all the final, edited, ready-to-go artefacts i had prepared within that chat, and it works"
    },
    {
      "id": "1848605056091979795",
      "thread_id": "1848601460453294421",
      "content": "@birth_of_state is life a \"get the most bang for your buck\" optimization problem"
    },
    {
      "id": "1848604610975670585",
      "thread_id": "1848604610975670585",
      "content": "how am i going to accomplish anything even remotely nontrivial without long chats?\n\ngood judgment is an outcome of long, high-fidelity context windows https://t.co/GZrT98SgMo"
    },
    {
      "id": "1848596727043133742",
      "thread_id": "1848596727043133742",
      "content": "one of the biggest esoteric longevity secrets is having a small identity and a bad memory"
    },
    {
      "id": "1848387590300238073",
      "thread_id": "1848387590300238073",
      "content": "\"the thing about AI and how it's gonna take away jobs, primarily that of... i'm not gonna say what profession, what job title, and what industry... we know i can't say that... it is marketers.\" https://t.co/Uyep2l6phL"
    },
    {
      "id": "1848327021123731481",
      "thread_id": "1848326377390411866",
      "content": "@cynicalpunkbaby what's the difference? especially within the context i'm using it in\n\nyour taste defines your standards."
    },
    {
      "id": "1848324945715081647",
      "thread_id": "1848324945715081647",
      "content": "many of us know that one class topper who was always unhappy with her scores — even when she topped the class — while her classmates could only dream of hitting a mark she was hitting consistently.\n\nwe even hated her for all her needless cribbing and pessimism before an exam; we treated it as false and deceptive humility, feigned only to make her competitors underestimate her and turn complacent.\n\nand while this was really the case sometimes, often, it was just her failing to meet that abstract ideal of perfection in her mind.\n\nshe was led by her own taste. and she rarely paid attention to her competition."
    },
    {
      "id": "1848322314313605503",
      "thread_id": "1848320900464001347",
      "content": "@Shreshthstate to even honestly acknowledge that you have done a shit job on something genuinely nontrivial is an achievement.\n\neasy to larp self-criticism in trivial stuff, hard to be as transparent and honest about work with significant investment"
    },
    {
      "id": "1848321229381357668",
      "thread_id": "1848319476426535189",
      "content": "@JustAnkurBagchi there's a significant price to pay for idealism; having taste, standards, a bar... it's all idealistic and all of it demands its pound of flesh"
    },
    {
      "id": "1848317907258007619",
      "thread_id": "1848317907258007619",
      "content": "a defining marker of people with taste is they will find most things shit. it's just how it is. and they will usually be extremely dissatisfied with their own work.\n\nif you're doing a good job most of the time, you likely lack taste."
    },
    {
      "id": "1848310124101898655",
      "thread_id": "1848310124101898655",
      "content": "one key differentiator, i think, between founders who get funded and founders who don't is the ability to be utterly meme-brained and exhibit total devotion, sans nuance, to the latest and greatest memes out of the valley.\n\nif you do not pay your respects to the latest silicon valley memes, you will not get vc funding."
    },
    {
      "id": "1848309306736967870",
      "thread_id": "1848308761863028947",
      "content": "@paraschopra of course, have experienced it firsthand"
    },
    {
      "id": "1848293543238111717",
      "thread_id": "1848291888589336894",
      "content": "@prvkhvr doomscrolling"
    },
    {
      "id": "1848285905846472791",
      "thread_id": "1848285905846472791",
      "content": "\"A man can be himself only so long as he is elon; and if he does not love space, he will not love freedom; for it is only when he is elon that he is really free.\""
    },
    {
      "id": "1848281560773968014",
      "thread_id": "1848280565981618662",
      "content": "@paraschopra that's the early stage marketing hire's entire job"
    },
    {
      "id": "1848279433439744413",
      "thread_id": "1848278549947469861",
      "content": "@neilshroff tell that to our indian multi-millionaires and billionaires"
    },
    {
      "id": "1848273126674604220",
      "thread_id": "1848269883219271707",
      "content": "@neilshroff most of us just look poor. no amount of old money style will fix that."
    },
    {
      "id": "1848046390766903605",
      "thread_id": "1848042902351753375",
      "content": "@shakunixx yea, and it works on me because it's my northstar for life.\n\ni wish to wake up one day and have no conflicts at all.\n\ntill that happens, i'll take everything with a bag of salt."
    },
    {
      "id": "1848042902351753375",
      "thread_id": "1848042902351753375",
      "content": "the only argument against all wiseacring (it stops all my yapping immediately):\n\n\"so... where has all this gotten you so far? are you free of problems? are you at peace?\"\n\nthere's no comeback to this. the only right response is to shut the fuck up.\n\nand then continue anyway the next day. because what else is there to do."
    },
    {
      "id": "1848034884029136990",
      "thread_id": "1848034884029136990",
      "content": "https://t.co/CNkzkI1RQQ"
    },
    {
      "id": "1847995994828374175",
      "thread_id": "1847995994828374175",
      "content": "the algo is algoing today\n\nfront squatting 5 plates for reps is insane https://t.co/LnYXTKMK84"
    },
    {
      "id": "1847984264010219572",
      "thread_id": "1847976556091621674",
      "content": "@prvkhvr how dare you deem cool that which i've always taken for granted\n\nwide-eyed wonder is for plebs and normies. i have already experienced such divine delights that if i hear you call pedestrian stuff cool, i will only think you're a normie."
    },
    {
      "id": "1847950356208095294",
      "thread_id": "1847949931681636653",
      "content": "there is no way anyone in the world can make you do anything if you started being shameless.\n\nafter physical violence, there's memetic violence. and it starts with shame-based frames of looking at the world."
    },
    {
      "id": "1847949931681636653",
      "thread_id": "1847949931681636653",
      "content": "interestingness needs insight, or contrast, or both. genuine insight is hard to produce, but it's easy to create contrast via snark, looking down on others, shaming them, calling them names, etc.\n\nshame is abrahamic religions' gift to the world. if you look closely, you'll find it really fucking hard to come across tweets in tpot that aren't shaming you into a certain way of being.\n\nthe message always is \"you're not good the way you are. you need to become *this* to be good\"\n\nall of startup and tech-twitter is shame-driven.\n\nif you have strong preferences, you'll have to shame people into aligning with those preferences.\n\nit's memetic colonisation. and slavery to western memes is a very real thing."
    },
    {
      "id": "1847700299047186496",
      "thread_id": "1847700299047186496",
      "content": "losing respect."
    },
    {
      "id": "1847506491437179324",
      "thread_id": "1847479255808229837",
      "content": "@shapegrifter happens a lot with me, too"
    },
    {
      "id": "1847314760435421328",
      "thread_id": "1847312069781323844",
      "content": "@Niharika__rao hahahaha"
    },
    {
      "id": "1847314206154273194",
      "thread_id": "1847314206154273194",
      "content": "if someone tweets about how gratitude, purpose, meaning, etc., is begot via \n\n*this one thing*, \n\nit only tells you \n\n1. the author is perhaps feeling the emotion in that moment, and \n\n2. is attributing it to whatever it is they happen to be getting inspired from at that moment. \n\ndon't assume it tells you anything about the *thing* they're supplying as the answer to everything. it is likely that *the thing* is perhaps only *their thing* and it will do nothing for you.\n\nheck, let some months pass, and it will most likely stop doing much for them either.\n\na crucial aspect of the mimesis-driven life experience is that a large part of it is spent merely convincing yourself of the promised effects of the experience, and has nothing to do with the experience itself. \n\nit's an idea. and it wears off as soon as the novelty wears off, and you're back at square one."
    },
    {
      "id": "1847308956705677411",
      "thread_id": "1847304525813551192",
      "content": "@Samhanknr who knows"
    },
    {
      "id": "1847297879905366028",
      "thread_id": "1847297879905366028",
      "content": "even a hundred thousand morsels will not make this meal whole."
    },
    {
      "id": "1847252046711329050",
      "thread_id": "1847203251948564972",
      "content": "@fruitycigar @Kaynvas yes. it's sweet gujju dal from another state"
    },
    {
      "id": "1847251639452807216",
      "thread_id": "1847250478058328421",
      "content": "mimesis works predictably. every day i see it in myself and in others.\n\nno one is free from it. no one."
    },
    {
      "id": "1847250478058328421",
      "thread_id": "1847250478058328421",
      "content": "i was correct."
    },
    {
      "id": "1847218494313521511",
      "thread_id": "1847218494313521511",
      "content": "https://t.co/kHXZy6pPlr"
    },
    {
      "id": "1847132663741620437",
      "thread_id": "1847132663741620437",
      "content": "i'd call him bofa https://t.co/i4A5ZWNQCa"
    },
    {
      "id": "1846606893189386240",
      "thread_id": "1846606664834728386",
      "content": "@Ajain112 beerbiceps is i guess"
    },
    {
      "id": "1846592731151220751",
      "thread_id": "1846592731151220751",
      "content": "bad questions beget bad answers"
    },
    {
      "id": "1846539472608927955",
      "thread_id": "1846539472608927955",
      "content": "we will soon have\n\nintelligence too cheap to meter\nenergy too cheap to meter\n\nbut integrity???"
    },
    {
      "id": "1846194806176796973",
      "thread_id": "1846192516170698846",
      "content": "@fruitycigar it's the same with books as well. like most books aren't worth reading, most podcasts aren't worth listening. books are better with their delivery, sure. the format has more structure to it.\n\nbut ultimately, if the substance is good, the delivery takes a backseat."
    },
    {
      "id": "1846164343265939545",
      "thread_id": "1846164343265939545",
      "content": "what i've found is that it's quite easy to get lost in spiritual babble and fool yourself for years, without respite, when the more effective solution would've been to just fix the most immediate and concrete problem."
    },
    {
      "id": "1846163810731847792",
      "thread_id": "1846162490415370522",
      "content": "you can be a jiddu krishnamurti and speak the truth while being absolutely unhelpful\n\nor you can meet me where i am, and help me fix my most immediate problems\n\nyou have to meet the questioner at the level of his questions. you may choose not to, as i do quite often, but if the intent is to get someone really moving, it's arguably the better option."
    },
    {
      "id": "1846162490415370522",
      "thread_id": "1846157920771494147",
      "content": "i don't disagree with you, you're correct.\n\nbut what you're referring to is not actionable for almost everyone. it's generally a lot more useful to discover where insecurity finally arises from when you're secure on most external fronts and can now see that you're still fundamentally insecure.\n\nto viscerally realise \"money is not the answer to your problems\", you usually need to earn a lot of it first.\n\nsame goes for most of our insecurities. they're all insecurities *about something*. fix what you're insecure about. see if it worked.\n\nfix every external source of insecurity. then learn what insecurity fundamentally is for yourself."
    },
    {
      "id": "1846154663839535245",
      "thread_id": "1846149874166702417",
      "content": "@_CynicalCyanide https://t.co/3Kcn4O8Htk"
    },
    {
      "id": "1846137446951440741",
      "thread_id": "1846137446951440741",
      "content": "whoever thinks the answer is \"loving yourself\" or \"recognizing your self worth\" 🤡\n\ninsecurity is a problem rooted in the external, so its solution also must come from the external.\n\nthe only real answer here is getting as much validation you need from the people you want it from, till you no longer feel the need to prove yourself to anyone and your accomplishments create a net of security under you.\n\nnow, there are short term, immature ways to gain validation and there are long term approaches to validation.\n\ngo for the latter, obviously. validate your competence, build proof of usefulness in whatever game you are attached to, and create a portfolio of successful outcomes that allows you to eventually decouple your identity from unsuccessful ones.\n\nonce you know you're capable, your confidence doesn't take a hit when you fail or face rejection."
    },
    {
      "id": "1846130869255201148",
      "thread_id": "1846130869255201148",
      "content": "podcasts solve for both demand and supply side incentives at once:\n\n1. they're high alpha: stuff you hear in a good podcast you won't find documented anywhere else. so they have high entertainment value\n\n2. conversations are a great way to reveal experiences and domain insights you'd never have fleshed out or articulated otherwise, so they're valuable even for the guests, not just for the hosts\n\n3. they are vastly easier to produce than other long form content like books, or even video/text essays, because you're sourcing and leveraging content your guests already have\n\n4. they're relatable: for once, people get to see your spontaneous and natural side, and not a carefully engineered or doctored one. they're able to see themselves in you once you stop being a purely digital persona and come out in the flesh\n\n5. they require lower intellectual investment than a book and are more engaging to a wider base\n\n6. they align with the incentives of the platforms  that are heavily pushing video because it increases time spent on the platform\n\nand some more reasons i can't recall right now"
    },
    {
      "id": "1846074579925553267",
      "thread_id": "1846073339036467281",
      "content": "@_swanand i think you'll enjoy it. haven't seen anything else like it."
    },
    {
      "id": "1846072472820498779",
      "thread_id": "1846071561008091325",
      "content": "@_swanand dad has hanma yujiro energy 👺"
    },
    {
      "id": "1845871407579684968",
      "thread_id": "1845870584413982838",
      "content": "calling him pedantic is actually giving him a concession and the benefit of doubt, tbh\n\nthis is not even pedantry, it's ideological sophistry."
    },
    {
      "id": "1845870584413982838",
      "thread_id": "1845870584413982838",
      "content": "pedantry and sophistry, both rolled into one"
    },
    {
      "id": "1845692946412097979",
      "thread_id": "1845692184839799262",
      "content": "a lot of writing these days is about how to write, because the author doesn't have insight into any other domain, just the craft of writing itself."
    },
    {
      "id": "1845692184839799262",
      "thread_id": "1845692184839799262",
      "content": "good content is a byproduct of the work you do and the life you live. if your work itself is creating content, naturally a lot of content you create will be about the craft of creating content.\n\nwhich is why, only podcasters are a genre of content creators who have a long shelf life. because they aren't producing all that content; their guests are.\n\nif you wish to create interesting content all by yourself, better have some natural curiosity or work experience outside of creating content."
    },
    {
      "id": "1845388368516931890",
      "thread_id": "1845388368516931890",
      "content": "spill the socie-tea"
    },
    {
      "id": "1845352007588000158",
      "thread_id": "1845352007588000158",
      "content": "why is everything a matter of shame these days\n\nwhy is everything me vs you, and my life vs yours\n\nwhy does this tweet exist\n\nthey were shocked because in their world, they hardly met people who hadn't seen the movie\n\nyou hadn't seen the movie because, well, you hadn't seen it\n\nthere's zero need to peacock over who lives a better life"
    },
    {
      "id": "1845051130671218800",
      "thread_id": "1845051130671218800",
      "content": "the purpose of life is to realise its own novelty."
    },
    {
      "id": "1844791527148486733",
      "thread_id": "1844791527148486733",
      "content": "i've seen a million numbered doors on the horizon\nnow, which is the future you're choosing before you go dyin'?\ni'll tell you about a secret I've been undermining\nevery little lie in this world comes from dividing\nhttps://t.co/LWlShYTsLQ"
    },
    {
      "id": "1844778155267051531",
      "thread_id": "1844778155267051531",
      "content": "an empty gallery,\nand a bad memory.\nevery day a clean slate,\nno past, no future.\ni am become\nthe creator and the created;\nthe axis of the world."
    },
    {
      "id": "1844743496311169074",
      "thread_id": "1844743496311169074",
      "content": "https://t.co/DNeXYCrQGA"
    },
    {
      "id": "1844446148247064869",
      "thread_id": "1844430992175718904",
      "content": "@mookimmegha if i did that, i would never poast"
    },
    {
      "id": "1844446030647161327",
      "thread_id": "1844446030647161327",
      "content": "the decisive moment"
    },
    {
      "id": "1844414133665681882",
      "thread_id": "1844411164773712092",
      "content": "@mookimmegha i never draft. except for the articles"
    },
    {
      "id": "1844337528595415394",
      "thread_id": "1844336905183457288",
      "content": "@Samhanknr yes, not downplaying any of it, all of it's great"
    },
    {
      "id": "1844331454412808272",
      "thread_id": "1844330378737369279",
      "content": "@Samhanknr straight out of the art of manliness playbook"
    },
    {
      "id": "1844327912754892875",
      "thread_id": "1844327912754892875",
      "content": "the larger underlying narrative here is \"integration.\"\n\nothers like musk and tate seem entirely unbalanced in a particular direction. it makes them look threatening and toxic.\n\nzuck also fit the same category, once.\n\nbut his narrative arc has gone from being an unbalanced autistic nerd to a balanced and well-integrated man.\n\nonce you see this, everything about his transformation starts making sense.\n\nit also makes sense purely from a PR perspective as meta is no longer a startup but a large enterprise. naturally, the comms and overall perception needs to feel safe and non-threatening, like salesforce's."
    },
    {
      "id": "1844317360704061572",
      "thread_id": "1844316297955332444",
      "content": "there's a hard cap on the lower end as well. a person with a net worth of 1 lakh can't buy any car at all"
    },
    {
      "id": "1844316693277106488",
      "thread_id": "1844314282701517285",
      "content": "@oshozindahai can you elaborate?"
    },
    {
      "id": "1844316497990267211",
      "thread_id": "1844313531459744059",
      "content": "@oshozindahai would love to know"
    },
    {
      "id": "1844316297955332444",
      "thread_id": "1844316297955332444",
      "content": "there is an interesting question here, btw. \n\ni was with a friend in delhi not that long ago. and there, we saw a BMW SUV in front of us in the traffic. and i asked him if he knew how expensive it was.\n\n\"3 cr.\"\n\n\"i wonder why someone would spend that amount of money on a car. i personally wouldn't spend that much on a car even if i had that kind of money\"\n\n\"dekho baba, 3 cr ki gaadi hai matlab atleast 300 cr ka net worth toh hoga\"\n\nso, in his mind, someone would buy a car worth X if their net worth was at least 100x.\n\nnow, i don't think this multiple is constant or even scales linearly, because you quickly hit the limit on how expensive a car you can buy, as compared to how much wealth you can own.\n\n(as long as you're not a person who buys diamond-studded iphones or gold lambos)\n\nbut, what i'm more interested in knowing is the perception. if I have a 10 lakh rupee car, how much would you assume my net worth is?\n\nof course, most of it depends on your knowledge of what kind of person i am. if i'm really pragmatic and down-to-earth, my car would scarcely be a good proxy for my net worth. and if i'm really status-seeking, an expensive car would be one of the first things i buy when i start earning well. \n\nso the 100x multiple in the former would be more like a 1.5x - 2x multiple in the latter."
    },
    {
      "id": "1844312082184827324",
      "thread_id": "1844312082184827324",
      "content": "the audience he is talking to doesn't exist.\n\nhe's talking to someone who *he thinks* buys a 75 cr flat to improve their standard of living and is out in the market comparing prices, specifications, and seeking the most bang for the buck.\n\nhowever, no one is buying a 75 cr flat in gurgaon to improve their standard of living. they're buying it for investment / diversification / status / etc.\n\nyou buy a 75 cr flat in gurgaon when you have so much money, you don't know what to do with it.\n\nif you're buying a 75 cr flat, you will also have all the alternatives he suggested and then some more. or a lot more.\n\nit's not an either/or, it's and"
    },
    {
      "id": "1844277639131038031",
      "thread_id": "1844277639131038031",
      "content": "bro thinks someone buying a 75 cr flat has only 75 cr 🤣🤣🤣"
    },
    {
      "id": "1844257336015323488",
      "thread_id": "1844256110372585753",
      "content": "@chiraguh @Ajain112 yes, have them for indoor wear. they're great."
    },
    {
      "id": "1844253323567956071",
      "thread_id": "1844253323567956071",
      "content": "arey sab bakwaas hai"
    },
    {
      "id": "1844235014285951241",
      "thread_id": "1844195585609646415",
      "content": "@chiraguh @Ajain112 have only tried these cheaper ones, haven't tried the supima cotton ones\n\nhttps://t.co/YVFHGheQYq"
    },
    {
      "id": "1844043312501821522",
      "thread_id": "1844035856442732748",
      "content": "@Naina_2728 ready to eat"
    },
    {
      "id": "1844033513978536038",
      "thread_id": "1844033123929190876",
      "content": "@Naina_2728 popcorn"
    },
    {
      "id": "1843979421038071939",
      "thread_id": "1843973235127513449",
      "content": "@abnux ACT. my experience with airtel wasn't great but ymmv"
    },
    {
      "id": "1843926841981317625",
      "thread_id": "1843925607161184400",
      "content": "@Ajain112 jockey actually offers the best of both worlds. their tshirts are fantastic, breathable, w/ excellent longevity. also their tshirts don't look undershirts, due to the thicker neck"
    },
    {
      "id": "1843925607161184400",
      "thread_id": "1843912472190955670",
      "content": "that may be one of the reasons but i'll tell you mine:\n\nthick t-shirts with necks that are higher up and cover more of your chest just look way better than those tshirts with thin and large necks.\n\nthe latter look shabby, and only people with ripped bodies can pull them off. and even then, they would look better in a quality tshirt that holds its shape."
    },
    {
      "id": "1843524921156350042",
      "thread_id": "1843521592267288755",
      "content": "@sisprasin primarily a lack of spiritual and moral conflict due to acute self-knowledge, svadharma"
    },
    {
      "id": "1843522272549843015",
      "thread_id": "1843519550119182493",
      "content": "also why herman hesse's siddhartha is such a masterful piece of work. it subverts the common, oversimplified interpretations of buddha's teachings and presents a journey of self-discovery that doesn't rely on prescribed paths or easy answers."
    },
    {
      "id": "1843519550119182493",
      "thread_id": "1843519550119182493",
      "content": "if you cannot relate the bhagavad gita with diogenes the dog, your understanding of the bhagavad gita is merely aesthetic, and you probably like the gita for its resonance with christian dualistic values, not for its essence, which you haven't even begun to understand, because you have little self-knowledge.\n\na catholic interpretation of the bhagavad gita leads to simplistic, prescriptive, and aesthetic understandings of good and bad, right and wrong. but the gita, at its core, transcends such easy categorizations.\n\nif you want to even understand jesus and the bible, it's much better to read meister eckhart than any catholic interpretation of the same."
    },
    {
      "id": "1843510467320218091",
      "thread_id": "1843404847451910640",
      "content": "i used to think the same way a few years ago. as an intellectual concept, it's tricky. try to generalise or prescriptionise it and you get stuck in a paradox. but experientially, the difference between someone who is authentic and someone who isn't is as clear as night and day.\n\nthe former isn't selling as much. their identity doesn't feed on your validation."
    },
    {
      "id": "1843362749272949057",
      "thread_id": "1843361462292754729",
      "content": "a smooth-brained pleb."
    },
    {
      "id": "1843361462292754729",
      "thread_id": "1843360817926004910",
      "content": "i long to be simple-minded. artless."
    },
    {
      "id": "1843360817926004910",
      "thread_id": "1843360817926004910",
      "content": "there's a cruel irony at play here, an unavoidable tragedy born from the marketing-codedness that's infected our perception and behavior. \n\neven the truth, when spoken, risks being reduced to mere cliches and buzzwords. \n\nwe've poisoned the well of human interaction so thoroughly that we can no longer drink from it without suspicion.\n\nwe've become cynical, snarky observers of our own lives and the lives of others."
    },
    {
      "id": "1843357450457489744",
      "thread_id": "1843357450457489744",
      "content": "https://t.co/2xGLTTEIw3"
    },
    {
      "id": "1843341112301498751",
      "thread_id": "1843341112301498751",
      "content": "may your life be a series of bad decisions leading to timeless realizations"
    },
    {
      "id": "1843340057475985745",
      "thread_id": "1843340057475985745",
      "content": "because it's not logical or objective or even describable. though one can always try to describe it, and — with some luck and some skill — perpetually fail upwards. https://t.co/JwkjeDilpY"
    },
    {
      "id": "1843339922926907571",
      "thread_id": "1843339922926907571",
      "content": "🤙"
    },
    {
      "id": "1843338254487302444",
      "thread_id": "1843312841568510173",
      "content": "@shakunixx oh, if strength means arguing convincingly on the internet, for sure.\n\na lot of what i write, i cannot defend anymore."
    },
    {
      "id": "1843336567731171776",
      "thread_id": "1843312841568510173",
      "content": "@shakunixx why blame me when it's you who don't get the point?"
    },
    {
      "id": "1843336265720377620",
      "thread_id": "1843336265720377620",
      "content": "kunal shah the founder will be replaced by AI. kunal shah the human won't be."
    },
    {
      "id": "1843335780678459782",
      "thread_id": "1843312841568510173",
      "content": "@shakunixx kunal shah the founder and kunal shah the human are two very different entities. i talk to the human, not to the founder."
    },
    {
      "id": "1843333954298155411",
      "thread_id": "1843333818595619260",
      "content": "@shakunixx (got nothing to do with the chain smoking btw)"
    },
    {
      "id": "1843333818595619260",
      "thread_id": "1843312841568510173",
      "content": "@shakunixx yes, he's a large language model"
    },
    {
      "id": "1843328811481612723",
      "thread_id": "1843312841568510173",
      "content": "@shakunixx i talk to the human, not to the founder. also, what are you smoking?"
    },
    {
      "id": "1843314187193516171",
      "thread_id": "1843313092178149789",
      "content": "@ponnappa it's called discipline. https://t.co/HKuqtmpcNw"
    },
    {
      "id": "1843312841568510173",
      "thread_id": "1843312841568510173",
      "content": "when you are really serious, you make all sorts of trade-offs without even thinking about them."
    },
    {
      "id": "1843310574429700415",
      "thread_id": "1843310143657984309",
      "content": "@OtakuProcess langoor see, langoor do"
    },
    {
      "id": "1843310105158402404",
      "thread_id": "1843310105158402404",
      "content": "what you understand, you are.\nwhat you don't understand, you copy."
    },
    {
      "id": "1843305781233590742",
      "thread_id": "1843302507134832734",
      "content": "@OtakuProcess *langoor"
    },
    {
      "id": "1843300471441912104",
      "thread_id": "1843300471441912104",
      "content": "all you need to do to be a motivational speaker today is go to the gym. people will lap up all the shit you say when you have a good physique. it's so fucking pathetic."
    },
    {
      "id": "1843232396721946820",
      "thread_id": "1843228129298665851",
      "content": "@Niharika__rao if one must focus, one can't focus.\nperhaps one could try to embrace the distraction,\nand turn it from hindrance to joyful attraction?"
    },
    {
      "id": "1843224317087326674",
      "thread_id": "1843222416430121023",
      "content": "@Niharika__rao what kind of service and expertise do you need?"
    },
    {
      "id": "1843218311661924379",
      "thread_id": "1843218073698144654",
      "content": "@Niharika__rao of course"
    },
    {
      "id": "1842884082851549609",
      "thread_id": "1842881248261288147",
      "content": "@mookimmegha https://t.co/dkn3qcKqHs"
    },
    {
      "id": "1842872183464370545",
      "thread_id": "1842850986903195753",
      "content": "@mookimmegha these are very low order bits, like a sattvic diet is a very low order bit."
    },
    {
      "id": "1842855939503800370",
      "thread_id": "1842707550011281567",
      "content": "@Shab_S25 the original post suggests high iq people taking pride in their suffering. i don't think that's as true today as it was 10 years ago"
    },
    {
      "id": "1842845584534736903",
      "thread_id": "1842814907651125413",
      "content": "@AmanShouts but then the mind is occupied in the music, which is the same activity. it is not quiet if it is engaging with the music, enjoying it. all of these devices are temporary external fixes and do not get to the heart of the problem."
    },
    {
      "id": "1842844592892235993",
      "thread_id": "1842831951620612451",
      "content": "@mookimmegha sounds may have cognitive benefits, but so does exercise. does it help you understand the nature of the mind though? i doubt it"
    },
    {
      "id": "1842680635766514008",
      "thread_id": "1842680635766514008",
      "content": "but this is not even true anymore. might've been a few years ago. today, many high iq people only want to signal being happy as that's the cool aspiration, currently.\n\nno one smart is taking pride in being seen as depressed."
    },
    {
      "id": "1842676687651119437",
      "thread_id": "1842676687651119437",
      "content": "an effective nitpick is so annoying not because it's wrong or logically incorrect, but because even though it may be correct, IT IS NOT THE POINT. \n\nthe argument in the nitpick is usually correct (and that's partly what makes it so effective and annoying), so you can't argue against it. and even when you can, you shouldn't, because that further strays the discussion away from the larger point and towards trivialities.\n\npeople who nitpick well are usually right, but also completely fail to see the point. so when someone constantly nitpicks, the only solution is to mute or block them."
    },
    {
      "id": "1842656622897766706",
      "thread_id": "1842656622897766706",
      "content": "💥💥💥"
    },
    {
      "id": "1842637811956044058",
      "thread_id": "1842637811956044058",
      "content": "as long as your aesthetic is socially desirable, you boast about truth, love, obsession, and everything cool. but i'd like to meet you the day when truth demands you turn into a leper, a pariah; i'd like to see your devotion then."
    },
    {
      "id": "1842191076683403627",
      "thread_id": "1842190469037805873",
      "content": "@Niharika__rao yes, they were quite forgettable"
    },
    {
      "id": "1842188293020217715",
      "thread_id": "1842187219089420600",
      "content": "@fafodesu no need to disagree, it's an opinion not an objective fact. enjoy your chai aur aunty ko namaste"
    },
    {
      "id": "1842186670856425738",
      "thread_id": "1842186670856425738",
      "content": "that's what he said (he didn't know his wife was cheating)"
    },
    {
      "id": "1842182663202799701",
      "thread_id": "1842182663202799701",
      "content": "chai is like bombay: utterly mid, with 1000x more romanticism going for it than it deserves"
    },
    {
      "id": "1841912389156917703",
      "thread_id": "1841898831492899224",
      "content": "you know the funniest thing is, as a kid, i used to dislike tea but i used to despise coffee, to the extent that its very aroma made me feel pukish.\n\nnever had either.\n\nbut now, i love coffee while i dislike tea to more or less the same degree.\n\nso the coffee situation has flipped completely, from pure hate to love. not sure how that happened.\n\na similar reversal happened with mangoes, cheese and ghee."
    },
    {
      "id": "1841900206985773460",
      "thread_id": "1841899974994342280",
      "content": "@OtakuProcess the same energy you lose digesting the milk"
    },
    {
      "id": "1841898831492899224",
      "thread_id": "1841898831492899224",
      "content": "chai is an absolutely mediocre drink. in fact it's so poor as a stimulant that people from chai-heavy cultures also have to eat ten packets of gutkha a day to feel anything."
    },
    {
      "id": "1841897792110731556",
      "thread_id": "1841819776357728332",
      "content": "@Niharika__rao so true"
    },
    {
      "id": "1841805283674533975",
      "thread_id": "1841805283674533975",
      "content": "tried wispr flow. while the transcription was fast and good, it was insanely unreliable, to the point that i sometimes spoke out loud for a good 2-3 minutes and it failed to capture and transcribe anything. so that was a good 3 minutes of yapping down the drain.\n\nhappened multiple times. uninstalled.\n\nmurmurtype is way more reliable and just as easy to use."
    },
    {
      "id": "1841755970185118163",
      "thread_id": "1841753698357203384",
      "content": "@mookimmegha for me, this orientation has been the default for many years now"
    },
    {
      "id": "1841752972385984555",
      "thread_id": "1841747111504654371",
      "content": "@mookimmegha isn't it what the platform is for?"
    },
    {
      "id": "1841737998368461062",
      "thread_id": "1841737998368461062",
      "content": "just like ikea furniture, their writing is optimised for distribution. they're all quite quotable."
    },
    {
      "id": "1841497848325538082",
      "thread_id": "1841496617796370941",
      "content": "also quite functional. perhaps, too functional.\nhttps://t.co/MyeFACSE9g"
    },
    {
      "id": "1841496617796370941",
      "thread_id": "1841496128618917890",
      "content": "this analogy is so synesthesic, only a few with mild to strong synesthesia will understand"
    },
    {
      "id": "1841496128618917890",
      "thread_id": "1841494733387870219",
      "content": "simple, and often interesting due to its simplicity. but if you have only that in your house and nothing else, you feel dull and bland, and miss out on the finer aspects of the craft."
    },
    {
      "id": "1841494733387870219",
      "thread_id": "1841494733387870219",
      "content": "paul graham is the ikea of writing"
    },
    {
      "id": "1841493030798254438",
      "thread_id": "1841493030798254438",
      "content": "if someone were to call me a gaandu today, presuming i would take it as an insult, they would be awfully disappointed. as i've matured, gaandu has only become a compliment to me. because i've always secretly wanted to be one, but somehow could never bring myself to really be one and earn the compliment. part of my shadow that still needs integration"
    },
    {
      "id": "1841439951289716788",
      "thread_id": "1841438663806226614",
      "content": "🎯 https://t.co/VsPBLEv6R2"
    },
    {
      "id": "1841438663806226614",
      "thread_id": "1841438663806226614",
      "content": "kierkegaard was a G\n\nhttps://t.co/NogHZplqcB"
    },
    {
      "id": "1841408183106978068",
      "thread_id": "1841408183106978068",
      "content": "😼 https://t.co/4CNHntPBE5"
    },
    {
      "id": "1841400670252835063",
      "thread_id": "1841400670252835063",
      "content": "belief is nothing but a lack of questioning. there's no \"choosing to believe.\" if you don't question, you believe by default."
    },
    {
      "id": "1841371726996717938",
      "thread_id": "1841371726996717938",
      "content": "https://t.co/4ugtZ0gNmz"
    },
    {
      "id": "1841364973395529749",
      "thread_id": "1841203704390959292",
      "content": "@igotdashotgun attention whoring"
    },
    {
      "id": "1841364841987989844",
      "thread_id": "1841199295812551044",
      "content": "@heyitstamanna oh fuck yeah, they really are attention whores"
    },
    {
      "id": "1841364668612325656",
      "thread_id": "1841240545185972542",
      "content": "@madisonjw makes sense"
    },
    {
      "id": "1841195730641568147",
      "thread_id": "1841184324055400701",
      "content": "@shakunixx morbid but interesting nonetheless"
    },
    {
      "id": "1841195538106007981",
      "thread_id": "1841187344948609207",
      "content": "@recurshawn how much can you learn with one braincell"
    },
    {
      "id": "1841185217513734395",
      "thread_id": "1841185083103027695",
      "content": "@chaotic_jz quite possible"
    },
    {
      "id": "1841184691933602036",
      "thread_id": "1841184436756337063",
      "content": "@gasgiants1 that's weirdly specific"
    },
    {
      "id": "1841184324055400701",
      "thread_id": "1841184324055400701",
      "content": "does anyone know why cats like pushing stuff off shelves and tables? give me your best theories"
    },
    {
      "id": "1841125905243971665",
      "thread_id": "1841125905243971665",
      "content": "all macro no micro makes jack a dull boy"
    },
    {
      "id": "1841056468595851291",
      "thread_id": "1841056468595851291",
      "content": "founders announcing ARR after one month of sales"
    },
    {
      "id": "1841039382502854737",
      "thread_id": "1841030688818282808",
      "content": "@radshaan give specific examples of projects that would make the cut and projects that wouldn't"
    },
    {
      "id": "1841023563240739004",
      "thread_id": "1841023563240739004",
      "content": "how complex a hardware project do i need to have in my portfolio for a hardware-first company to hire me?\n\ncan you share some examples of hardware projects you came across recently that made you go \"i'd like to work with this person\"? \n\nasking for a friend."
    }
  ]
}
